[
  {
    "title": "Painter",
    "listingDate": "Posted 2d ago",
    "company": "Extrastaff",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "We are looking for five experienced Painters to join our business, Extrastaff Limited. Our growing business requires organised and trustworthy individuals who pride themselves on quality workmanship. You must be motivated and result driven. You might be asked to work across the country to assist with our projects, so flexibility on work locations is preferred.The Painter is responsible for:Read blueprints/instructions and examine surfaces to determine the kind and amount of work necessaryMake on-site preparations such as building scaffolding, covering fixtures etc. Prepare walls and other surfaces for painting by scraping, using sandpaper, removing old paint etc.Fill cracks and holes with appropriate material (e.g. plaster)Mix paint and other materials to prepare the right colour or texturePaint surfaces according to instructions with various tools Apply varnish and other finishesCalculate costs and negotiate pricesTake and adhere to all health and safety precautions All other duties as assigned.Skills and experience required:3+ years of painting relevant experience OR relevant painting qualification is preferable, but not compulsoryFriendly, with good time management, & excellent work ethic are essentialTime management skills A commitment to learning and developing your skills within the industry Sound knowledge of H&S proceduresReliable and hardworking",
    "listedSalary": null,
    "hardSkills": "Equipment Handling Paint Application Project Execution Residential Painting Surface Preparation",
    "softSkills": "Adaptability Attention To Detail Reliability Team Player Time Management",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Tree Planter",
    "listingDate": "Posted 2d ago",
    "company": "Extrastaff",
    "location": "Whangārei",
    "employmentType": "Casual, Contract, Temp",
    "description": "Extrastaff are looking for a number of people to get stuck in immediately to a Tree Planting Role based around Kerikeri, we can offer transport to and from work and also accommodation is available as it is recommended to stay away on site for the week. Tree establishment work involves preparing planting sites, planting trees and then follow up work later in the year which involves spraying. No experience is necessary as training will be given over the first 2 weeks of work.This is a job for anyone who is physically fit and strong and enjoys working outdoors in any weather condition. You will be up and down steep hills plus lifting up to 15kg.The work will be based on piece rate meaning the harder you work, the more money you get paid. You could be earning up to $400 per day.Ideal candidate will be reliable and have a great attitude and willingness to be part of a team.Please note you must have the right to work in NZIf you want to know more information please contact Kate on 0800 662511 or apply online and we will be in touch!",
    "listedSalary": "Up to $400 /day",
    "hardSkills": "Outdoor Labour Physical Fitness Site Preparation Spraying Techniques Tree Planting",
    "softSkills": "Adaptability Positive Attitude Reliability Teamwork Work Ethic",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Panel Beater Labourer",
    "listingDate": "Posted 2d ago",
    "company": "LB Collision Repair Group",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "LB Collision Repair Group Ltd is a busy collision repair shop located in Whangarei. We pride ourselves on our outstanding customer service and superior workmanship.We are currently seeking; Trade Qualified Panel Beater Labourer's with the following skills and attributes:Day to Day Duties:Structural repairsPanel Repair - Dent pull, fill, and paint prepMIG or spotweldingDismantling and reassembly workAbility to multitask, prioritise, problem-solve, and manage time efficiently.Car O Liner trained experience preferred.About You:A Trade qualification or equivalent certificate and/orAt least 3 years of motor vehicle repair experienceHonest, reliable and positive attitudeA strong team player who can communicate effectively and support others.Passionate about producing high-quality work.What We Offer:Ongoing training based on experience, including ICAR certification.Competitive remuneration, ranging from $32 - $45 per hour depending on your experience and competency.Additional benefits including Southern Cross Medical Insurance (Wellbeing Level 1) and a Mobile Phone Plan. (After 3 Months)Required hours of work will be 42.5 hours per week. 7.00 am to 4.00 pm Monday to Friday, with additional hours during busy times.Requirements:Must have NZ residency or a valid NZ work visa.Immigration requirements will be fully met by the employer.If you are looking for a great opportunity to grow in your trade, we want to hear from you.Apply now and join our growing team!How to Apply: Please apply within, and submit your CV. We look forward to hearing from you soon!Application detailsApply online for this role or contact Carl Henty for more information.",
    "listedSalary": "Competitive remuneration, ranging from $32 - $45 per hour depending on your experience and competency",
    "hardSkills": "Spot Welding Structural Repairs MIG Welding Dismantling and reassembly Panel Repair",
    "softSkills": "Communication Time Management Teamwork Reliability Problem-solving",
    "RoleLevel": "Associate"
  },
  {
    "title": "Experience Process Work/Machine Operator",
    "listingDate": "Posted 1d ago",
    "company": "Extrastaff",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "We are looking for experienced Process Workers/Machine Operators to join our business, Extrastaff Limited. Our growing business requires an organised and trustworthy individual who pride yourself on quality workmanship. You will be motivated and result driven.You might be asked to work across the country to assist our projects, so flexibility on work locations is preferred.The Process Work/Machine Operator is responsible for:Operation of aluminium extrusion, processing and manufacturing machinery and equipmentWarehousing and stock controlOrder picking, packing and processingPacking and despatch of raw, semi and finished goods.Powder coating, surface finishing, anodising, and/ or fabrication and assembly of parts.Operation, monitoring and general maintenance of powder coating and chemical treatment plantsOperation of general aluminium processing equipment such and CNCs, Thermal Breaking lines punch presses and saws etc.Onsite installation of aluminuim structures and claddingGeneral cleaning and maintenance of workplace to maintain standardsSkills and experience required:Preferably minimum of 1 year relevant experience or qualification equivalent to NZQF level 2 or 3. However, we accept any candidates who have minimal industrial experience and are willing to learn.Friendly, with good time management, excellent work ethic are essentialTime management skillsA commitment to learning and developing your skills within the industrySound knowledge of H and S proceduresReliable and hardworkingPay ConditionsMin $27.76 per hour to a maximum of $30 per hourHours of workMinimum 30 hours of work is guaranteedLocationYou may be required to work in multiple locations throughout New Zealand including Auckland, Northland, Waikato, Bay of Plenty, Hawkes Bay, Taranaki, Gisborne, Whanganui-Manawatu, Wellington, Marlborough, Nelson-Tasman, Canterbury, West Coast, Otago and Southland.This role will be permanent and full-time jobIf this sounds like you, please send your resume and brief covering letter outlining your experience and skills.Only short-listed candidates will be contacted.",
    "listedSalary": "$27 .76 - $30 /hr",
    "hardSkills": "Basic Maintenance Health & Safety Procedures Machine Operation Powder Coating Warehousing",
    "softSkills": "Flexibility Reliability Teamwork Time Management Work Ethic",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Retail Assistant - Replenishment",
    "listingDate": "Posted 2d ago",
    "company": "Woolworths New Zealand",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Roster option 1Monday Tuesday 9:30 PM 7:00 AMTuesday Wednesday 9:30 PM 7:00 AMWednesday Thursday 9:30 PM 7:00 AMSunday Monday 9:30 PM 7:00 AMRoster option 2Wednesday Thursday 9:30 PM 7:00 AMThursday Friday 9:30 PM 7:00 AMFriday Saturday 9:30 PM 7:00 AMSaturday Sunday 9:30 PM 7:00 AMProvide excellent customer service to enhance the overall shopping experience.Support daily store operations by assisting customer needs.Maintain strong store presentation to achieve high customer satisfaction.Working with Woolworths Supermarkets New Zealand | Te Mahi ki Woolworths Supermarkets New ZealandWith over 185 stores and 20,000 team members across Aotearoa, we've made it our mission to make Kiwi lives a little better every day. We're friendly, down-to-earth, and energetic - we work hard but we have a great time doing it, and we love what we do. There is plenty of scope for new ideas, lots of room for you to add value, and importantly, you'll be working with a business that touches the lives of three million New Zealanders a week.We embrace diversity of thought and love to take on challenges with a pragmatic and innovative approach. Our culture thrives on mutual respect, care, curiosity, openness, and a proactive attitude. We continually seek ways to pair, collaborate, support, and learn from each other as a team!What you'll do | Hei mahiChampion Customer Service & Engagement: Be highly visible, engage customers with personalized assistance, and promptly resolve inquiries and complaints.Drive Product Availability & Quality: Continuously replenish products, focusing on essentials and fresh food, and ensure high standards for stock quality, rotation, and presentation.Support Smooth Operations & Standards: Collaborate effectively with the team (\"Swarm\") for daily operations, maintaining store cleanliness and organization.Prioritize Safety & Compliance: Uphold safety protocols, report hazards, and ensure all tasks adhere to company policies and legal requirements.What you’ll bring | Hei kohaCustomer-Centric Focus: You provide outstanding customer service, consistently focused on maximizing loyalty through personalized support.Strong Interpersonal Skills: You possess strong communication and interpersonal skills, enabling effective interactions.Integrity & Professionalism: You demonstrate a clear commitment to company values and integrity, consistently upholding professional standards and policies.Detail-Oriented & Proactive: You are detail-oriented, ensuring accuracy in your work and proactively escalating issues to management when necessary.What you'll experience | Ngā HuangaTeam discounts across our range of Woolworths Group brands you know and love and a robust rewards program that celebrates and incentivises purpose-driven work.Access to Sonder. Sonder provides free confidential 24/7 personalised financial, medical safety, psychological or physical support for team members and their families.A global business with endless career possibilities around every corner and across every discipline – with valuable exposure to a vast and exciting business network.Endless possibilities with Woolworths Group | Ko Woolworths TātouWe're a proud part of the Woolworths Group – 200,000+ bright minds, passionate hearts and unique perspectives working together connected by a shared Purpose – to create better experiences together for a better tomorrow. Here you’ll be supported and empowered to explore new ideas, make brave commitments and innovate better ways to meet the food and everyday needs of more than 24 million customers every week. Backed by a culture of genuine care, a flexible approach to work and the support to grow your career and make a meaningful impact, the possibilities for what we can achieve together are endless. Everyone belongs Woolworths Group | No Woolworths tātouWe believe that diversity, equity, inclusion and belonging are key to realising our purpose of better together for a better tomorrow. We recognise the value our team’s diversity brings to our business, our customers and our communities, and that teams with diverse experiences and backgrounds enrich our group and are better able to innovate and solve problems. As one of the largest employers in Australia and New Zealand, we aim to create a truly inclusive workplace where everyone feels that they belong, can be their best self and reach their full potential. We encourage all candidates to apply, please let us know in your application if we can support you with any adjustments in the hiring process.",
    "listedSalary": "What you'll experience | Ngā HuangaTeam discounts across our range of Woolworths Group brands you know and love and a robust rewards program that celebrates and incentivises purpose-driven work",
    "hardSkills": "Stock Replenishment Safety Compliance Customer Service Product Rotation Store Presentation",
    "softSkills": "Teamwork Communication Attention to Detail Integrity Proactive",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "HVAC Installer",
    "listingDate": "Posted Today",
    "company": "Integrated Electrical & Solar",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "DescriptionLead HVAC Installer looking for a solid crew?We're a well-established electrical and solar company looking for someone keen to lead our HVAC projects. If you've got commercial or residential experience with VRV and ducted systems and want to work with a good team, this could be a fit.What we're after:*Able to lead a high-performing team*Growth oriented and customer-focused*HVAC Installer or Registered Electrician with solid HVAC install experience*Commercial work background (schools, mid-size commercial - not massive plant room stuff)*VRV and ducted system experience*Refrigeration ticket is a bonus but not requiredWhat we've got:*A tight crew that's been together for years - everyone actually backs each other up*Owners engaged and working with the team*Variety of work across electrical, solar, and HVAC*Solid customer base and reputation*Company vehicle*Competitive rates based on what you bringIf you're into joining a company where there's no big egos and everybody mucks in to help each other out, this could work. We're quietly growing, the team's good, the work's steady, and if you're the right person there's real opportunity to progress and make this role your own.Full-time permanent positionIf you're keen, send through your CV or give us a call to have a chat.",
    "listedSalary": "What we're after:*Able to lead a high-performing team*Growth oriented and customer-focused*HVAC Installer or Registered Electrician with solid HVAC install experience*Commercial work background (schools, mid-size commercial - not massive plant room stuff)*VRV and ducted system experience*Refrigeration ticket is a bonus but not requiredWhat we've got:*A tight crew that's been together for years - everyone actually backs each other up*Owners engaged and working with the team*Variety of work across electrical, solar, and HVAC*Solid customer base and reputation*Company vehicle*Competitive rates based on what you bringIf you're into joining a company where there's no big egos and everybody mucks in to help each other out, this could work",
    "hardSkills": "Commercial HVAC Ducted Systems HVAC Installation Team Leadership VRV Systems",
    "softSkills": "Teamwork Reliability Customer Focus Growth Oriented Leadership",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Retail Assistant - Replenishment",
    "listingDate": "Posted 3d ago",
    "company": "Woolworths New Zealand",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "• Provide excellent customer service to enhance the overall shopping experience. • Support daily store operations by assisting customer needs. • Maintain strong store presentation to achieve high customer satisfaction.Working with Woolworths Supermarkets New Zealand | Te Mahi ki Woolworths Supermarkets New ZealandWith over 185 stores and 20,000 team members across Aotearoa, we've made it our mission to make Kiwi lives a little better every day.What you'll do | Hei mahi • Champion Customer Service & Engagement: Be highly visible, engage customers with personalized assistance, and promptly resolve inquiries and complaints. • Drive Product Availability & Quality: Continuously replenish products, focusing on essentials and fresh food, and ensure high standards for stock quality, rotation, and presentation. • Support Smooth Operations & Standards: Collaborate effectively with the team (\"Swarm\") for daily operations, maintaining store cleanliness and organization. • Prioritize Safety & Compliance: Uphold safety protocols, report hazards, and ensure all tasks adhere to company policies and legal requirements.What you’ll bring | Hei koha • Customer-Centric Focus: You provide outstanding customer service, consistently focused on maximizing loyalty through personalized support. • Strong Interpersonal Skills: You possess strong communication and interpersonal skills, enabling effective interactions. • Integrity & Professionalism: You demonstrate a clear commitment to company values and integrity, consistently upholding professional standards and policies. • Detail-Oriented & Proactive: You are detail-oriented, ensuring accuracy in your work and proactively escalating issues to management when necessary.What you'll experience | Ngā Huanga • Team discounts across our range of Woolworths Group brands you know and love and a robust rewards program that celebrates and incentivises purpose-driven work. • Access to Sonder. Sonder provides free confidential 24/7 personalised financial, medical safety, psychological or physical support for team members and their families. • A global business with endless career possibilities around every corner and across every discipline – with valuable exposure to a vast and exciting business network.Endless possibilities with Woolworths Group | Ko Woolworths TātouWe're a proud part of the Woolworths Group – 200,000+ bright minds, passionate hearts and unique perspectives working together connected by a shared Purpose – to create better experiences together for a better tomorrow.Here you’ll be supported and empowered to explore new ideas, make brave commitments and innovate better ways to meet the food and everyday needs of more than 24 million customers every week. Backed by a culture of genuine care, a flexible approach to work and the support to grow your career and make a meaningful impact, the possibilities for what we can achieve together are endless.Everyone belongs Woolworths Group | No Woolworths tātouWe believe that diversity, equity, inclusion and belonging are key to realising our purpose of better together for a better tomorrow. We recognise the value our team’s diversity brings to our business, our customers and our communities, and that teams with diverse experiences and backgrounds enrich our group and are better able to innovate and solve problems. As one of the largest employers in Australia and New Zealand, we aim to create a truly inclusive workplace where everyone feels that they belong, can be their best self and reach their full potential.We encourage all candidates to apply, please let us know in your application if we can support you with any adjustments in the hiring process.Discover more opportunities with Woolworths Group",
    "listedSalary": "What you'll experience | Ngā Huanga • Team discounts across our range of Woolworths Group brands you know and love and a robust rewards program that celebrates and incentivises purpose-driven work",
    "hardSkills": "Safety Compliance Stock Replenishment Customer Service Product Rotation Store Presentation",
    "softSkills": "Communication Teamwork Attention to Detail Integrity Proactive",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "COF Inspector - Whangarei COF's",
    "listingDate": "Posted 5d ago",
    "company": "Whangarei COF's $45-50 per hour",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Are you a certified COF Inspector looking to make a difference in your community? We are a privately owned and operated COF inspection facility. We are looking for a COF inspector to join our progressive team as our client base increases. At Whangarei COF’s, we’re committed to keeping Northland’s roads safe and reliable. Your ResponsibilitiesConduct thorough inspections of heavy vehicles in accordance with NZTA regulationsIssue Certificates of Fitness (COF B ) (COF A) for compliant vehiclesIdentify faults and provide clear guidance on required repairsMaintain accurate records and uphold inspection standardsDeliver friendly, professional service to our valued customersWhat You’ll NeedMUST BE LIVING IN NEW ZEALANDNZTA-approved COF Inspector certification COF B (COF A would be an advantage)Full licence with Class 5 endorsementExperience in vehicle inspection or automotive servicingStrong understanding of NZ transport safety standardsExcellent communication and customer service skillsA proactive attitude and commitment to road safetyWhy Join UsVERY Competitive salary and benefitsLocally owned and operated with a strong reputationSupportive team environment with modern purpose-built facilitiesOpportunities for ongoing training and career growthFlexibility of a privately owned facilityMake a real impact in the Whangarei communityApply TodaySend your CV and cover letter to admin@alltruck.co.nz.https://www.whangareicof.co.nz/Need more information - Please phone Gary 021 226 1443Let’s keep Whangarei moving—safely and confidently.",
    "listedSalary": "$45 - $50 /hr",
    "hardSkills": "Record Keeping COF Inspection Full Licence Class 5 NZTA Regulations Vehicle Inspection",
    "softSkills": "Customer Service Communication Teamwork Attention to Detail Proactive Attitude",
    "RoleLevel": "Associate"
  },
  {
    "title": "Police Officer",
    "listingDate": "Posted Today",
    "company": "New Zealand Police",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Working at Police (who we are) New Zealand Police delivers services that ensure people can be safe and feel safe in their homes, on our roads and in their communities. Police operate 24 hours a day in a complex environment actively targeting and preventing crime and harm. With around 16,000 staff, we work from urban and rural stations and larger policing hubs.We operate on land, sea and in the air, and respond to more than 1.2 million events per year – answering more than 992,000 111 calls and over 650,000 non-emergency calls. We’re working towards specific goals and targets that highlight our intent to work collaboratively with iwi and communities, other government sectors and business partners to deliver ‘Our Business’ and achieve long-term changeValues: Our Values provide a guide to the way New Zealand Police work, operate, and make decisions, and reflect what is important to us and the communities we serve. Professionalism: Taking pride in representing New Zealand Police and making a difference in the communities we serveRespect: Treating everyone with dignity, upholding their individual rights and honouring their freedomsIntegrity: Being honest and upholding excellent ethical standards Commitment to Māori and The Treaty: Acting in good faith of, and respecting the principles of Te Tiriti O Waitangi – partnership, protection, and participationEmpathy: Seeking understanding of, and considering the experience and perspective of those New Zealand Police serve Valuing Diversity: Recognising the value different perspectives and experiences bring to making us better at what we do Position Overview (where you’ll be working) The purpose of the District Operations is to deliver Our Business. To support the delivery of District outcomes the General Duties Constable will maintain and enhance public security and welfare through response to incidents requiring police attention and the conduct of relevant enquiries. The purpose of leadership in this role is to deliver (or enable others to deliver) Our Business. Responsibilities (what you’ll be doing) The Constable – General Duties will:1. Be safe and feel safe Understand the hazards in your work area and eliminate or minimise the associated risk.Report all accidents, incidents and near misses in MyPolice in a timely fashionActively participate in Wellness and Safety initiatives and training 2. Service delivery Patrolling Undertakes patrols and responds to situations to enforce law and/or maintain public order by the following: Undertaking patrolling in accordance with organisational requirements, principles of non-discrimination and supervisors instructions in a manner that optimises achievement of the patrols goals. Correctly assessing emergent situations and taking appropriate action Establishing, maintaining and utilising knowledge of the local patrol area Responding to incidents, taskings and requests for assistance in accordance with accepted operational procedures Utilising situational problem-solving techniques to resolve issues Assessing situational behaviour of people and determining/implementing appropriate reaction/response strategies Providing first response control/command and/or co-ordination at incidents Conduct Initial Police Investigation Assesses and preserves crime/incident scenes, and assists in the investigation process when required Collects and analyses information relevant to investigations Identifies, seizes, processes and manages exhibits in accordance with legislative and administrative processes Considers and utilises all organisational avenues of inquiry and investigative procedures in order to identify subjects and persons Conducts searches of persons, property and vehicles with due regard to lawful authority and organisational procedures. Decisions to caution, report or arrest are made at the discretion of the officer and conveyed to the person(s) concerned in accordance with organisational and legal guidelines. Affords rights to suspects and victims of crime by treating them in a fair, equitable and non-discriminatory manner.Gathers, Collates and Records Information Collects and records information relevant to police issues in accordance with jurisdictional laws, policy and procedures Takes comprehensive statements that contain all details relevant to the matter being examined and are in accordance with jurisdictional laws, policy and procedures Completes the full range of complaint correspondence in a concise and timely manner Completes arrest files, not guilty prosecution files, and other correspondence including notifying of complainants, witnesses and dealing with exhibits Conducts and records interviews in accordance with jurisdictional laws, policy and procedures Carries out access, storage and retrieval of information in accordance with jurisdictional laws and organisational Codes of Ethics/Best Practice. Uses interview and evidence recording equipment in accordance with jurisdictional laws, policy and proceduresIdentifies and utilises communication linkages within the organisation to exchange/share informationProcesses and provides for persons in police care or custody Ensures persons in care or custody are provided for, processed and escorted/transported in accordance with jurisdictional laws, policy and procedures Fosters a positive organisational image in the community Acts on opportunities to explain and promote the organisations activities in order to encourage community recognition and support Represents the organisations position on particular issues in a way which acknowledges community concerns and promotes community awareness Advises and involves the community in public safety activities Contributes to the objectives of the Safety Administration Programme S(A)P and the National Road Safety Plan Provides an initial police response to traffic crash events and emergencies Assists in reducing the number of road deaths and enhances the safe and efficient use of roads through: Patrol duties directed at compliance of general traffic law and the promotion of safe driving practices Targeting of alcohol / drug impaired road users Speed control enforcement Promoting and enforcing the use of vehicle restraint devices Providing peak traffic flow supervision Enforcing vehicle maintenance regulations through vehicle checks Issuing Traffic and Infringement Offence Notices Provides assistance/support for: Accident investigation officers Summons service CARD centre Judicial Processing Prepares and manages evidence, witnesses and offenders for the relevant judicial authority in accordance with jurisdictional laws and organisational policies and procedures by: Managing witnesses Monitoring offenders Liaising with and assisting prosecutions section Undertaking post-court procedures 3. Personal professional performance Effectively manages personal professional performance in order to ensure public confidence in the police service by: Modelling high standards of personal performance, ethics and integrity Reviewing and monitoring personal performance Developing and maintaining ongoing personal competence Assisting and supporting other personnel Maintaining personal physical and emotional health. 4. Team work Works effectively as a member of a team within the community Co-operates and works with other members of the section in order to achieve team goals Establishes and supports open honest and constructive relationships with colleagues Takes a constructive approach to team efforts and supports other team members where possible Customer service Ensures all service requests and complaints are met with a professional, customer focused and timely response. Assesses the changing needs of the customer and implements strategies to respond to them. Ensures services are delivered promptly, impartially and safely. Ensures that Policing services are delivered with a quality customer service and Māori Responsiveness focus. Fosters an atmosphere where being responsive to customer needs is a priority. Provides services designed to target general public attitudinal and behavioural change for the purposes of producing safer communities. Provides high quality policing services in conjunction with other members of the team. Ensures that service delivery conduct and performance integrate both Treaty principles and Māori values and principles consistent with the spirit and substance of the Treaty of Waitangi. 6. Relationship management Creates and maintains networks to ensure local examples of best practice are identified and communicated so that duplication of effort is avoided. Establishes and maintains a positive working relationship with other members of police including members of Dog Section, the Criminal Intelligence Branch, Scene of Crime Officers, Police Photographers, Training Service Centre staff and Prosecutions Service Centre staff. Establishes and maintains a positive working relationship with members of the community and other Government and service agencies such as CYPS, WINZ, Victim Support organisations, cultural groups, local government, churches, schools, neighbourhood watch, and community service groups such as Lions, Rotary and Zonta. 7. Universal Responsibilities All employees of New Zealand Police are expected to: Adhere to New Zealand Police standards of integrity and conduct. Comply with legislative and statutory requirements within area of expertise, including employment and privacylegislation. Model the New Zealand Police Values – Professionalism, Respect, Integrity, Commitment to Māori and The Treaty, Empathy and Valuing Diversity. Respect diversity and demonstrate inclusiveness. Understand the hazards in their work area and eliminate or minimise the associated risk. Report all accidents, incidents and near misses in MyPolice in a timely fashion. Actively participate in Wellness and Safety initiatives and training. Perform other duties and participate in projects as required. Additional information: (what you need to know) Required Qualifications For selection purposes, candidate suitability will be considered in relation to: potential to perform well in the position, given a reasonable period of time for familiarisation and/or training. personal attributes and temperament relevant to the position. general health which will allow for the performance of all duties and functions of the position (for constabulary employees a current PCT is an indicator of general health). Pre-Employment Checks Core children’s worker, safety check required. Drug and alcohol testing, as required, according to guidelines.",
    "listedSalary": null,
    "hardSkills": "Customer Service Physically Fit Relationship Management",
    "softSkills": "Coordination Communication Professionalism",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Court Appointed Communication Assistant",
    "listingDate": "Posted 4d ago",
    "company": "Moretalk",
    "location": "Whangārei",
    "employmentType": "Part Time",
    "description": "Are you a Speech Language Therapist with 4+ years of New Zealand based SLT experience, or fully trained Intermediary / Communication Assistance with experience in Australia, NZ or the UK? Are you passionate about advancing communication equity? Do you thrive in environments where you can use your expertise to empower individuals and build capacity across the justice and social sectors?Moretalk is seeking a dynamic Communication Assistant (CA) / Speech Language Therapist to join our team in the Te Tai Tokerau Region based in Whangarei, with flexible arrangements including 0.6 FTE up to full-time, contracting or employment options, and the flexibility to work from home with some travel.As a Communication Assistant, you will:Conduct assessments of functional communication and provide real-time support in legal and social sector contexts.Work with stakeholders to improve communication access and deliver both formal and informal training.Create accessible, plain language resources and support service improvements that foster equity and inclusion.Contribute to research and development projects aimed at strengthening justice and social sectors.As a Moretalk team member, you will need:To uphold Te Tiriti o Waitangi principles through reflective, continuous learning and practice.Strong verbal and written communication skills.Expert knowledge of speech, language and communication needs including neurodiversity, cognitive impairments and an understanding of the impact of a trauma response on communication.Emotional resilience and values aligned with Moretalk’s: respect, collaboration and access.",
    "listedSalary": null,
    "hardSkills": "Resource Development Training Delivery Functional Communication Assessment Research and Development Speech Language Therapy",
    "softSkills": "Collaboration Communication Skills Continuous Learning Emotional Resilience Respect",
    "RoleLevel": "Senior"
  },
  {
    "title": "Police Officer",
    "listingDate": "Posted Today",
    "company": "New Zealand Police",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Working at Police (who we are) New Zealand Police delivers services that ensure people can be safe and feel safe in their homes, on our roads and in their communities. Police operate 24 hours a day in a complex environment actively targeting and preventing crime and harm. With around 16,000 staff, we work from urban and rural stations and larger policing hubs.We operate on land, sea and in the air, and respond to more than 1.2 million events per year – answering more than 992,000 111 calls and over 650,000 non-emergency calls. We’re working towards specific goals and targets that highlight our intent to work collaboratively with iwi and communities, other government sectors and business partners to deliver ‘Our Business’ and achieve long-term changeValues: Our Values provide a guide to the way New Zealand Police work, operate, and make decisions, and reflect what is important to us and the communities we serve. Professionalism: Taking pride in representing New Zealand Police and making a difference in the communities we serveRespect: Treating everyone with dignity, upholding their individual rights and honouring their freedomsIntegrity: Being honest and upholding excellent ethical standards Commitment to Māori and The Treaty: Acting in good faith of, and respecting the principles of Te Tiriti O Waitangi – partnership, protection, and participationEmpathy: Seeking understanding of, and considering the experience and perspective of those New Zealand Police serve Valuing Diversity: Recognising the value different perspectives and experiences bring to making us better at what we do Position Overview (where you’ll be working) The purpose of the District Operations is to deliver Our Business. To support the delivery of District outcomes the General Duties Constable will maintain and enhance public security and welfare through response to incidents requiring police attention and the conduct of relevant enquiries. The purpose of leadership in this role is to deliver (or enable others to deliver) Our Business. Responsibilities (what you’ll be doing) The Constable – General Duties will:1. Be safe and feel safe Understand the hazards in your work area and eliminate or minimise the associated risk.Report all accidents, incidents and near misses in MyPolice in a timely fashionActively participate in Wellness and Safety initiatives and training 2. Service delivery Patrolling Undertakes patrols and responds to situations to enforce law and/or maintain public order by the following: Undertaking patrolling in accordance with organisational requirements, principles of non-discrimination and supervisors instructions in a manner that optimises achievement of the patrols goals. Correctly assessing emergent situations and taking appropriate action Establishing, maintaining and utilising knowledge of the local patrol area Responding to incidents, taskings and requests for assistance in accordance with accepted operational procedures Utilising situational problem-solving techniques to resolve issues Assessing situational behaviour of people and determining/implementing appropriate reaction/response strategies Providing first response control/command and/or co-ordination at incidents Conduct Initial Police Investigation Assesses and preserves crime/incident scenes, and assists in the investigation process when required Collects and analyses information relevant to investigations Identifies, seizes, processes and manages exhibits in accordance with legislative and administrative processes Considers and utilises all organisational avenues of inquiry and investigative procedures in order to identify subjects and persons Conducts searches of persons, property and vehicles with due regard to lawful authority and organisational procedures. Decisions to caution, report or arrest are made at the discretion of the officer and conveyed to the person(s) concerned in accordance with organisational and legal guidelines. Affords rights to suspects and victims of crime by treating them in a fair, equitable and non-discriminatory manner.Gathers, Collates and Records Information Collects and records information relevant to police issues in accordance with jurisdictional laws, policy and procedures Takes comprehensive statements that contain all details relevant to the matter being examined and are in accordance with jurisdictional laws, policy and procedures Completes the full range of complaint correspondence in a concise and timely manner Completes arrest files, not guilty prosecution files, and other correspondence including notifying of complainants, witnesses and dealing with exhibits Conducts and records interviews in accordance with jurisdictional laws, policy and procedures Carries out access, storage and retrieval of information in accordance with jurisdictional laws and organisational Codes of Ethics/Best Practice. Uses interview and evidence recording equipment in accordance with jurisdictional laws, policy and proceduresIdentifies and utilises communication linkages within the organisation to exchange/share informationProcesses and provides for persons in police care or custody Ensures persons in care or custody are provided for, processed and escorted/transported in accordance with jurisdictional laws, policy and procedures Fosters a positive organisational image in the community Acts on opportunities to explain and promote the organisations activities in order to encourage community recognition and support Represents the organisations position on particular issues in a way which acknowledges community concerns and promotes community awareness Advises and involves the community in public safety activities Contributes to the objectives of the Safety Administration Programme S(A)P and the National Road Safety Plan Provides an initial police response to traffic crash events and emergencies Assists in reducing the number of road deaths and enhances the safe and efficient use of roads through: Patrol duties directed at compliance of general traffic law and the promotion of safe driving practices Targeting of alcohol / drug impaired road users Speed control enforcement Promoting and enforcing the use of vehicle restraint devices Providing peak traffic flow supervision Enforcing vehicle maintenance regulations through vehicle checks Issuing Traffic and Infringement Offence Notices Provides assistance/support for: Accident investigation officers Summons service CARD centre Judicial Processing Prepares and manages evidence, witnesses and offenders for the relevant judicial authority in accordance with jurisdictional laws and organisational policies and procedures by: Managing witnesses Monitoring offenders Liaising with and assisting prosecutions section Undertaking post-court procedures 3. Personal professional performance Effectively manages personal professional performance in order to ensure public confidence in the police service by: Modelling high standards of personal performance, ethics and integrity Reviewing and monitoring personal performance Developing and maintaining ongoing personal competence Assisting and supporting other personnel Maintaining personal physical and emotional health. 4. Team work Works effectively as a member of a team within the community Co-operates and works with other members of the section in order to achieve team goals Establishes and supports open honest and constructive relationships with colleagues Takes a constructive approach to team efforts and supports other team members where possible Customer service Ensures all service requests and complaints are met with a professional, customer focused and timely response. Assesses the changing needs of the customer and implements strategies to respond to them. Ensures services are delivered promptly, impartially and safely. Ensures that Policing services are delivered with a quality customer service and Māori Responsiveness focus. Fosters an atmosphere where being responsive to customer needs is a priority. Provides services designed to target general public attitudinal and behavioural change for the purposes of producing safer communities. Provides high quality policing services in conjunction with other members of the team. Ensures that service delivery conduct and performance integrate both Treaty principles and Māori values and principles consistent with the spirit and substance of the Treaty of Waitangi. 6. Relationship management Creates and maintains networks to ensure local examples of best practice are identified and communicated so that duplication of effort is avoided. Establishes and maintains a positive working relationship with other members of police including members of Dog Section, the Criminal Intelligence Branch, Scene of Crime Officers, Police Photographers, Training Service Centre staff and Prosecutions Service Centre staff. Establishes and maintains a positive working relationship with members of the community and other Government and service agencies such as CYPS, WINZ, Victim Support organisations, cultural groups, local government, churches, schools, neighbourhood watch, and community service groups such as Lions, Rotary and Zonta. 7. Universal Responsibilities All employees of New Zealand Police are expected to: Adhere to New Zealand Police standards of integrity and conduct. Comply with legislative and statutory requirements within area of expertise, including employment and privacylegislation. Model the New Zealand Police Values – Professionalism, Respect, Integrity, Commitment to Māori and The Treaty, Empathy and Valuing Diversity. Respect diversity and demonstrate inclusiveness. Understand the hazards in their work area and eliminate or minimise the associated risk. Report all accidents, incidents and near misses in MyPolice in a timely fashion. Actively participate in Wellness and Safety initiatives and training. Perform other duties and participate in projects as required. Additional information: (what you need to know) Required Qualifications For selection purposes, candidate suitability will be considered in relation to: potential to perform well in the position, given a reasonable period of time for familiarisation and/or training. personal attributes and temperament relevant to the position. general health which will allow for the performance of all duties and functions of the position (for constabulary employees a current PCT is an indicator of general health). Pre-Employment Checks Core children’s worker, safety check required. Drug and alcohol testing, as required, according to guidelines.",
    "listedSalary": null,
    "hardSkills": "Customer Service Physically Fit Relationship Management",
    "softSkills": "Coordination Communication Professionalism",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "ELECTRICIAN / PANEL WIREMAN – FULL TIME",
    "listingDate": "Posted 6d ago",
    "company": "JayCee Electrix Limited",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "ELECTRICIAN / PANEL WIREMAN – FULL TIMEAre you a driven, detail-focused Electrician with a few years of experience under your belt?JayCee Electrix is looking for a skilled and motivated Electrician/Panel Wireman to join our growing Whangārei-based team in a permanent full-time role. This is the perfect opportunity for someone who enjoys variety in their workday and is ready to grow their expertise especially in switchboard manufacturing and electrical design.ABOUT THE ROLEYou’ll be part of a small, high-performing team, working across a variety of electrical tasks, including:Switchboard manufacturing and panel buildingCommercial and industrial electrical servicesResidential and field service work Your days will be diverse balancing hands-on work while assisting the supervisor by keeping an eye on our current apprentices. There is also the opportunity to learn and develop skills in electrical design and CAD work, supported through mentorship and training. ABOUT YOU We’re looking for someone who takes pride in their work, shows strong initiative, and brings a positive, professional attitude to the team. To be successful in this role, you will have:A minimum of 3–4 years post-qualification experienceCurrent NZ Electrical Registration and Practising LicenceA relevant electrical qualification (e.g., National Certificate in Electrical Engineering Level 4 or equivalent)Strong understanding of concept designs and electrical drawingsGood working knowledge of NZ standards, regulations, and codes of practiceA “can-do” attitude, excellent attention to detail, and willingness to learnA full Class 1 NZ driver licence (manual preferred)NZ citizenship, residency, or an existing valid NZ work visaPreference will be given to applicants with switchboard manufacturing experience Please note: You must hold the right to work in New Zealand. We are not accepting applications from candidates who do not already hold a valid open work visa and the legal right to work in New Zealand. WHAT WE OFFER At JayCee Electrix, you’ll enjoy being part of a family-oriented, forward-thinking environment with genuine opportunities to grow your career. We offer:On-the-job training, mentoring, and professional developmentCompetitive pay + overtimeA supportive, collaborative team cultureThe chance to support apprentices and develop leadership skillsA rare opportunity to gain hands-on experience in electrical design and CAD work If this sounds like the opportunity you've been waiting for, we’d love to hear from you. Apply now or email info@jcelectrix.co.nz for more information. Applications close: 16 January 2026 Please note: We will review applications and CVs as they are received, and the position may close earlier if the right candidate is found.",
    "listedSalary": "We offer:On-the-job training, mentoring, and professional developmentCompetitive pay + overtimeA supportive, collaborative team cultureThe chance to support apprentices and develop leadership skillsA rare opportunity to gain hands-on experience in electrical design and CAD work If this sounds like the opportunity you've been waiting for, we’d love to hear from you",
    "hardSkills": "Electrical Design Electrical drawings Electrical regulations NZ Electrical Registration Switchboard manufacturing",
    "softSkills": "Teamwork Attention to detail Can-do attitude Initiative Willingness to learn",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Police Officer",
    "listingDate": "Posted Today",
    "company": "New Zealand Police",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Working at Police (who we are) New Zealand Police delivers services that ensure people can be safe and feel safe in their homes, on our roads and in their communities. Police operate 24 hours a day in a complex environment actively targeting and preventing crime and harm. With around 16,000 staff, we work from urban and rural stations and larger policing hubs.We operate on land, sea and in the air, and respond to more than 1.2 million events per year – answering more than 992,000 111 calls and over 650,000 non-emergency calls. We’re working towards specific goals and targets that highlight our intent to work collaboratively with iwi and communities, other government sectors and business partners to deliver ‘Our Business’ and achieve long-term changeValues: Our Values provide a guide to the way New Zealand Police work, operate, and make decisions, and reflect what is important to us and the communities we serve. Professionalism: Taking pride in representing New Zealand Police and making a difference in the communities we serveRespect: Treating everyone with dignity, upholding their individual rights and honouring their freedomsIntegrity: Being honest and upholding excellent ethical standards Commitment to Māori and The Treaty: Acting in good faith of, and respecting the principles of Te Tiriti O Waitangi – partnership, protection, and participationEmpathy: Seeking understanding of, and considering the experience and perspective of those New Zealand Police serve Valuing Diversity: Recognising the value different perspectives and experiences bring to making us better at what we do Position Overview (where you’ll be working) The purpose of the District Operations is to deliver Our Business. To support the delivery of District outcomes the General Duties Constable will maintain and enhance public security and welfare through response to incidents requiring police attention and the conduct of relevant enquiries. The purpose of leadership in this role is to deliver (or enable others to deliver) Our Business. Responsibilities (what you’ll be doing) The Constable – General Duties will:1. Be safe and feel safe Understand the hazards in your work area and eliminate or minimise the associated risk.Report all accidents, incidents and near misses in MyPolice in a timely fashionActively participate in Wellness and Safety initiatives and training 2. Service delivery Patrolling Undertakes patrols and responds to situations to enforce law and/or maintain public order by the following: Undertaking patrolling in accordance with organisational requirements, principles of non-discrimination and supervisors instructions in a manner that optimises achievement of the patrols goals. Correctly assessing emergent situations and taking appropriate action Establishing, maintaining and utilising knowledge of the local patrol area Responding to incidents, taskings and requests for assistance in accordance with accepted operational procedures Utilising situational problem-solving techniques to resolve issues Assessing situational behaviour of people and determining/implementing appropriate reaction/response strategies Providing first response control/command and/or co-ordination at incidents Conduct Initial Police Investigation Assesses and preserves crime/incident scenes, and assists in the investigation process when required Collects and analyses information relevant to investigations Identifies, seizes, processes and manages exhibits in accordance with legislative and administrative processes Considers and utilises all organisational avenues of inquiry and investigative procedures in order to identify subjects and persons Conducts searches of persons, property and vehicles with due regard to lawful authority and organisational procedures. Decisions to caution, report or arrest are made at the discretion of the officer and conveyed to the person(s) concerned in accordance with organisational and legal guidelines. Affords rights to suspects and victims of crime by treating them in a fair, equitable and non-discriminatory manner.Gathers, Collates and Records Information Collects and records information relevant to police issues in accordance with jurisdictional laws, policy and procedures Takes comprehensive statements that contain all details relevant to the matter being examined and are in accordance with jurisdictional laws, policy and procedures Completes the full range of complaint correspondence in a concise and timely manner Completes arrest files, not guilty prosecution files, and other correspondence including notifying of complainants, witnesses and dealing with exhibits Conducts and records interviews in accordance with jurisdictional laws, policy and procedures Carries out access, storage and retrieval of information in accordance with jurisdictional laws and organisational Codes of Ethics/Best Practice. Uses interview and evidence recording equipment in accordance with jurisdictional laws, policy and proceduresIdentifies and utilises communication linkages within the organisation to exchange/share informationProcesses and provides for persons in police care or custody Ensures persons in care or custody are provided for, processed and escorted/transported in accordance with jurisdictional laws, policy and procedures Fosters a positive organisational image in the community Acts on opportunities to explain and promote the organisations activities in order to encourage community recognition and support Represents the organisations position on particular issues in a way which acknowledges community concerns and promotes community awareness Advises and involves the community in public safety activities Contributes to the objectives of the Safety Administration Programme S(A)P and the National Road Safety Plan Provides an initial police response to traffic crash events and emergencies Assists in reducing the number of road deaths and enhances the safe and efficient use of roads through: Patrol duties directed at compliance of general traffic law and the promotion of safe driving practices Targeting of alcohol / drug impaired road users Speed control enforcement Promoting and enforcing the use of vehicle restraint devices Providing peak traffic flow supervision Enforcing vehicle maintenance regulations through vehicle checks Issuing Traffic and Infringement Offence Notices Provides assistance/support for: Accident investigation officers Summons service CARD centre Judicial Processing Prepares and manages evidence, witnesses and offenders for the relevant judicial authority in accordance with jurisdictional laws and organisational policies and procedures by: Managing witnesses Monitoring offenders Liaising with and assisting prosecutions section Undertaking post-court procedures 3. Personal professional performance Effectively manages personal professional performance in order to ensure public confidence in the police service by: Modelling high standards of personal performance, ethics and integrity Reviewing and monitoring personal performance Developing and maintaining ongoing personal competence Assisting and supporting other personnel Maintaining personal physical and emotional health. 4. Team work Works effectively as a member of a team within the community Co-operates and works with other members of the section in order to achieve team goals Establishes and supports open honest and constructive relationships with colleagues Takes a constructive approach to team efforts and supports other team members where possible Customer service Ensures all service requests and complaints are met with a professional, customer focused and timely response. Assesses the changing needs of the customer and implements strategies to respond to them. Ensures services are delivered promptly, impartially and safely. Ensures that Policing services are delivered with a quality customer service and Māori Responsiveness focus. Fosters an atmosphere where being responsive to customer needs is a priority. Provides services designed to target general public attitudinal and behavioural change for the purposes of producing safer communities. Provides high quality policing services in conjunction with other members of the team. Ensures that service delivery conduct and performance integrate both Treaty principles and Māori values and principles consistent with the spirit and substance of the Treaty of Waitangi. 6. Relationship management Creates and maintains networks to ensure local examples of best practice are identified and communicated so that duplication of effort is avoided. Establishes and maintains a positive working relationship with other members of police including members of Dog Section, the Criminal Intelligence Branch, Scene of Crime Officers, Police Photographers, Training Service Centre staff and Prosecutions Service Centre staff. Establishes and maintains a positive working relationship with members of the community and other Government and service agencies such as CYPS, WINZ, Victim Support organisations, cultural groups, local government, churches, schools, neighbourhood watch, and community service groups such as Lions, Rotary and Zonta. 7. Universal Responsibilities All employees of New Zealand Police are expected to: Adhere to New Zealand Police standards of integrity and conduct. Comply with legislative and statutory requirements within area of expertise, including employment and privacylegislation. Model the New Zealand Police Values – Professionalism, Respect, Integrity, Commitment to Māori and The Treaty, Empathy and Valuing Diversity. Respect diversity and demonstrate inclusiveness. Understand the hazards in their work area and eliminate or minimise the associated risk. Report all accidents, incidents and near misses in MyPolice in a timely fashion. Actively participate in Wellness and Safety initiatives and training. Perform other duties and participate in projects as required. Additional information: (what you need to know) Required Qualifications For selection purposes, candidate suitability will be considered in relation to: potential to perform well in the position, given a reasonable period of time for familiarisation and/or training. personal attributes and temperament relevant to the position. general health which will allow for the performance of all duties and functions of the position (for constabulary employees a current PCT is an indicator of general health). Pre-Employment Checks Core children’s worker, safety check required. Drug and alcohol testing, as required, according to guidelines.",
    "listedSalary": null,
    "hardSkills": "Customer Service Physically Fit Relationship Management",
    "softSkills": "Coordination Communication Professionalism",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Hairstylist Browns Bay",
    "listingDate": "Posted 2d ago",
    "company": "Vivo Hair Salon & Skin Clinic",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "We’re Hiring Stylists to Join Our Growing Vivo Browns Bay TeamBring a friend and start your next chapter together Vivo Browns Bay is looking for experienced stylists to join our talented team. If you are passionate about hair, thrive in a supportive environment, and want to earn more for your work, we would love to hear from you.Let’s Talk MoneyAt Vivo, you will be paid the greater of two options each week:A guaranteed hourly rateOr a generous percentage of your weekly salesWe offer one of the highest commission structures in the industry, reviewed weekly, plus 10 percent commission on all retail sales in salon and online. You will also get exclusive staff discounts on thousands of products through our extensive online store.About VivoVivo is the largest privately owned salon group in the southern hemisphere, with more than 80 salons across New Zealand.Our mission is simple: happy stylists make happy clients. That’s why we focus on creating a positive, supportive environment where you can grow, be valued, and love coming to work.Our values are: Grow it. Love it. Own it.What We OfferFree ongoing training and nationwide educationClear career growth opportunities including Creative, Education, and Leadership rolesRegional Managers in every area to support your successA fully staffed call centre that helps build and grow your clienteleA fun, positive salon culture where your contribution is valuedSupport from the largest network of hairstylists in NZ!What We’re Looking ForYou are confident in cutting and colouring, have strong communication skills, and know how to maintain and grow a client base. You will bring enthusiasm to the salon and enjoy being part of a team.To be considered, you will have:A New Zealand Certificate in Hairdressing Level 4At least 5 years of professional experience in cutting and colouringReady to Chat?There is so much more we can share about what it’s like to work with us. Click APPLY now and let’s have a coffee and talk about your future with Vivo.",
    "listedSalary": null,
    "hardSkills": "Client Management Hair Coloring Hair Cutting Hairdressing Certificate Salon Operations",
    "softSkills": "Adaptability Client Focus Communication Skills Enthusiasm Teamwork",
    "RoleLevel": "Senior"
  },
  {
    "title": "Class 5 truck driver",
    "listingDate": "Posted 3d ago",
    "company": "Marsden Metals Group Ltd",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "DescriptionThe truck is based in Ruakaka, but provides scrap pick ups across Northland and occasionally down to Auckland.*The hours are 8am to 4.30, however 7am starts are recommended when long distances are being travelled.*Overnight stays in Kerikeri when multiple loads are being collected and dropped off the the Company's Waipapa yard occur fortnightly.*Occasional Saturday work is required.We are looking for a driver who will *appreciate they well presented truck, *be the face of the company when dealing with out customers*Is able to work using online technology to undertake most aspects of the logistics process.*Is informed and conscious of health and safety requirements.*Has some general mechanical knowledge*Wants to extend their experience and abilities when dealing with complex loads.This role provides an interesting and every varying opportunity for the right driver to grow and develop.If this role interests you please call us on 0800 33 66 73We would love to hear from you. Start date could be as early as prior to Christmas with all Christmas arrangements being accepted.Marsden Metals Group Ltd was the 2024 Employer of the Year Company for NorthlandCome and join the best.",
    "listedSalary": "$30 - $35 /hr",
    "hardSkills": "Online Technology Logistics Management Class 5 License Health and Safety Mechanical Knowledge",
    "softSkills": "Communication Reliability Time Management Customer Service Adaptability",
    "RoleLevel": "Associate"
  },
  {
    "title": "Water Tank Cleaning and Maintenance coordinator",
    "listingDate": "Posted 1w ago",
    "company": "Duracrete Products Ltd",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Duracrete Products Ltd requires a reliable member of staff to coordinate and undertake cleaning and maintenance work for water storage products.The successful applicant must be competant with customer service skills including verbal conversations and troubleshooting for customers. Computer literacy skills are also a must.The applicant must also be;Practically minded *Reliable *Drug free *Hold a current class 1 drivers licenceCurrent confined space and first aid courses are preferred yet not essential.",
    "listedSalary": null,
    "hardSkills": "Troubleshooting Computer Literacy Class 1 Driver's Licence Customer Service Water Tank Maintenance",
    "softSkills": "Reliability Communication Practical Thinking",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Traffic Management Planner",
    "listingDate": "Posted 1w ago",
    "company": "T8 Group Limited",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Our current planning team is experiencing unprecedented demand, with projects growing rapidly across Northland. To maintain our high standards of safety and compliance, we’re expanding the team to share the workload and ensure every TMP is delivered on time and to the highest quality. This is your chance to step in and make an immediate impact while supporting a team that truly values collaboration and excellence.About the RoleAs a Traffic Management Planner at T8 Group, you’ll play a critical role in designing and delivering safe, compliant, and efficient Traffic Management Plans (TMPs) for a wide range of projects across Northland. You’ll work closely with project teams, clients, and Road Controlling Authorities to ensure every plan meets regulatory standards and prioritizes public and worker safety.This is a full-time, permanent position based in Whangarei, with opportunities to support projects throughout the region.What You’ll Be DoingPrepare and submit accurate, compliant TMPs using RapidPlan and other industry tools.Collaborate with internal teams and external stakeholders to ensure smooth project delivery.Conduct risk assessments and develop practical traffic control strategies.Maintain TMP documentation and approvals, ensuring plans remain current and effective.What We’re Looking ForProficiency in RapidPlan and Microsoft Office Suite.Strong knowledge of CoPTTM, NZGTTM, and HSWA requirements.Excellent communication skills and the ability to influence and collaborate.A proactive problem-solver with a commitment to safety and performance.TTM Risk Assessment & Design certification (Micro-Credentials) and relevant Unit Standards an advantage.Why Join T8 Group?Competitive salary and benefits package.Fuel discounts and other perks to keep you moving.Career development opportunities with training and progression pathways.A supportive, inclusive team culture where your ideas matter.Be part of a company that values safety, innovation, and community impact.",
    "listedSalary": "Why Join T8 Group?Competitive salary and benefits package",
    "hardSkills": "Risk Assessment Microsoft Office CoPTTM knowledge RapidPlan TMP preparation",
    "softSkills": "Communication Collaboration Proactivity Problem-solving Safety commitment",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Customer Support / Technical Helpdesk",
    "listingDate": "Posted 1w ago",
    "company": "Uber Group Ltd",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "We are UBER GROUP, purveyors of awesome broadband.Not the taxi company, and not Uber Eats either, although we do like eating the biscuits and cakes our customers bake for our team. We’re Whangarei-based, have been around since 2003 and we have our own network providing seriously good broadband.We’re a small but passionate team from very different backgrounds, obsessed with technical excellence and providing the very best customer support. We work hard, play hard and love what we do. Our culture is far from politically correct so you’ll need to be a special type of person to work here. But together we provide great service and have a lot of laughs on the way.We have a vacancy for someone to work with our customers’ existing computer equipment and wireless access points (routers) to ensure broadband connections and other IT related equipment in the home are live and working; and to carry out repairs.You’ll also work in our frontline team, providing technical and admin support for our broadband customers. You’ll proactively monitor the network and customer connections and provide first level technical responses, often reaching out to customers before they know they have a problem. You’ll answer queries, give advice and provide technical expertise to a whole raft of different people. While the main focus of the role is on support for existing customers, you’ll also answer new business enquiries.You’ll be available on a rotating roster to help cover evenings (till 6pm), weekends and public holidays (9 – 5). Remote escalation support will be available from senior team members after hours. The role is based in our Whangarei office (this is a must). Full initial training and extensive ongoing training will be provided.You must be keen and capable with technology to take on this role – preferably we’d like to see several years in a Helpdesk or similar job, but we’ll also be interested if you’re a younger applicant who’s always been the go-to person for family and friends whenever they have a problem with technology. We're looking for someone to start in the new year.Excellent NZ English, a clear, confident telephone voice, writing skills and a typing speed of at least 30 wpm are an absolute must, and familiarity with Northland geography will be a significant advantage. Accurate record-keeping and attention to detail are essential. And you MUST have New Zealand residency or a valid NZ work visa.If you’re not good with technology then this job is not for you so please don’t apply, but feel free to ask us about broadband and phone services. If you think you’re up for the job, then – you know what to do. Ask us for the job description so you know exactly what you’re in for. Special hint: accuracy is really important to us, so check your CV and covering letter for typos. Good luck!",
    "listedSalary": null,
    "hardSkills": "Record Keeping Router Configuration Broadband Networking Technical Support Typing Speed 30 wpm",
    "softSkills": "Teamwork Communication Customer Service Proactive Monitoring Attention to Detail",
    "RoleLevel": "Associate"
  },
  {
    "title": "Beauty Therapist Contractor - Kamoe",
    "listingDate": "Posted 1w ago",
    "company": "Vivo Hair Salon & Skin Clinic",
    "location": "Whangārei",
    "employmentType": "Full Time, Contract",
    "description": "Why Contract with Vivo?As a Contract Beauty Therapist, you’ll run your own business while enjoying all the benefits Vivo offers, including national marketing, trusted retail products, ongoing training and upskilling opportunities, and admin support from our in-house call centre. This is an ideal opportunity for confident, client focused advanced skin therapists ready to elevate their career on their terms. (within agreed salon/clinic availability)Walk into a fully equipped, established salon and bring your client base withyou! (not sure if this makes sense) I have tried to reword it.... Walk into a fully equipped beauty space within a vibrant, established salon and bring your client base with you! or Walk into a fully equipped, established clinic space and bring your client base with you!Business Growth SupportWeekly invoicing and simple tax setupClaim business expenses (e.g. tools, training, travel)Ongoing training and upskilling opportunitiesNational Marketing & Admin SupportA steady pipeline of new clientsBacked by our call centre team to handle bookings and adminAbout VivoWith 10 Skin Clinics and over 80 hair salons across New Zealand, Vivo is the largest privately owned salon group in the Southern Hemisphere. We are proud to support contract beauty therapists with growth, flexibility, and strong systems that set them up for success. At Vivo, we believe happy stylists lead to happy clients and we live by our values: Grow It. Love It. Own It.Ready to take the next step?If you’re ready to increase your earnings, work on your terms, and grow your beauty business inside one of NZ’s most trusted salon networks – we’d love to chat!",
    "listedSalary": null,
    "hardSkills": "Client Recordkeeping Facial Treatments Product Knowledge Skin Therapy Waxing Techniques",
    "softSkills": "Business Savvy Communication Skills Customer Service Self-Motivation Time Management",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Branch Manager",
    "listingDate": "Posted 5d ago",
    "company": "Glassons",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Are you a dynamic leader with a passion for fashion and retail management? Glassons is seeking a talented and experienced Branch Manager to join our team and lead our store to success! Position: Branch ManagerLocation: Glassons - WhangareiJob Type: Full-time (40-45 hours Tuesday to Saturday) About Glassons:Glassons is a leading fashion retailer offering the latest trends in women's clothing and accessories. With a vibrant and dynamic atmosphere, we pride ourselves on providing customers with exceptional service and on-trend fashion choices.Role Overview:As the Branch Manager, you will be responsible for leading and inspiring a team of retail professionals to deliver outstanding customer experiences and achieve sales targets. You will drive operational excellence, ensure customer service standards are maintained, and foster a positive work environment.Benefits:Competitive salary package and performance-based incentives.Staff discount on Glassons and Hallensteins products.Ongoing training and development opportunities.Career progression within a leading fashion retailer.Key Responsibilities:Lead, motivate, and develop a team of sales associates to deliver exceptional customer service.Drive sales and meet targets through effective rostering, coaching, and performance management.Implement and maintain visual merchandising standards to showcase our products effectively.Manage store operations including stock control, inventory management, and administrative tasks.Uphold Glassons brand values and standards at all times. Requirements:Proven experience in retail management, preferably within the fashion industry.Strong leadership and communication skills with the ability to inspire and motivate a team.Excellent customer service skills and a passion for delivering exceptional shopping experiences.Ability to drive sales and meet targets in a fast-paced retail environment.A proactive and results-driven approach with a keen eye for detail.Flexibility to work a rotating roster, including weekends and evenings. Join the Glassons team and become part of a dynamic and exciting work environment where your passion for fashion and leadership skills will be valued and rewarded! To apply, please submit your resume and cover letter outlining your relevant experience and why you would be the perfect fit for the role of Branch Manager at Glassons. We look forward to hearing from you!",
    "listedSalary": "Benefits:Competitive salary package and performance-based incentives",
    "hardSkills": "Customer Service Leadership Management Stock Handling",
    "softSkills": "Performance Bonus",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Retail Assistant - Replenishment",
    "listingDate": "Posted 1w ago",
    "company": "Woolworths New Zealand",
    "location": "Whangārei",
    "employmentType": "Part Time",
    "description": "Roster option 1Tuesday Tuesday 9:00 AM 3:00 PMWednesday Wednesday 9:00 AM 3:00 PMFriday Friday 9:00 AM 3:00 PMSunday Sunday 9:00 AM 3:00 PMRoster option 2Monday Monday 5:00 AM 2:30 PMTuesday Tuesday 10:00 AM 2:00 PMSunday Sunday 9:00 AM 6:00 PMRoster option 3Wednesday Wednesday 6:00 AM 3:00 PMThursday Thursday 11:00 AM 3:00 PMSaturday Saturday 9:00 AM 6:00 PMProvide excellent customer service to enhance the overall shopping experience.Support daily store operations by assisting customer needs.Maintain strong store presentation to achieve high customer satisfaction. Working with Woolworths Supermarkets New Zealand | Te Mahi ki Woolworths Supermarkets New ZealandWith over 185 stores and 20,000 team members across Aotearoa, we've made it our mission to make Kiwi lives a little better every day. We're friendly, down-to-earth, and energetic - we work hard but we have a great time doing it, and we love what we do. There is plenty of scope for new ideas, lots of room for you to add value, and importantly, you'll be working with a business that touches the lives of three million New Zealanders a week.We embrace diversity of thought and love to take on challenges with a pragmatic and innovative approach. Our culture thrives on mutual respect, care, curiosity, openness, and a proactive attitude. We continually seek ways to pair, collaborate, support, and learn from each other as a team!What you'll do | Hei mahiChampion Customer Service & Engagement: Be highly visible, engage customers with personalised assistance, and promptly resolve inquiries and complaints.Drive Product Availability & Quality: Continuously replenish products, focusing on essentials and fresh food, and ensure high standards for stock quality, rotation, and presentation.Support Smooth Operations & Standards: Collaborate effectively with the team (\"Swarm\") for daily operations, maintaining store cleanliness and organisation.Prioritise Safety & Compliance: Uphold safety protocols, report hazards, and ensure all tasks adhere to company policies and legal requirements. What you’ll bring | Hei kohaCustomer-Centric Focus: You provide outstanding customer service, consistently focused on maximising loyalty through personalised support.Strong Interpersonal Skills: You possess strong communication and interpersonal skills, enabling effective interactions.Integrity & Professionalism: You demonstrate a clear commitment to company values and integrity, consistently upholding professional standards and policies.Detail-Oriented & Proactive: You are detail-oriented, ensuring accuracy in your work and proactively escalating issues to management when necessary. What you'll experience | Ngā HuangaTeam discounts across our range of Woolworths Group brands you know and love and a robust rewards program that celebrates and incentivises purpose-driven work.Access to Sonder. Sonder provides free confidential 24/7 personalised financial, medical safety, psychological or physical support for team members and their families.A global business with endless career possibilities around every corner and across every discipline – with valuable exposure to a vast and exciting business network. Endless possibilities with Woolworths Group | Ko Woolworths TātouWe're a proud part of the Woolworths Group – 200,000+ bright minds, passionate hearts and unique perspectives working together connected by a shared Purpose – to create better experiences together for a better tomorrow.Here you’ll be supported and empowered to explore new ideas, make brave commitments and innovate better ways to meet the food and everyday needs of more than 24 million customers every week. Backed by a culture of genuine care, a flexible approach to work and the support to grow your career and make a meaningful impact, the possibilities for what we can achieve together are endless.Everyone belongs Woolworths Group | No Woolworths tātouWe believe that diversity, equity, inclusion and belonging are key to realising our purpose of better together for a better tomorrow. We recognise the value our team’s diversity brings to our business, our customers and our communities, and that teams with diverse experiences and backgrounds enrich our group and are better able to innovate and solve problems. As one of the largest employers in Australia and New Zealand, we aim to create a truly inclusive workplace where everyone feels that they belong, can be their best self and reach their full potential.We encourage all candidates to apply, please let us know in your application if we can support you with any adjustments in the hiring process. Discover more opportunities with Woolworths Group",
    "listedSalary": "What you'll experience | Ngā HuangaTeam discounts across our range of Woolworths Group brands you know and love and a robust rewards program that celebrates and incentivises purpose-driven work",
    "hardSkills": "Compliance Customer Service Merchandising Safety Protocols Stock Management",
    "softSkills": "Attention to Detail Communication Integrity Teamwork",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Solar Co-ordinator",
    "listingDate": "Posted 6d ago",
    "company": "Hubands Energy",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "We have a fantastic opportunity for the right person to join our busy team and become part of a company that is making a real difference in the field of energy efficiency. Hubands Energy are a locally owned and operated company passionate about Northland, and we have been operating for over 43 years.The opportunity:We are looking for a confident and friendly personality to fill the vital position of Solar Co-ordinator in our company. Experience in the solar or electrical field would be beneficial. Family values are at the forefront of our business, and we truly care about work/life balance, with this position being predominantly Monday to Friday, 8.00am – 5.00pm. As a business, we strive for superior customer service, and you will be responsible for managing the booking process of Solar & Battery storage systems, from the time of confirmation, right through to installation and invoicing of the final payment. The role:Maintain an excellent level of customer service at all timesManagement of all installation and repair bookings for solar & battery storage systems, including co-ordinating jobs for the solar team of installers, electricians and inspectorsCompleting all job and invoicing requirements associated with solar & battery storage systemsCompleting all necessary paperwork to Northpower and Top Energy, as well as the customers power company for all new solar installationsEnsuring delivery of import/export meter through metering companiesChecking all customers active solar installations and following up on any systems where error messages are receivedAny other duties in relation to solarAssisting with answering the main phone line when possibleGeneral administration duties as requiredWhat we offer:Excellent pay ratesGreat team cultureCompany phoneCompany uniformOngoing training, courses, and personal developmentAbout you:The ideal candidate will have:NZ Citizenship/NZ residency or a valid NZ work visaExperience in the solar or electrical field would be beneficialSuperb track record in customer service and administrationSuper friendly and easy-going, with a good sense of humourA quick learner with excellent attention to detailBe adaptable and able to work autonomously as no two days are the sameHubands Energy is a leader in our field and provides the best training and support for our people, so if you want to join a team that 'will' take your career further then apply now!",
    "listedSalary": "As a business, we strive for superior customer service, and you will be responsible for managing the booking process of Solar & Battery storage systems, from the time of confirmation, right through to installation and invoicing of the final payment",
    "hardSkills": "Invoicing Solar Systems Scheduling Administration Electrical Knowledge",
    "softSkills": "Communication Time Management Customer Service Adaptability Attention to Detail",
    "RoleLevel": "Associate"
  },
  {
    "title": "Automotive Parts Salesperson",
    "listingDate": "Posted 1w ago",
    "company": "Northland Parts Warehouse",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "About the RoleFull-time position (Monday–Friday, occasional Saturday if required)Selling used automotive parts in-store, online, and over the phoneHandling enquiries through online platform, Trade Me, Facebook, phone, and emailPreparing quotes, invoices, and processing salesWorking with dismantlers and warehouse staff to ensure correct parts are locatedAssisting with supervising daily operations when neededMaintaining a tidy and safe work environment What We’re Looking ForExperience in automotive sales, mechanics, wrecking yard, or panel beatingStrong knowledge of any Japanese cars, 4WD and utes,Good communication and customer service skillsReliable, honest, and able to work independently or as team.Good computer skillsSupervisory or team-leading experience is an advantage What We OfferCompetitive pay based on experienceSupportive team environmentLong-term stable role with opportunities to growStaff discounts on parts and servicesWork with a respected local business How to ApplyPlease email your CV to: parts@npw.co.nzOr contact us on: 021988264Apply now and join the Northland Parts Warehouse team!",
    "listedSalary": "$25 - $35 /hr",
    "hardSkills": "Computer Skills Invoicing Automotive Parts Sales Online Sales Platforms Quotation Preparation",
    "softSkills": "Reliability Teamwork Customer Service Communication Independent Work",
    "RoleLevel": "Associate"
  },
  {
    "title": "Support Worker",
    "listingDate": "Posted 1w ago",
    "company": "IDEA Services",
    "location": "Whangārei",
    "employmentType": "Part Time",
    "description": "Part time opportunities - rosters from 20-50 hours per fortnightMainly evening and weekend shifts available$23.84-$29.10 per hour depending on relevant qualifications Mō te tūnga | About the roleAs a Support Worker, you will empower individuals with intellectual disabilities to lead fulfilling lives at home and within their community. This role is deeply meaningful, allowing you to be creative and make each day engaging and significant for those you support. Your responsibilities include:Fostering independence: Assist individuals in developing daily living skills such as using public transport and preparing meals.Managing daily routines: Support with personal care tasks like showering, dressing and taking medication.Pursuing goals and interests: Encourage and help individuals to follow their passions and hobbies.Promoting health and well-being: Guide individuals in making healthy lifestyle choices and maintaining their overall well-being.Building strong connections: Strengthen their relationships with whānau and their community.Check out our website to learn more:Become a Support WorkerNgā pūmanawatanga ōu | What you will bringPrevious experience as a Support Worker is preferred, but more importantly, we are looking for someone with a positive attitude and compassion.Flexibility to work rostered shifts.A calm nature and confidence to work with challenging behaviours.Comfortable and proficient in using computers and tablets daily.Strong written and verbal communication skills.Physical fitness to provide necessary physical support.A Full NZ driver's license Nōu te rourou | What's in it for you?$23.84-$29.10 per hour depending on relevant qualifications, with the ability to earn more as you gain qualifications.IDEA Services will support you towards completion of the Level 2, 3 and 4 Certificates in Health and Wellbeing qualifications.Generous long service leave entitlements plus insurance benefits after 2 years' service.'Refer a friend' Bonus programme.FREE Employee Assistance programme service anytime you need health and wellbeing support. Mō mātou | About usIDEA Services supports adults with intellectual disabilities to live in their own homes and enjoy life as part of their communities. We are New Zealand's largest provider of services to people with intellectual disabilities and their families. Our services are founded on IHC's utter commitment for people with intellectual disabilities to have a good life and to be valued contributors to and members of their own community. IDEA Services Ltd is an accredited Immigration AEWV employer.The IHC Group is committed to Te Tiriti o Waitangi and actively seek a diverse applicant pool. We encourage candidates of all backgrounds to apply. We welcome all kinds of diversity and the different perspectives such diversity brings to our work.Me pēhea te tuku tono | How to ApplyThe first step is to submit an online application by selecting the 'Apply' button. As part of the application process you will be required to provide an up-to-date CV outlining your previous experience. We are unable to discuss your suitability for the role until we have received your application. If you have any questions about the application process or specific queries about the position, please use the contact details below to speak to recruitment.Applicants can direct enquiries about position to:Taylor Spence - Recruitment Advisortaylor.spence@ihc.org.nzPosition description IDEA JD- Support Worker (Oct 2020).pdf",
    "listedSalary": "$23 .84 - $29 .10/hr",
    "hardSkills": "Computer Proficiency Personal Care Physical Fitness Risk Management Safety Procedures",
    "softSkills": "Adaptability Communication Empathy Patience Problem-Solving",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Registered Teacher - Educare Okara",
    "listingDate": "Posted 2w ago",
    "company": "Educare",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Are you passionate about making a difference in the lives of tamariki? Then come join Our Team at Educare Okara.About Us - Mo Matou:Educare Okara is located at the end of a quiet street in the heart of Whangarei. This home away from home has beautiful open spaces which provide the perfect environment for our tamariki to learn, laugh, play while nurturing their own personal interests. From imaginative indoor play to exploring and connecting with the natural environment outdoors, our tamariki are encouraged to learn through curiosity and fun. We embrace the rich natural resources of Northland, making every day a chance for discovery and adventure.We have built strong relationships with local schools in Morningside and Otaika which create the foundation of our transition to school programmes to support our tamariki taking their next step in their journey.We strongly value whakawhanaungatanga in the community and with our whanau and are proud of our meaningful relationships between kaiako, tamariki and whanau.About the Role - Mo te Turanga:We’re looking for someone who is passionate about caring for and inspiring young tamariki. Your days will be filled with routines, storytelling and creativity.Full-Time role (40 hours) working between the centre opening hours of 7.30 am- 5.30 pm Monday to Friday on an 8 hour shift rosterPermanent rolePay rate is determined by experience and qualifications- Full Pay Parity scaleEDUCARE BENEFITS:Educare Pays Full Parity50% off Childcare for your children at an Educare centreOngoing access to professional developmentEmerging Leaders program to support leadership and growthWellbeing toolkit to support our KaiakoPayment support for Teacher Certification and First AidBranded shirts and jackets providedWhat You’ll Bring – Etahi Ahuatanga E Hiahia Ana MatouJust recently completed their degree or is awaiting their Practising Certificate OR a kaiako who brings some experience with themWants to work in a fun, collaborative, and supportive environment that nurtures your unique strengths and encourages professional growth.Has a genuine drive to provide high-quality care and education, helping our tamariki develop confidence, curiosity, and a love of learning.Is a strong advocate for tamariki, championing their voice, wellbeing, and learning every day.Can create a warm, inclusive, and engaging learning environment where every child feels valued and inspired.Values teamwork and strong professional relationships, actively contributing to a positive, respectful, and supportive workplace culture.Is eager to engage with families and the wider community, building meaningful connections that support each child’s growth and development.Holds a recognised Teaching ECE qualification and a current Practising Certificate that allows you to work as a Registered Teacher in a New Zealand ECE centreYou will be a strong advocate for our tamariki, who will be able uphold and support our commitment to the Treaty of Waitangi, Te Whariki, and the Educare vision of Learn, Laugh, Play.It's important to us that our new teachers have a love for respectful practices, a strong ECE knowledge and passion for extending the learning of our tamariki. Respectful relationships are at the core of what we do, so we need a teacher who can develop strong connections between tamariki, whanau and our existing kaiako.Join us - Tuhono maiApply today and start your journey with us, helping tamariki Learn, Laugh, and Play every single day.Click Apply Now! Please submit a CV and a cover letter explaining why you are interested in the role and joining Educare.",
    "listedSalary": "30 pm Monday to Friday on an 8 hour shift rosterPermanent rolePay rate is determined by experience and qualifications- Full Pay Parity scaleEDUCARE BENEFITS:Educare Pays Full Parity50% off Childcare for your children at an Educare centreOngoing access to professional developmentEmerging Leaders program to support leadership and growthWellbeing toolkit to support our KaiakoPayment support for Teacher Certification and First AidBranded shirts and jackets providedWhat You’ll Bring – Etahi Ahuatanga E Hiahia Ana MatouJust recently completed their degree or is awaiting their Practising Certificate OR a kaiako who brings some experience with themWants to work in a fun, collaborative, and supportive environment that nurtures your unique strengths and encourages professional growth",
    "hardSkills": "First Aid Child Development Knowledge Curriculum Planning ECE Teaching Qualification Practising Certificate",
    "softSkills": "Teamwork Creativity Communication Advocacy Relationship Building",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Civil Operator / Excavator",
    "listingDate": "Posted 1w ago",
    "company": "Extrastaff",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "We’re on the lookout for reliable, experienced civil operators to join our team. You’ll be working on a range of projects, operating machinery safely, supporting groundwork, and helping keep sites running smoothly.If you’ve got solid operating experience, a great attitude, and the right tickets — we want to hear from you!Apply now and join a team that values hard work and gets the job done.",
    "listedSalary": null,
    "hardSkills": "Equipment Handling Groundwork Machinery Operation Site Maintenance WTR Endorsements",
    "softSkills": "Teamwork Adaptability Positive Attitude Reliability Safety Focus",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Road Maintenance Worker",
    "listingDate": "Posted 1w ago",
    "company": "Ventia",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Looking for a fresh start in a stunning location? Whangarei offers lifestyle, community, and opportunity—and Ventia provides the stability and support to match.We’re hiring for multiple roles:Class 5 Truck & Trailer DriverMaintenance SupervisorGrader OperatorExcavator Operator What we offer:Long-term contract with a trusted employerSolid, supportive team cultureSouthern Cross Health Essentials planCareer growth in roading and construction What we’re looking for:Roading experience preferred (construction experience considered)Commitment to safety and qualityTeam players ready to make an impact Ready to join us? Apply online now! For inquiries, please email marie.sinajon@ventia.comDiversityVentia is enriched by the diverse experiences, talents and cultures that our people bring to the organisation, while celebrating and respecting the communities we operate in. We are committed to providing a safe and positive environment that provides equal opportunities for individuals of all backgrounds, including Māori and Pasifika people, LGBTTQIA+, Women, Veterans and spouses and people with disabilities. How to applyIf you are looking to expand your career with a business that rewards and values its employees, please apply below by clicking on the apply now button. Position Reference Number: 165575",
    "listedSalary": "How to applyIf you are looking to expand your career with a business that rewards and values its employees, please apply below by clicking on the apply now button",
    "hardSkills": "Basic Equipment Operation Civil/Roads Experience Driving Skills (Class 2 Driver’s Licence)",
    "softSkills": "Adaptability Safety Consciousness Teamwork",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "National Restraint Coordinator",
    "listingDate": "Posted 2w ago",
    "company": "IDEA Services",
    "location": "Whangārei",
    "employmentType": "Full Time, Fixed Term Contract",
    "description": "New Year, New Role! With recent internal growth, we now have an opportunity available.Full-time, fixed term for 12 months with the possibility of extension!This role can be based anywhere across NZMō te tūnga | About the roleThe role of the Restraint Coordinator is crucial in ensuring that IDEA Services adheres to both our internal Restraint Minimisation and Safe Practice Policy, as well as Part 6 of the Ngā Paerewa Health and Disability Services Standard NZS 8134:2021. Their contribution is essential in maintaining compliance with these guidelines and promoting a safe and responsible approach to the use of restraint within our organization.Ngā pūmanawatanga ōu | What you will bringRequirement: Registered CPI Safety Interventions Trainer or the potential to become certified as a CPI Safety Interventions trainerPossession of a valid full driver's licenseProficiency in leading team-based training for challenging teams and/or teams working with individuals with complex support needsAdequate understanding of Positive Behaviour Support, De-escalation Techniques, Trauma-Informed Practices, Sensory Modulation, and other strategies for minimizing the use of restraints.Ability to think creatively, problem solve, and constructively challenge existing normsAdvanced computer literacy, including proficiency in Microsoft Office and accurate management of administrative tasksPositive attitude and a strong commitment to continuous learning and upskilling while on the job Nōu te rourou | What's in it for you?Opportunity to work for an organization that makes a real difference in the local communityCollaborative and inclusive culture with a focus on employee well-beingSupportive and approachable management cultureCompetitive remuneration and employee benefits, including discounts with leading retailers/fitness centers, eyecare, and insurance benefitsOngoing learning and development opportunities Mō mātou | About us (IDEA Services)IDEA Services supports adults with intellectual disabilities to live in their own homes and enjoy life as part of their communities. We are New Zealand's largest provider of services to people with intellectual disabilities and their families.Our services are founded on IHC's utter commitment for people with intellectual disabilities to have a good life and to be valued contributors to and members of their own community.IDEA Services Ltd is an accredited Immigration AEWV employer and is New Zealand's largest provider of services to people with intellectual disabilities.Me pēhea te tuku tono | How to ApplySubmit an online application by selecting the 'Apply' button. As part of the recruitment selection process, you will be required to provide an up-to-date CV, and cover letter outlining your previous experience and motivation to apply for this role. If you have any questions about the application process, please email recruitment@ihc.org.nz.The IHC Group is committed to Te Tiriti o Waitangi and actively seek a diverse applicant pool. We encourage candidates of all backgrounds to apply. We welcome all kinds of diversity and the different perspectives such diversity brings to our work. Applicants must have the legal right to work in New Zealand.Applicants can direct enquiries about position to:Recruitment Teamrecruitment@ihc.org.nz",
    "listedSalary": "Ability to think creatively, problem solve, and constructively challenge existing normsAdvanced computer literacy, including proficiency in Microsoft Office and accurate management of administrative tasksPositive attitude and a strong commitment to continuous learning and upskilling while on the job Nōu te rourou | What's in it for you?Opportunity to work for an organization that makes a real difference in the local communityCollaborative and inclusive culture with a focus on employee well-beingSupportive and approachable management cultureCompetitive remuneration and employee benefits, including discounts with leading retailers/fitness centers, eyecare, and insurance benefitsOngoing learning and development opportunities Mō mātou | About us (IDEA Services)IDEA Services supports adults with intellectual disabilities to live in their own homes and enjoy life as part of their communities",
    "hardSkills": "CPI Safety Interventions Training De-escalation Techniques Microsoft Office Proficiency Positive Behaviour Support Trauma-Informed Practice",
    "softSkills": "Communication Creative Thinking Positive Attitude Problem Solving Team Leadership",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Class 4-5 Driver",
    "listingDate": "Posted 1w ago",
    "company": "Adecco New Zealand",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Class 4-5 DriversIntroductionWe are seeking Class 4-5 Drivers to join our team, providing essential transportation services across various locations in Whangarei. Our company is committed to delivering reliable and efficient logistics solutions, ensuring that goods are transported safely and on time. As a Class 4-5 Driver, you will play a crucial role in maintaining our high standards of service and customer satisfaction. This position offers a dynamic work environment with varied job activities, allowing you to utilize your driving skills and experience in a professional settingBenefitsVaried job activities that provide a dynamic and engaging work environmentWhat You Will DoOperate Class 4-5 vehicles to transport goods safely and efficientlyConduct pre-trip and post-trip inspections to ensure vehicle safety and complianceMaintain accurate records of deliveries and vehicle maintenanceAdhere to all traffic laws and company policies during transportationYour SkillsValid Class 4-5 driver's license with a clean driving recordProven experience in operating Class 4-5 vehicles in a professional settingStrong knowledge of traffic laws and regulationsExcellent communication skills for interacting with dispatchers and customersAbility to perform vehicle inspections and basic maintenance tasksInterested?If you are interested in joining our team as a Class 4-5 Driver, we encourage you to submit your application. Please provide your resume and any relevant certifications through our online application platform or via the email address provided below. We are committed to ensuring the health and safety of our employees and customers, and we adhere to all recommended precautions. We look forward to reviewing your application and potentially welcoming you to our team. APPLY NOW!Email: tspeight@adecco.co.nz \"By applying for this job, you confirm you have read https://www.adecco.com/en-nz/privacy-policy and consent to the Collection Statement located via https://www.adecco.com/en-nz/collection-statement By proceeding, you agree to receive marketing e-mails from The Adecco Group and acknowledge you can opt out at any time. As one of the world's largest employers, we believe in talent not labels, and focus on the diverse and unique skills our people bring. Our commitment to equal opportunity, inclusion, and diversity is part of our broader dedication to respecting fundamental human rights across our value chain. We seek to foster a culture of belonging and purpose, an environment where everyone can thrive and feel engaged, and where difference is respected and valued.\"",
    "listedSalary": null,
    "hardSkills": null,
    "softSkills": null,
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Agricultural Machinery Technician",
    "listingDate": "Posted 1w ago",
    "company": "Automotive Employment",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Job reference - 1168701International leading company and accredited employer with INZTop rates, overtime, tool allowance, and other benefitsSupportive team environment within a respected industry leader Access 34 years of our client relationships and connections and find your next job. New Zealand's leaders in motor industry recruitment since 1991. Automotive Employment NZ has been awarded Sourcr Automotive Agency of the Year for the second year in a row (2024-2025). Are you an experienced technician with a passion for agricultural machinery and a drive to support New Zealand's farming community? We're looking for skilled Agricultural Machinery Technicians to join the team of one of the country's leading agricultural equipment dealerships. About the companyThis company owns and operates more than several dealerships across New Zealand, selling and servicing global brands of tractors and agricultural machinery. They have distribution centres globally, and are national distributors of various leading brands of farm machinery. The roleAs an Agricultural Machinery Technician, you will play a key role in the maintenance, repair, and optimisation of a wide range of modern farming machinery. You'll work with advanced equipment, support customers both in the workshop and on-site, and help keep New Zealand's primary sector moving. Skills requiredThe ideal candidate would be a mechanic with an agricultural/farming machinery background, with brand experience and/or brand training.Relevant automotive trade qualification or equivalent experienceProven experience working on tractors and other agricultural / farming machinery is first preferenceStrong diagnostic and problem-solving abilitiesFamiliarity with modern agricultural technology and electronic systems (preferred)Ability to work independently and as part of a teamThe ability to maintain clear, professional communication with customers and the service team The rewardsCompetitive pay plus overtime opportunities, as well as other benefits - rates will range between $34 and $40 per hour. Training will also be provided to ensure that technical skills are kept up to date and technicians continue to add to and develop their abilities as well as to create opportunities for career advancement within the dealership network. A vehicle will be provided for field service duties. The role is permanent with a minimum 40 hours of work per week. How to applyApplications from those wanting to relocate from elsewhere within NZ are welcome. If you are based offshore and wanting to move to New Zealand and meet the requirements - please APPLY NOW. We are able to assist you with your visa requirements making the process seamless.If reading online, click the APPLY NOW section and submit your application online. For more information contact the team at Automotive Employment NZ Ltd for a confidential discussion. Phone during NZ business hours: The international landline is +64 9 271 3200.You can also visit the job board on our website to view further vacancies https://www.automotiveemployment.co.nz/jobsJobcorp owned companies include Jobcorp NZ Ltd, Jobcorp Immigration, and Automotive Employment NZ. Our company has business interests in recruitment, the provision of immigration advice, and the provision of employment relations advice.We partner with organisations committed to inclusive workplaces, where every individual is valued and respected.",
    "listedSalary": "$34 - $40 /hr",
    "hardSkills": "Agricultural Machinery Repair Diagnostics Electrical Systems Knowledge Mechanical Skills Technical Troubleshooting",
    "softSkills": "Attention to Detail Communication Customer Service Problem-Solving Teamwork",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Team Member",
    "listingDate": "Posted 1w ago",
    "company": "Restaurant Brands",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "PURPOSE OF POSITIONThe Team Member is responsible and accountable for performing specific tasks and duties, as assigned, within the restaurant. The Team Member provides each guest with a positive guest service experience, prepares quality food products and keeps the restaurant clean.KEY ACCOUNTABILITIESGeneral Accountabilities & Work tasks Follow guest service guidelines and procedures; take appropriate action to ensure guests receive service beyond their expectations Work assigned stations accurately and productively; clean and stock station areas; perform other cleaning duties as assigned You may be required to cook as an when required by your supervisor Handle all food products according to RBL procedures Follow RBL food safety, food handling and sanitation requirements, to ensure the health and safety of guests and employees Report faulty equipment and fixtures to the manager on duty Work Tasks could include: Order taking and serving food and beverage orders. Operating an electronic register, receiving payment and making change. Packing products into food packaging for takeaway or trays for serving, with condiments. Handing packed orders to customers from the packing bench to front counter or out the drive-thru window to the customer’s vehicle. Washing, cutting, dicing, slicing vegetable and salad ingredients. Measuring and mixing foods e.g. potato mix, gravy mix Using a potato scoop to scoop mash potato into pottles and pouring gravy on top. ∙ Preparing food such as burgers, wraps and salads Operating cooking equipment such as potato mixer, microwave, warmer timers ∙ Heating simple food items e.g. burger buns, rolls and tortillasMonitoring food timers for food safety ‘shelf life’ control and discards products Loading chip basket with raw fries placing in to the fryer, lifting and dumping cooked chips from the basket into the chip hopper, ready for serve. Scooping hot chips using a chip scoop into takeaway packaging. Moving chicken trays from the warming cabinet into the chicken display. Cleaning food preparation areas, cooking surfaces, food containers and utensils ∙ Handling general purpose detergents and sanitiser for cleaning Clearing tables of food packaging, emptying rubbish bins and carrying rubbish bags to the rubbish skip back of house. Training and Development Strive to improve personal skills and performance Relevant cook training may be provided as and when required Communicate to immediate supervisor when additional training, guidance and practice are needed Keep immediate supervisor informed of anything which might affect guests, other employees and overall operations Is performance oriented and driven; understands performance expectations and is aware of performance results Effective Business Management Consistently meet job expectations to positively impact the sales and profits of the restaurant ∙ Contribute to the restaurant’s success by accomplishing the expected work during each shift; consistently produces quality work Support the goals, decisions and directives of restaurant management; perform additional duties and responsibilities as directed Follow RBL guidelines for food and cash controls, follow cost control guidelines to maintain and minimize restaurant costs; properly use all products, suppliers, equipment and facilities Health and Safety Take reasonable care for your own health and safety at work, and that your actions/omissions do not cause harm to any other person in the workplace (including, for example, co-workers and customers) Participate in creating and maintaining a safe and healthy work environment, particularly by complying with instructions, policies and procedures Advise manager of any/all work related injuries, accidents, near misses and hazards or potential hazards (including any faults to equipment), and risks or potential risks to health and safetyMOST FREQUENT CONTACTSRestaurant Manager Assistant Restaurant Manager Customers Area Managers Store TeamCritical Qualifications/Skills/ExperienceQualifications: Ideally a minimum of NCEA Level 1 or working towards Level 1 Business/Technical Skills Previous customer service or customer facing experience is favoured but not essential Experience (Behavioural): Places customer first and goes out of their way to ensure customer satisfaction ∙ Able to work under pressure, remaining calm at all times Works well with others and is supportive and collaborative Focused on achieving results and strives to meet targets Acts with integrity at all times Works within guidelines, policies and rules and is a natural rule follower Focused on the safety and wellbeing of others at all times including customers and peersCommunicates effectively verbally with customers and the team and is clear and concise ∙ Able to comprehend written English and able to complete online training modules and follow written procedures and policies with ease Manages time well to complete set tasks and works quickly and with purpose to maintain momentumThis Position Description summarises the primary responsibilities of this role at the time of commencement. Various other responsibilities not listed here may also fall within the responsibility parameters of the position. From time to time and with the natural developments of business structure and practice, an employee may be required to perform additional or new responsibilities that fall reasonably within the expectations of this role. Any significant adjustments to role responsibilities will always be made after consultation with the employee.P22-225258-2",
    "listedSalary": "Operating an electronic register, receiving payment and making change",
    "hardSkills": "Cash Handling Cleaning Food Preparation Food Safety Register Operation",
    "softSkills": "Communication Customer Service Integrity Teamwork Time Management",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Surfacing Supervisor",
    "listingDate": "Posted 2w ago",
    "company": "Downer New Zealand",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "About UsAt Downer we plan, create and sustain. Downer is the leading provider of integrated services in Australia and New Zealand. Through trusted relationships and world leading insight we work closely with our customers to design, build and sustain assets, infrastructure, and facilities. About the TeamDowner’s Transport & Infrastructure business manages and maintains road networks across Australia and New Zealand, with civil and commercial construction in New Zealand. We are an integrated trans-Tasman team with a leading portfolio of products and services. By sharing our capabilities and insights across our regions we achieve the best technical solutions for our customers’ challenges, and for our communities.Job DescriptionWhy you will enjoy working here | Ko te take ka parekareka e koe ki te mahi ki kōneiDowner is committed to delivering excellence by ensuring our people have the environment and the means to be successful. We offer:Free access to Marram health care benefits and discounted holiday homes $500 bonus for current employees who refer a friend to DownerProgression and development programs, including our inspiring leader’s programme for top performersHave a look at our other great benefits here!The Opportunity | Te KōwhiringaAs our Surfacing Supervisor, you’ll plan, organise and lead our regional surfacing crew to ensure work is completed safely, efficiently and to a high standard. You’ll work closely with our Operations Manager and Delivery Manager to deliver programmes of work, optimise resources, and maintain strong customer relationships.This is a hands-on leadership role where you will drive quality, productivity and Zero Harm performance across your team.Your responsibilities will include:Lead, support and mentor surfacing crews, ensuring strong team culture and high performance.Oversee day-to-day surfacing operations, including chip stockpiling, QA processes, and audits.Work with delivery teams to programme and execute workflows effectively.Track project financials, including actual vs target cost estimates.Ensure all QA documentation, ITPs and as-builts are completed accurately.Maintain excellent customer relationships and identify new business opportunities.Drive Zero Harm by promoting safe, responsible behaviour and ensuring compliance.Coordinate plant, people and resources for optimal utilisation.Important Skills | Nga Pūkenga MatuaWe’re looking for someone who brings both technical surfacing knowledge and the ability to lead and inspire a team.A strong background in surfacing/sealing operations.Proven experience supervising teams in roading or civil construction.Knowledge of surfacing specifications, QA procedures and audits.Strong planning and organisational skills.Effective communication skills, both verbal and written.Computer literacy and the ability to track and report on performance.A Class 1 driver licence.Me pēhea ki te tono | How to apply If this sounds like the opportunity for you, click Apply Now to submit your application! The reference number for this role is 727378We are committed to a safe working environment for everyone - all successful applicants will be required to undertake a pre-employment drug test, medical and a Ministry of Justice check prior to starting employment. If you need support with this requirement, please talk to our team.",
    "listedSalary": "We offer:Free access to Marram health care benefits and discounted holiday homes $500 bonus for current employees who refer a friend to DownerProgression and development programs, including our inspiring leader’s programme for top performersHave a look at our other great benefits here!The Opportunity | Te KōwhiringaAs our Surfacing Supervisor, you’ll plan, organise and lead our regional surfacing crew to ensure work is completed safely, efficiently and to a high standard",
    "hardSkills": "Civil Construction Computer Literacy Project Planning Quality Assurance Surfacing Operations",
    "softSkills": "Collaboration Leadership Positive Attitude",
    "RoleLevel": "Team Lead"
  },
  {
    "title": "Production Team Leader",
    "listingDate": "Posted 2w ago",
    "company": "Whangarei Drycleaning Co Ltd",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "The RoleAs a Team Leader, You’ll play a key role on the factory floor — leading your team to meet production targets safely, efficiently, and to the highest quality standards.You’ll lead by example, communicate with all members of the business and ensure that all processes run efficiently while still actively maintaining our Company Values.Key ResponsibilitiesLead and inspire a teamLead and participate in prestart meetingsMaintain correct flow of materials, equipment, and information within your designated areaAllocate resources and plan rosters to optimise shift efficiency.Managing the day-to-day production, scheduling, inventory, quality assurance, ensuring processes are followed, and delivery is on time to meet customer requirements.Provide clear direction, training, and coaching to team members through SOP’s and H & S StdsWhat We’re Looking ForPrevious experience in a leadership or supervisory roleExcellent organisational and communication skills.Ability to lead, coach, and motivate a team.Problem-solving mindset and commitment to continuous improvement.Flexibility to work any day, 5am Starts.",
    "listedSalary": null,
    "hardSkills": "Resource Allocation Inventory Management Production Scheduling Quality Assurance Safety Standards",
    "softSkills": "Communication Problem Solving Team Motivation Leadership Organizational Skills",
    "RoleLevel": "Team Lead"
  },
  {
    "title": "Consol",
    "listingDate": "Posted 2w ago",
    "company": "New Zealand Couriers",
    "location": "Whangārei",
    "employmentType": "Part Time, Fixed Term Contract",
    "description": "About New Zealand CouriersProudly NZ-owned and operated, for over fifty years our company has been driving ahead of the competition thanks to our passionate team and results-focused service delivery. Now with over 1,100 employees, and 550 independent contractors in 25 locations across New Zealand, we are proud to serve the local communities we work in, to be New Zealand’s most experienced courier provider, and to be the flagship brand of Freightways.About the RoleBased at our Whangarei branch, our Freight Handlers sort and load parcels, working to deadlines to have everything ready for courier pick-up and delivery. Freight Handlers also assist in maintaining the cleanliness of the depot, and are dedicated to the team’s Health and Safety. In joining the our team, you are a crucial part of the nationwide mission to deliver our customers’ freight safely and on time.This is a fixed term part-time position, Monday to Friday, 2pm - 6pm - 20 hours per week until mid January About youCan lift up to 25kg repetitively and enjoy working on your feetStrong commitment to Health and SafetyAble to commit to night hoursExperience in warehousing depot environments is a plusWhat can we offer?A hardworking team dedicated to shared goalsAccess career opportunities with the Freightways group of companiesIf this sounds like you, apply here now to join a high-performing company! Please include your CV detailing your experience and suitability for this role.All candidates will be required to provide proof of NZ working rights and undergo pre-employment screening, including a criminal history check and drug test.",
    "listedSalary": null,
    "hardSkills": "Forklift Operation Freight Handling Geographical Knowledge Health & Safety Compliance Heavy Lifting",
    "softSkills": "Attention to Detail Physical Stamina Punctuality Reliability Teamwork",
    "RoleLevel": "Associate"
  },
  {
    "title": "SOLE TRADER -HAMMER HAND",
    "listingDate": "Posted 2w ago",
    "company": "RGP Builders Limited",
    "location": "Whangārei",
    "employmentType": "Contract, Temp",
    "description": "We’re on the lookout for a reliable and experienced sole trader-hammer hand-to join our small team.⸻Who We’re Looking For:A skilled Hammer Hand operating as a sole traderProven recent experience (with at least one reference)Own tool kit and reliable vehicleAble to commit to full-time work (40+ hours/week)Excellent attention to detail and commitment to safetyStrong communication, time management, and the ability to work independentlyMust have full New Zealand working rights⸻Your Work Will Include:Supporting qualified builder on-siteMeasuring, cutting, assembling materialsOperating power and hand tools safelyFollowing instructions and plans accuratelyKeeping your workspace clean and safe⸻What We’re Offering:Full-time, ongoing contract workWork across residential, commercial, and civil projectsA reliable pipeline of work so you can focus on the tools, not chasing jobsSupportive, down-to-earth team environmentImmediate start available for the right person",
    "listedSalary": "$35 - $50 /hr",
    "hardSkills": "Assembling materials Following plans Measuring and cutting Operating power tools Tool kit management",
    "softSkills": "Time Management Communication Ability to work independently Attention to detail Safety commitment",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Excavator Operator and Labourer",
    "listingDate": "Posted 2w ago",
    "company": "Ventia",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Join our strong, safety-focused team delivering roading maintenance and construction projects across the Northland region. We’re looking for skilled operators to support our Whangarei District Council contract.ABOUT THE ROLEOperate excavators for earthworks and site preparationOperate rollers and watercarts for compaction and dust controlAssist with general site duties and crew supportEnsure all work is completed safely and efficiently WHAT YOU’LL BRINGRelevant operating experience (roading or civil construction preferred)WTR endorsements and Class 2 or higher licenceStrong focus on safety and complianceAbility to work as part of a collaborative teamReliability and a positive attitude WHAT WE OFFERFull-time, permanent roles with guaranteed hoursConsistent work on a long-term maintenance contractGreat crew and supportive team cultureHealth Essentials Plan with Southern CrossRetail and fuel discounts through the Boost ProgrammeAccess to the Fitness PassportOngoing training and development opportunities If you’re an experienced operator looking for stability and a great team, we’d love to hear from you!Apply now and build your future with us.DiversityVentia is enriched by the diverse experiences, talents and cultures that our people bring to the organisation, while celebrating and respecting the communities we operate in. We are committed to providing a safe and positive environment that provides equal opportunities for individuals of all backgrounds, including Māori and Pasifika people, LGBTTQIA+, Women, Veterans and spouses and people with disabilities. How to applyIf you are looking to expand your career with a business that rewards and values its employees, please apply below by clicking on the apply now button. Position Reference Number: 165471",
    "listedSalary": "How to applyIf you are looking to expand your career with a business that rewards and values its employees, please apply below by clicking on the apply now button",
    "hardSkills": "Class 2 Licence Excavator Operation Roller Operation Watercart Operation WTR Endorsements",
    "softSkills": "Positive Attitude Problem Solving Reliability Safety Awareness Team Collaboration",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Retail Associatet | OPSM | C | NZ | Whangarei",
    "listingDate": "Posted 2w ago",
    "company": "OPSM",
    "location": "Whangārei",
    "employmentType": "Part Time",
    "description": "We are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. We bring together the expertise of two industry pioneers, one in advanced lens technologies and the other in the craftsmanship of iconic eyewear, creating a vertically integrated business that is uniquely positioned to address the world’s evolving vision needs. We craft exclusive eyewear brands Ray-Ban, Oakley, Oliver Peoples, Persol, Costa and more, alongside esteemed licensed brands such as Tiffany & Co, Burberry, and CHANEL whilst our cutting-edge lenses Varilux and Transitions lead the industry in innovation. In Australia and New Zealand, we operate the iconic retail and eye care brands: Sunglass Hut, Oakley, OPSM, Ray-Ban and Laubman & Pank. Every day, EssilorLuxottica’s 190,000 employees in 150 countries work towards a common mission to help people see more and be more. Are you someone who wants to make an impact?See yourself at OPSM!We are seeking a passionate and engaging Casual Retail Associate to join our OPSM team in Whangarei.You will be involved in the customer’s journey from initial consult and pre-testing, to customising High-Fashion frames (from Luxury Brands such as CHANEL, Tiffany & Co. and Gucci) to suit their lifestyle.What’s in it for you?Monthly bonus schemeSubstantial Discounts through the rewards & recognition programGenerous yearly product reimbursementsWorld-class training program, provided by our training team and in-store mentorsLocal & global Volunteering opportunities with OneSightWork with brands such as Ray-Ban, Oakley, PRADA, D&G, Burberry, Miu Miu, Versace and many others. See yourself at OPSM – become part of our family and help us make a real change in people’s lives!You bring to the team:Retail experience – optical desired but not essentialStrong communication skills and a quick learnerPassion to help others see the beauty in life Ready to apply?If you love high fashion, luxury brands and are passionate about providing high-quality customer service, then we want to hear from you now!Click apply now or email: Carrie.Callaghan@au.luxottica.comWe embrace diversity and encourage all interested applicants from different backgrounds to apply. Due to high volumes, only successful applicants will be contacted.To be considered for this opportunity, please click apply and send your cover letter and resume today.As an inclusive, team-first company, our people are at the core of everything we do.We care deeply about creating a workplace where our team members feel valued, respected and empowered. We are committed to providing equal opportunity regardless of gender identity, ethnicity, disability, sexual orientation or life stage.We value flexibility and encourage our team members to work in ways that meet their work/life commitments and support their wellbeing.We work hard to create a safe and inclusive environment for all, and most importantly, we're all about creating better experiences - for our customers and for each other.",
    "listedSalary": "What’s in it for you?Monthly bonus schemeSubstantial Discounts through the rewards & recognition programGenerous yearly product reimbursementsWorld-class training program, provided by our training team and in-store mentorsLocal & global Volunteering opportunities with OneSightWork with brands such as Ray-Ban, Oakley, PRADA, D&G, Burberry, Miu Miu, Versace and many others",
    "hardSkills": "Cash Handling Order Processing Product Expertise Retail Operations Sales Knowledge",
    "softSkills": "Adaptability Customer Focus Sales Motivation Team Collaboration Verbal Communication",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Care Coordinator - Registered nurse for chronic care",
    "listingDate": "Posted 2w ago",
    "company": "Raumanga Medical Centre",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Raumanga Medical Centre is a forward-thinking, equity-focused practice committed to delivering high-quality care to our community. We are seeking a skilled and adaptable Registered Nurse to join our team on a fixed-term contract.In this role, you will work across both general practice long-term conditions nursing and care coordination for our complex patients. Key responsibilities include supporting and managing patients with:DiabetesCOPD and other respiratory conditionsCardiac conditionsMultiple comorbidities and complex health needsWe are looking for a flexible, collaborative team player with strong general practice nursing skills and a passion for improving health outcomes.If you thrive in a supportive environment and are driven to make a meaningful difference, we would love to hear from you. Manager@raumangamed.nz",
    "listedSalary": null,
    "hardSkills": "Diabetes Care Chronic Care Management COPD Management General Practice Nursing Registered Nurse",
    "softSkills": "Collaboration Communication Teamwork Adaptability Patient Support",
    "RoleLevel": "Associate"
  },
  {
    "title": "Retail Sales Consultant",
    "listingDate": "Posted 2w ago",
    "company": "Lighting Direct",
    "location": "Whangārei",
    "employmentType": "Part Time",
    "description": "\"This role gives me the perfect combination of creativity, people connection, and technical challenge — it's engaging, rewarding, and never boring.\" That's why KJ's journey with Lighting Direct is proof that hard work and passion don't go unnoticed. Starting out as a Retail Sales Consultant in Dunedin, KJ has grown into the role of Assistant Branch Manager. Their story is one of many that shows how we back our people with real development and career progression opportunities. We have an exciting opportunity to join the team at Lighting Direct as a Part-Time Retail Sales Consultant.Do you have a passion for interiors? Does being surrounded by the latest lighting trends and technology spark your creativity? Whether you've just finished your own renovation or love a good DIY project, you know how important the right lighting is in transforming a space. You'll be using that insight to help our customers find the perfect lighting solutions — from a single bedside lamp to an entire home fit-out.What we're looking for:If your friends describe you as organised, energetic, motivated, and easy to get along with — you're already ticking the right boxes. You don't need lighting experience; we'll provide full training to get you up to speed quickly and confidently.About Us:Lighting Direct is New Zealand's most iconic lighting specialist. Proudly NZ-owned and operated since 1974, we've grown to 23 branches nationwide — supported by a team with over 800 years of combined lighting expertise.As a member of our team, you will enjoy…Competitive remuneration + monthly performance based sales bonusesAccess to professional EAP services to ensure your wellbeing is looked afterGenerous discounts for you and your immediate familyLong service rewardsThis role is based in our Whangarei Branch, working 14 hours per week Friday and Saturday.Time to make the switch? Apply Now!To apply for this job go to: https://lightingdirect.recruitmenthub.co.nz/Vacancies & enter ref code: 6833984.",
    "listedSalary": "\"This role gives me the perfect combination of creativity, people connection, and technical challenge — it's engaging, rewarding, and never boring",
    "hardSkills": "Technical Training Product Knowledge Customer Service Sales",
    "softSkills": "Creativity Teamwork Energetic Motivated Organised",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Centre Manager",
    "listingDate": "Posted 2w ago",
    "company": "Busy Bees",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Lead with purpose…. Inspire with passion …. Make a lasting impact Are you an inspiring leader with a passion for ECE? We are looking for an extraordinary person to lead and empower our team of highly skilled teachers at Busy Bees Whau Valley.About usAt Busy Bees Whau Valley, our focus is on empowering tamariki to direct their own learning while ensuring they feel supported and safe. Our diverse range of resources and age-appropriate materials are always utilised to encourage teachable moments and happy, learning-focused experiencesAs the Centre Manager of Busy Bees Whau Valley, you will have access to an excellent support network within the group, along with a Regional Manager who is committed to coaching and developing your success. We value Professional Development for all our teachers and are committed to upskilling and growing your professional development.About you:As a Centre Manager you will lead with heart and purpose – supporting and guiding a team of passionate teachers. As well as being responsible for creating solid community relationships, compliance management, mentoring and driving exceptional standards of teaching, you will be an integral part of making decisions which will drive the future focus for the centre, both in terms of environment and education. Role Requirements:An inspirational leader with an innate ability to develop and lead a team to deliver best practice childcare servicesB Ed/Dip Teaching Level 7 (ECE) and current teacher registration/certificationDemonstrated leadership experience you will love to coach, mentor and inspire!Initiative, desire and passion for quality practice standards and commitment to the principles of Te WhārikiFamiliarity with the New Zealand Education Council, ERO, MOE requirements, Licensing Criteria, 2008 Regulations and Code of EthicsA comprehensive understanding of how to maintain and grow occupancy levelsWhy choose Busy Bees?Full Pay Parity, subsidised childcare, First Aid Certification and Flu vaccinationOngoing professional development and mentoringLeadership development course to grow new leadersA generous time out of ratio to enable you to coach and mentor your teamA companywide commitment to employee wellbeing with access to EAP ServicesApply now with your CV and Cover Letter and be part of our journey to deliver the best possible childcare services to our community.Applicants for this position should have NZ residency or a valid NZ work visa.We are an Accredited EmployerWhy Work for Busy Bees?If you’re passionate about early learning, Busy Bees is the place to be. Although we are part of a global organisation, our company was founded by three families looking for better, more enriching childcare. Three decades later, we still keep the same values at heart.We know that we couldn’t do what we do without the important people in our teams. We invest in our people and work with them to build career pathways that inspire.",
    "listedSalary": "Role Requirements:An inspirational leader with an innate ability to develop and lead a team to deliver best practice childcare servicesB Ed/Dip Teaching Level 7 (ECE) and current teacher registration/certificationDemonstrated leadership experience you will love to coach, mentor and inspire!Initiative, desire and passion for quality practice standards and commitment to the principles of Te WhārikiFamiliarity with the New Zealand Education Council, ERO, MOE requirements, Licensing Criteria, 2008 Regulations and Code of EthicsA comprehensive understanding of how to maintain and grow occupancy levelsWhy choose Busy Bees?Full Pay Parity, subsidised childcare, First Aid Certification and Flu vaccinationOngoing professional development and mentoringLeadership development course to grow new leadersA generous time out of ratio to enable you to coach and mentor your teamA companywide commitment to employee wellbeing with access to EAP ServicesApply now with your CV and Cover Letter and be part of our journey to deliver the best possible childcare services to our community",
    "hardSkills": "Inspirational Leadership Problem Solving Strong Communication Team Collaboration",
    "softSkills": "Compliance and Regulations Curriculum Knowledge ECE Teaching Qualification Leadership and Management",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Stainless Steel Fabricator",
    "listingDate": "Posted 2w ago",
    "company": "NetYourJob",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Please Quote Reference Number 14490Experienced Tradesman/fabricator in Light Gauge Stainless SteelAttention to detail and high standard of workmanshipFantastic team environmentAbsolute Stainless Ltd was established in October 2001 by Simon and Sue Mehrtens, with the aim to supply the Whangarei area with top quality stainless products at an affordable price. In the beginning the majority of customers were from the marine industry here in Whangarei but business grew rapidly to include work from the commercial, residential and construction industries from Kaitaia through to Auckland. We are now supplying businesses and the private sector with a large variety of stainless and aluminum products and services. We moved into our own purpose-built workshop in June 2019, where we have continued to grow - With Mckenna Stainless Fittings becoming part of our business in 2024. Mckenna has a 30 year history, supplying quality stainless fabricated tees, concentric reducers, eccentric reducers and pulled tees to distributors.We are currently looking for a Stainless Steel Tradesman / Fabricator to join our team working on hand rails, bench tops, commercial kitchens & rangehoods, tanks, flashings and many more custom items.This is a full time position working 80 hours per fortnight - Monday to Thursday 7:00am - 4:30pm and every second Friday 7:00am to 3:30pm - Giving you a three day weekend every fortnight.You will have proven experience working in light gauge stainless steel, capable of producing high-quality work with attention to detail and a strong commitment to safety and craftsmanship.Key Responsibilities:Fabrication, TIG/MIG welding, and finishing of stainless steel componentsReading and interpreting technical drawings and fabrication plansOperation of workshop machinery and hand toolsAssembly, installation, and site work as requiredMaintaining high standards of workmanship and quality controlWorking collaboratively within a small, supportive teamAbout You:Proven experience in light gauge stainless steel fabrication is essentialProficient in TIG welding (MIG an advantage)Strong understanding of stainless steel grades, finishes, and fabrication techniquesAbility to work from detailed drawings with accuracyStrong problem-solving skills and a proactive approachReliable, punctual and committed to producing quality workCurrent driver's licence (preferred)Trade qualification (desirable but not essential if skills are proven)Why join us:Small family owned businessFantastic team environmentActive social clubOnsite parkingSound like you? APPLY NOW through our online application form.Please Quote Reference Number 14490",
    "listedSalary": null,
    "hardSkills": "Assembly Fabrication MIG Welding Technical Drawing TIG Welding",
    "softSkills": "Attention to Detail Problem Solving Reliability Safety Awareness Teamwork",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Experienced and Junior Tilers",
    "listingDate": "Posted 3w ago",
    "company": "Tileworx",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "The work may include:Reading and interpreting drawings, plans, and specifications to understand project requirementsPreparing surfaces for tiling, including cleaning, leveling, and waterproofingPrep and Installation of underfloor heatingCutting, laying, and grouting tiles on walls, floors, and other surfaces according to project specificationsInstalling various types of tiles, including schist, thin veneer and natural stoneSurface prep including screeding / levelling as neededGrouting, pointing, cleaning and sealing as requiredWorking alongside other trades, following site health & safety proceduresEnsuring tools, materials and work zone are maintained to high standardWhat you bring to the table:Experienced tiler (wall and floor tile installation) with proven trade skillsPrevious experience with stonework is advantageousAbility to work efficiently, deliver high-quality finish and meet schedule requirementsComfortable reading plans, preparing surfaces, grouting, waterproofing, finishingStrong eye for detail, reliability, punctuality and good communication with team members and site supervisorsWe welcome applicants from all backgrounds – whether you're a qualified tiler, an experienced labourer with tiling know-how, or overseas qualified, we want to hear from you!📞 Call or text Hailee on 0273244334",
    "listedSalary": "$30 - $55 /hr",
    "hardSkills": "Surface Preparation Grouting Reading plans Tile cutting Tile installation",
    "softSkills": "Communication Reliability Attention to detail Efficiency Punctuality",
    "RoleLevel": "Associate"
  },
  {
    "title": "Truck and Trailer Driver (Class 5)",
    "listingDate": "Posted 2w ago",
    "company": "Ventia",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Join our strong, safety-focused team delivering roading maintenance and construction projects across the Northland region. We’re seeking an experienced Truck and Trailer Driver to transport construction materials and equipment to sites and provide support to the crew.WHAT YOU'LL BRINGClass 5 licence (essential)Roading or construction experience (advantage)Sound knowledge of load security and transport regulationsAbility to operate and maintain vehicles safely and efficientlyStrong work ethic and commitment to teamworkReliability and a focus on safety at all times WHAT WE OFFERConsistent work with guaranteed hoursFull-time, permanent role with job securityGreat crew and supportive team cultureHealth Essentials Plan with Southern CrossRetail and fuel discounts through the Boost ProgrammeAccess to the Fitness PassportOngoing training and development opportunitiesWork with a respected company on a Whangarei District Council contract If you’re reliable, safety-conscious, and keen to work with a solid team, we’d love to hear from you!Apply now and drive your career forward.DiversityVentia is enriched by the diverse experiences, talents and cultures that our people bring to the organisation, while celebrating and respecting the communities we operate in. We are committed to providing a safe and positive environment that provides equal opportunities for individuals of all backgrounds, including Māori and Pasifika people, LGBTTQIA+, Women, Veterans and spouses and people with disabilities. How to applyIf you are looking to expand your career with a business that rewards and values its employees, please apply below by clicking on the apply now button. Position Reference Number: 165470",
    "listedSalary": "How to applyIf you are looking to expand your career with a business that rewards and values its employees, please apply below by clicking on the apply now button",
    "hardSkills": "Class 5 Licence Load Security Roading Experience Transport Regulations Vehicle Operation",
    "softSkills": "Attention To Detail Communication Reliability Teamwork Time Management",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Caregivers",
    "listingDate": "Posted 2w ago",
    "company": "Metlifecare",
    "location": "Whangārei",
    "employmentType": "Part Time",
    "description": "Excellent hourly rates and allowances on offerGreat staff benefits such as paid birthday offVariety of Permanent part time hours and shifts available.Located in the heart of WhangareiWe are seeking 3 fabulous Caregivers to join our great team at Whangarei Park Village. Our village offers Rest home, hospital and dementia level care and you'll be working under the direction of our Registered Nurses providing high standards of care and support to our residents.We offer competitive hourly rates base on qualification level, allowances and great staff benefits such as paid 'Wellness' days and your birthday off, as well as an amazing team to work in! We have 3 permanent, positions available working rostered shifts as follows:Role 1: 31.5 hours/5 days per week: Thurs- 7am to 3 pm, Friday, Saturday, Sunday and Tuesday - 3-9.30 pm Role 2: 16.5 hours/3 days per week- 3pm to 9 pm Friday to SundayRole 3: 13 hours/2 days per week - Friday 7am to 1 pm and Saturday 11pm to 7 amThere may be the opportunity to pick up additional shifts if desired.Some of the Great things you will be doing include:Working under the guidance of the Registered NurseProviding quality care and support to our residentsWorking in a supportive environment in a modern care facilityAbout youAttitude is key here. We are looking for experienced Caregivers, who love their job as a vocation and who are flexible in terms of availability. You will be part of a growing organisation, who stives daily to deliver the best care available to our residents.Previous experience in aged care and a desire to learn and develop your skill setCareerforce or equivalent qualificationEmpathy, kindness and a love for making an impact on our residents' livesBright, breezy attitude and a \"can-do\" team focusFlexibility around shifts Check out some of our Benefits!Paid wellness days per annum & 1 paid day of leave to celebrate your birthday each yearHealth & Life Insurance - automatic cover free to all permanent staff26 weeks of parental leave on full pay and 5 days paid leave for partners.Kiwisaver payments continued for those opted in over the age of 65 yearsEducation, Development and Training SupportAbout usEstablished in 1984, Metlifecare is a leading owner and operator of retirement villages, providing rewarding lifestyles and care to more than 7,400 New Zealanders. We pride ourselves on providing retirement communities in which people are empowered to be the very best version of themselves. How to applyPlease apply by clicking on the below APPLY NOW button or by visiting our careers page www.careers.metlifecare.co.nz/homeMetlifecare is committed to minimising adverse outcomes from the transmission of influenza or infectious diseases, and as such we request all potential employees disclose their immunisation status at the time of employment.Please note that Identification and work eligibility is required with your application.More details (document) Caregiver - Level 4.pdf",
    "listedSalary": "Excellent hourly rates and allowances on offerGreat staff benefits such as paid birthday offVariety of Permanent part time hours and shifts available",
    "hardSkills": "Aged Care Experience Basic Clinical Knowledge Health & Wellbeing Qualification Level 3 or 4 Medication Administration Resident Support",
    "softSkills": "Communication Empathy Flexibility Positive Attitude Team Focus",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Automotive Technician",
    "listingDate": "Posted 3w ago",
    "company": "Automotive Employment",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Job reference - 1121478Leading, long-established franchise dealership and accredited employerSeeking qualified automotive technicians with strong diagnostic and repair skillsTop hourly rates, overtime, and excellent staff benefits availableAccess 34 years of our client relationships and connections and find your next job. New Zealand's leaders in motor industry recruitment since 1991. Automotive Employment NZ has been awarded Sourcr Automotive Agency of the Year for the second year in a row (2024-2025).Advance your career in beautiful WhangāreiWe're looking for experienced Automotive Technicians to join a highly regarded, well-established franchise dealership in Whangārei, a city known for its natural beauty and relaxed lifestyle. Located at the gateway to Northland and the Bay of Islands, Whangārei offers an appealing coastal lifestyle, affordable housing, and a slower pace of life - perfect for those looking to escape the big city while continuing to work in a professional, well-supported environment. Join a dealership team that prides itself on expert service, quality workmanship, and a strong sense of teamwork.What's on offerWork with modern diagnostic tools, equipment, and technologyOngoing manufacturer and technical training to keep your skills up to dateWork on high-quality vehicle brands in a professional environmentBe part of a collaborative team that values mutual support and growthOpportunities to progress into senior or leadership rolesCompetitive pay based on your skills and qualifications - top earners make $32-$40+ per hourFull-time, permanent role - minimum 40 hours per weekEnjoy life in Whangārei - a vibrant city surrounded by beaches, bush, and a subtropical climateThe rolePerforming scheduled servicing, diagnostics, and complex repairsUsing advanced diagnostic tools and technical resourcesWorking with your team to resolve technical issues efficientlyMaintaining accurate service records and repair documentationCommunicating clearly with service advisors and customers when neededWe're looking forTrade-qualified automotive technicians with solid post-qualification experienceExperience working in a dealership environmentFranchise training, especially to Senior or Master Technician level, is a bonusStrong diagnostic, mechanical, and electrical repair skillsAbility to work independently and meet workshop deadlinesGood communication and a strong commitment to customer serviceA genuine interest in ongoing learning and the latest automotive technologiesHow to applyApplications from those wanting to relocate from elsewhere within NZ are welcome. If you are based offshore and wanting to move to New Zealand and meet the requirements - please APPLY NOW. We are able to assist you with your visa requirements making the process easy and seamless.If reading online, click the APPLY NOW section and submit your application online. For more information contact the team at Automotive Employment NZ Ltd for a confidential discussion. Phone during NZ business hours: The international landline is +64 9 271 3200.You can also visit the job board on our website to view further vacancies https://www.automotiveemployment.co.nz/jobsJobcorp owned companies include Jobcorp NZ Ltd, Jobcorp Immigration, and Automotive Employment NZ. Our company has business interests in recruitment, the provision of immigration advice, and the provision of employment relations advice.We partner with organisations committed to inclusive workplaces, where every individual is valued and respected.",
    "listedSalary": "$32 - $40 /hr",
    "hardSkills": "Accessory Fitment Automotive Diagnostics Breakdown Services Vehicle Servicing WOF Inspections",
    "softSkills": "Attention to Detail Communication Problem-Solving Reliability Teamwork",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Oral Health Therapist",
    "listingDate": "Posted 2w ago",
    "company": "Lumino the Dentist",
    "location": "Whangārei",
    "employmentType": "Part Time",
    "description": "1/120 Bank Street, Whangārei 0110, New ZealandPart-timeRegion: North Auckland and NorthlandSite Location: Lumino WhangareiCompany DescriptionLumino the Dentists Whangārei is a well-established practice with a loyal patient base and a strong reputation for delivering high-quality care. Located in the heart of Northland’s largest city, our team enjoys a supportive environment, modern facilities, and the lifestyle benefits that come with living close to beautiful beaches, bush walks, and a vibrant local community. Join a passionate and experienced team that takes pride in making a real difference in the lives of our patients.Job DescriptionAs one of our Oral Health Therapist or Hygienists, you'll play a pivotal role in maintaining the oral health well-being of our community. You will be responsible for providing top-notch hygiene services and education around oral health, as well as promoting preventative care.Part-time hours available: Tuesday, Wednesday and Thursday. Competitive compensation based on experience - either commission-based or hourly rate can be discussed. Relocation assistance available (T&Cs apply)Whangārei is a city in the Northland region of New Zealand's North Island. Whangārei's spectacular landscapes and coastline of golden beaches set a beautiful backdrop for its status as Northland's commercial centre. It's home to the Whangārei Falls, which tumble over cliff into a natural pool.Spend weekends sailing, surfing, kayaking & hiking to waterfalls.Grab a coffee as you relax at a quayside café.Enjoy the variety & bustle of the main shopping hubs & or find fresh produce at local Artisan markets.To find out more about the practices, please click on the link: https://lumino.co.nz/dentists/bank-street-dental-whangarei/meet-our-team/ QualificationsYou'll fit easily into our practice if you have:Outstanding communication skills for patient education and rapport building.A natural team spirit and a genuine interest in contributing to the warmth of the team.Exceptional attention to detail in all aspects of clinical practice.To be successful in the role you will need to hold registration with the New Zealand Dental Council (NZDA) as well as a current Annual Practicing Certificate.Additional InformationAt Lumino, we aim to deliver a superior patient experience for everyone who visits our practices. Our people are passionate about dentistry and the important part it plays in the health and well-being of New Zealanders.As the leading provider of dentistry in the country and with 88% brand awareness, we're the number one choice of dentist throughout New Zealand.We invest in our people, with training and resources to keep them at the top of their game.We ensure our clinicians and clinical teams receive great training and development opportunities as well as modern equipment and the technology to help them grow professionally.If you enjoy working with patients and watching them walk out the door loving their smiles, then you will enjoy being part of the team at Lumino the Dentists.Join Us in Making a DifferenceWanting to know more? Apply Today!For a confidential chat, feel free to contact Tyla directly.",
    "listedSalary": "Competitive compensation based on experience - either commission-based or hourly rate can be discussed",
    "hardSkills": "Dental Hygiene NZDA Registration Oral Health Assessment Patient Care Preventative Care",
    "softSkills": "Attention to Detail Communication Empathy Patient Education Teamwork",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Stainless Steel Polisher",
    "listingDate": "Posted 2w ago",
    "company": "NetYourJob",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Please Quote Reference Number 14486Attention to detail and high standard of workmanshipTraining and support availableFantastic team environmentAbsolute Stainless Ltd was established in October 2001 by Simon and Sue Mehrtens, with the aim to supply the Whangarei area with top quality stainless products at an affordable price. In the beginning the majority of customers were from the marine industry here in Whangarei but business grew rapidly to include work from the commercial, residential and construction industries from Kaitaia through to Auckland. We are now supplying businesses and the private sector with a large variety of stainless and aluminum products and services. We moved into our own purpose-built workshop in June 2019, where we have continued to grow - With Mckenna Stainless Fittings becoming part of our business in 2024. Mckenna has a 30 year history, supplying quality stainless fabricated tees, concentric reducers, eccentric reducers and pulled tees to distributors.We are currently looking for a Stainless Steel Polisher to join our McKenna division.This is a full time position working 80 hours per fortnight - Monday to Thursday 7:00am - 4:30pm and every second Friday 7:00am to 3:30pm - Giving you a three day weekend every fortnight.You will be responsible for sanding and polishing stainless steel fabricated tees and reducers. This is a hands-on, labour intensive role requiring you to stand at different stations in the polishing process.To be considered for this role, you will need to demonstrate:Attention to detailThe ability to work unsupervisedA good level of physical fitnessAbility to carry out repetitive tasksClear English communication skillsA current NZ Drivers LicenceA can-do attitude and willingness to learnAny previous experience would be highly regarded but is not essential.Why join us:Small family owned businessFantastic team environmentActive social clubOnsite parkingSound like you? APPLY NOW through our online application form.Please Quote Reference Number 14486",
    "listedSalary": null,
    "hardSkills": "Driving Fabrication Fitness Polishing Sanding",
    "softSkills": "Attention to detail Communication Reliability Teamwork Willingness to learn",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Associate Dispenser | OPSM | PT | NZ | LynnMall",
    "listingDate": "Posted 2w ago",
    "company": "OPSM",
    "location": "Whangārei",
    "employmentType": "Casual",
    "description": "We are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. We bring together the expertise of two industry pioneers, one in advanced lens technologies and the other in the craftsmanship of iconic eyewear, creating a vertically integrated business that is uniquely positioned to address the world’s evolving vision needs. We craft exclusive eyewear brands Ray-Ban, Oakley, Oliver Peoples, Persol, Costa and more, alongside esteemed licensed brands such as Tiffany & Co, Burberry, and CHANEL whilst our cutting-edge lenses Varilux and Transitions lead the industry in innovation. In Australia and New Zealand, we operate the iconic retail and eye care brands: Sunglass Hut, Oakley, OPSM, Ray-Ban and Laubman & Pank. Every day, EssilorLuxottica’s 190,000 employees in 150 countries work towards a common mission to help people see more and be more. Are you someone who wants to make an impact?See yourself at OPSM!We are seeking a passionate and engaging Part-Time Retail Associate to join our OPSM team in LynnMall for 25 hours per week. This position will involve both week day and weekend shifts. You will be involved in the customer’s journey from initial consult and pre-testing, to customising High-Fashion frames (from Luxury Brands such as CHANEL, Tiffany & Co. and Gucci) to suit their lifestyle.What’s in it for you?Monthly bonus schemeSubstantial Discounts through the rewards & recognition programGenerous yearly product reimbursementsWorld-class training program, provided by our training team and in-store mentorsLocal & global Volunteering opportunities with OneSightWork with brands such as Ray-Ban, Oakley, PRADA, D&G, Burberry, Miu Miu, Versace and many others. See yourself at OPSM – become part of our family and help us make a real change in people’s lives!You bring to the team:Retail experience – optical desired but not essentialStrong communication skills and a quick learnerPassion to help others see the beauty in lifeReady to apply?If you love high fashion, luxury brands and are passionate about providing high-quality customer service, then we want to hear from you now!Click apply now or email: Carrie.Callaghan@au.luxottica.comWe embrace diversity and encourage all interested applicants from different backgrounds to apply. Due to high volumes, only successful applicants will be contacted.To be considered for this opportunity, please click apply and send your cover letter and resume today.As an inclusive, team-first company, our people are at the core of everything we do.We care deeply about creating a workplace where our team members feel valued, respected and empowered. We are committed to providing equal opportunity regardless of gender identity, ethnicity, disability, sexual orientation or life stage.We value flexibility and encourage our team members to work in ways that meet their work/life commitments and support their wellbeing.We work hard to create a safe and inclusive environment for all, and most importantly, we're all about creating better experiences - for our customers and for each other.",
    "listedSalary": "What’s in it for you?Monthly bonus schemeSubstantial Discounts through the rewards & recognition programGenerous yearly product reimbursementsWorld-class training program, provided by our training team and in-store mentorsLocal & global Volunteering opportunities with OneSightWork with brands such as Ray-Ban, Oakley, PRADA, D&G, Burberry, Miu Miu, Versace and many others",
    "hardSkills": "Product Knowledge Order Handling Point-of-Sale (POS) Retail Systems Sales Processing",
    "softSkills": "Teamwork Adaptability Communication Customer Service Motivation",
    "RoleLevel": "Associate"
  },
  {
    "title": "Diesel Mechanic",
    "listingDate": "Posted 2w ago",
    "company": "All Truck Repair Ltd",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "All Trucks is a locally owned and operated workshop. We have been in business since 1998. All Trucks offer a wide range of services to our customers and work on all makes and models of vehicles. As such, the variety of work means no two days are the same. We are looking for a qualified mechanic to join our team. In particular, we are looking for mechanics experienced in American trucks ie. Kenworth, freightliner, mack etc. There is an opportunity for personal growth/promotion within the business. This position has the potential to become a leading hand postion.ResponsibilitiesRoutine maintenance and repairs on diesel engines and heavy vehiclesFault diagnosis using diagnostic tools and manualsBreak down repairsSafety inspections and compliance with NZ regulationsCOF repairsAccurate service record keeping and communication with the workshop managerTeam collaboration to meet deadlines and maintain service standardsRequirementsMUST CURRENTLY RESIDE IN NEW ZEALANDMinimum 3 years’ experience as a diesel mechanicRelevant trade qualification or certificationStrong diagnostic and problem-solving skillsAbility to work independently and in a teamFull NZ driver’s license (Class 2 or higher a plus)Reliable, positive attitude, and strong work ethicWhat We OfferSupportive team environment with ongoing trainingModern workshop with quality tools and equipmentStaff tool accountsCareer growth opportunitiesCompetitive pay and benefitsHow to ApplySend your CV and cover letter to admin@alltruck.co.nzFor more info, contact Gary on 021 226 1443Visit us at: http://www.alltruck.co.nz",
    "listedSalary": "$30 - $50 /hr",
    "hardSkills": "COF Repairs Diesel Engine Maintenance Fault Diagnosis Safety Inspections Service Record Keeping",
    "softSkills": "Reliability Teamwork Problem Solving Positive Attitude Work Ethic",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "CNC/manual machinist",
    "listingDate": "Posted 3w ago",
    "company": "BCE Precision Limited",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "We’re Hiring – CNC / Manual Machinist | Full-Time – WhangāreiBCE Precision Engineering is on the lookout for a skilled CNC/Manual Machinist to join our growing team. If you take pride in precision work and enjoy a hands-on role in a modern, supportive workshop — we’d love to hear from you!What we’re after:Trade qualified with 5+ years’ experience in machiningSkilled in both CNC and manual machiningConfident reading and interpreting technical drawingsReliable, detail-oriented, and safety-focusedAble to work independently and as part of a teamWhat we offer:Competitive pay based on experienceSupportive team environment and well-equipped workshopCareer growth and development opportunitiesVariety of work across precision components and custom jobsFull-time position available now!📧 Apply with your CV to logan@bceprecision.co.nz",
    "listedSalary": "$25 - $35 /hr",
    "hardSkills": "Machining CNC machining Manual machining Precision work Technical drawing interpretation",
    "softSkills": "Teamwork Detail-Oriented Reliability Independence Safety-focused",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Spa & Pool Service Technician",
    "listingDate": "Posted 3w ago",
    "company": "Northland Spa and Pool Co Ltd",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "*The Role: - Diagnostics, repairs and installation of spa and pool equipment within both residential and commercial properties, being willing and able to work in all other facets of the business including Valet, Retail Sales and Pool and Spa Installations*What you need: -A good understanding of health and safety and be able to put it into practice , an ability to think logically and have a mechanical aptitude , great organisational and planning skills , good computer skills , a can do attitude and being flexible and adaptable to the role and it's requirements , a high level of customer service and customer relation skills is needed as this role involves a high degree of customer contact , you will be the face of the company on the road ,ability to use technology in the field, ability to work independently, a good sense of humour and the ability to work effectively with colleagues and customers alikeA pre-employment medical and drug test will be required for the successful applicant as the role does include lifting, bending, driving etcA Clean Full Drivers Licence is essentialIf this is something that may interest you, please apply with a cover letter and an up-to-date CV to Mrs lee Lomas",
    "listedSalary": null,
    "hardSkills": "Computer Skills Diagnostics Health and Safety Installation Repairs",
    "softSkills": "Customer Service Flexibility Independence Organisational Skills Planning",
    "RoleLevel": "Associate"
  },
  {
    "title": "Intermediate Lawyer / Legal Caseworker",
    "listingDate": "Posted 3w ago",
    "company": "155 Community House",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Kia hiwa rā! Are you a skilled and compassionate lawyer with a strong sense of justice and community?We’re looking for an Intermediate Lawyer / Legal Caseworker (Rōia Hapori) to join our Community Law team. If fairness, accessible justice, and kaupapa Māori practice matter to you, we’d love to have you on our team.About usAt Whare Āwhina, we are driven by a vision of a just society. Our mahi is grounded in manaakitanga, rangatiratanga, whanaungatanga, and kotahitanga.We empower people in Taitokerau by walking alongside them as they navigate life’s challenges. Our services include Community Law, Community Housing, Community Support, a community café, a social supermarket, and Whakaora Kai food rescue. About the roleFull-time, permanent positionMonday – Friday, 37.5 hours per weekBased in Whangārei, with travel to outreach locations Key responsibilitiesProvide legal information, advice, assistance, and advocacy, including at outreach clinics.Manage a caseload of ongoing legal matters and ensure timely progress.Contribute to the development of legal education programmes.Present or co-present training to community groups.Support initiatives that promote equity and social justice.What you’ll bringAdmission as a barrister & solicitor of the High Court of NZA current NZ practising certificate (or working towards one)Approximately 3+ years’ PQE for IntermediateKnowledge of Te Tiriti o Waitangi and a commitment to kaupapa Māori approachesExperience working alongside Māori and diverse communitiesStrong communication, decision-making, and relationship-building skillsNZ Citizenship and a full NZ driver’s licenceExperience in one or more of: Dispute Resolution, Employment, Tenancy & Housing, Consumer Affairs, Family, or Enduring Powers of AttorneyWhat we offerCompetitive salary aligned to MECA standardsA values-led workplace centred on manaaki and justiceA supportive, knowledgeable team passionate about community impactProfessional development opportunities and growth pathwaysA vibrant workplace in the heart of WhangāreiHow to applyReady to use your legal expertise for good? We’d love to hear from you.Please send your CV and a brief cover letter explaining why you’re the right fit for this kaupapa.For a full job description or kōrero, email: anne-marie@whareawhina.org.nzShortlisting and interviews may take place as applications are received. The role may be filled early.Applications close: Friday, 14 December 2025 at 5.00pm",
    "listedSalary": "$70.38 - $84.87 k/yr",
    "hardSkills": "Case Management Legal Advice Dispute Resolution Legal Advocacy Te Tiriti o Waitangi Knowledge",
    "softSkills": "Communication Decision Making Compassion Equity Awareness Relationship Building",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Picker/Packer",
    "listingDate": "Posted 3w ago",
    "company": "AWF",
    "location": "Whangārei",
    "employmentType": "Temp",
    "description": "Our client is seeking energetic and reliable individuals for day and night shifts to assist with restocking shelves and replenishing grocery, produce, chilled and frozen items. You will be required to move product from the stockroom to the shelves and place in the correct sections.About You:Have a great attitude towards workBe reliable and punctualAble to communicate and interact with customersBe a team playerBe physically fit, able to lift up to 25kgHave a solid understanding of safety regulations and practicesPass a pre-employment drug and alcohol screenHave a clean criminal history, able to pass a MOJ checkProvide two work referencesWhat you will get from AWF:The opportunity to work with great teamsGuaranteed weekly pay + kiwisaver + holiday payOngoing support from your manager and the Team at AWFPPE ProvidedRegular catch ups and health and safety monitoring from AWFIf this sounds like you, then don't delay apply NOW on line!Please note - we do not always work to fixed closing dates and may start considering applications as they are received so we encourage you to apply early.**Overseas applicants will not be considered for this role**",
    "listedSalary": "About You:Have a great attitude towards workBe reliable and punctualAble to communicate and interact with customersBe a team playerBe physically fit, able to lift up to 25kgHave a solid understanding of safety regulations and practicesPass a pre-employment drug and alcohol screenHave a clean criminal history, able to pass a MOJ checkProvide two work referencesWhat you will get from AWF:The opportunity to work with great teamsGuaranteed weekly pay + kiwisaver + holiday payOngoing support from your manager and the Team at AWFPPE ProvidedRegular catch ups and health and safety monitoring from AWFIf this sounds like you, then don't delay apply NOW on line!Please note - we do not always work to fixed closing dates and may start considering applications as they are received so we encourage you to apply early",
    "hardSkills": "Basic Computer Skills Basic Inventory Management Physical Fitness",
    "softSkills": "Communication Punctuality Reliability Teamwork",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Class 5 Driver",
    "listingDate": "Posted 3w ago",
    "company": "AWF",
    "location": "Whangārei",
    "employmentType": "Temp",
    "description": "We are on the hunt for motivated and experienced Class 5 truck drivers to work within the civil construction sector. Do you know your way around transporters, tipper trucks and truck & trailer units? If you are reliable, safety focused, and keen to get stuck in, this is a chance to join a team that values your skills and expertise.What We're Looking For:Valid Class 5 Drivers Licence (minimum)Civil experience including tippingAbility to work efficiently and safely on siteTeam player with a strong work ethicReliable, motivated and have a positive attitudePhysically fit and able to assist with labouring tasks when not drivingWhat's In It For You:All PPE ProvidedWeekly Pay + KiwiSaver + Leave entitlementsCompetitive pay rates based on experienceRegular catch ups and health and safety monitoring from AWFIf this sounds like you, please apply online NOW and attach a current CV!**To apply you should be a New Zealand citizen, resident or have a valid NZ work visa. You will also be required to pass a pre-employment Drug and Alcohol Screen along with a Ministry of Justice criminal background check**",
    "listedSalary": "What We're Looking For:Valid Class 5 Drivers Licence (minimum)Civil experience including tippingAbility to work efficiently and safely on siteTeam player with a strong work ethicReliable, motivated and have a positive attitudePhysically fit and able to assist with labouring tasks when not drivingWhat's In It For You:All PPE ProvidedWeekly Pay + KiwiSaver + Leave entitlementsCompetitive pay rates based on experienceRegular catch ups and health and safety monitoring from AWFIf this sounds like you, please apply online NOW and attach a current CV!**To apply you should be a New Zealand citizen, resident or have a valid NZ work visa",
    "hardSkills": "Class 5 Driving Load Transport Road Safety Compliance Site Support Vehicle Operation",
    "softSkills": "Communication Customer Focus Organisation Reliability Time Management",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Legal Caseworker / Legal Executive (Graduate Welcome!)",
    "listingDate": "Posted 3w ago",
    "company": "155 Community House",
    "location": "Whangārei",
    "employmentType": "Full Time, Graduate",
    "description": "Kia hiwa rā!Are you a detail-savvy legal mind with a strong sense of fairness and community? Whether you’re a new graduate ready for your first step into the legal world or an experienced Legal Caseworker/Legal Executive, this could be your chance to make a real impact in Taitokerau.About usAt Whare Āwhina, we are driven by a vision of a just society. Our mahi is grounded in manaakitanga, rangatiratanga, whanaungatanga, and kotahitanga.We empower people in Taitokerau by walking alongside them as they navigate life’s challenges. Our services include Community Law, Community Housing, Community Support, a community café, a social supermarket, and Whakaora Kai food rescue. About the roleFull-time, permanent positionMonday – Friday, 37.5 hours per weekBased in Whangārei, with travel to outreach locations Key responsibilitiesProvide legal information, advice, assistance, and advocacy, including at outreach clinics.Manage a caseload of ongoing legal matters and ensure timely progress.Contribute to the development of legal education programmes.Present or co-present training to community groups.Support initiatives that promote equity and social justice.What you’ll bringA Legal Executive diploma or relevant legal qualification(For graduates) A strong desire to learn, grow, and gain practical experience in community lawUnderstanding of legal processes and documentationWarm, clear communication skills and the ability to engage with diverse communitiesA commitment to kaupapa Māori approaches and Te Tiriti o WaitangiGood organisation, maturity, and sound judgementNZ Citizenship or Residency, and a full NZ driver’s licenceWhat we offerCompetitive salary aligned to MECA standardsA values-led workplace centred on manaaki and justiceA supportive, knowledgeable team passionate about community impactProfessional development opportunities and growth pathwaysA vibrant workplace in the heart of WhangāreiHow to applyReady to use your legal expertise for good? We’d love to hear from you.Please send your CV and a brief cover letter explaining why you’re the right fit for this kaupapa.For a full job description or kōrero, email: anne-marie@whareawhina.org.nzShortlisting and interviews may take place as applications are received. The role may be filled early.Applications close: Friday, 12 December 2025 at 5.00pm",
    "listedSalary": "$66.24 - $77.63 k/yr",
    "hardSkills": "Legal Education Case Management Legal Advice Community Law Legal Documentation",
    "softSkills": "Communication Judgement Commitment Cultural Competence Organisation",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Heavy Machinery Operators",
    "listingDate": "Posted 3w ago",
    "company": "AWF",
    "location": "Whangārei",
    "employmentType": "Temp",
    "description": "AWF have exciting opportunites for experienced and skilled machine operators to work within the civil construction sector. We have roles operating machinery with Wheels, Tracks and Rollers endorsements for qualified, safety-conscious and reliable operators.What You Need:Class 1 licence & current WTR endorsement (minimum)Class 2 and 4 preferredProven experience in civil construction machinery operation with references to support your applicationAbility to work well in a teamA strong work ethic and reliabilityStrong focus on health and safety proceduresPhysically fit and able to handle labouring tasksWhat's In It For You:Guaranteed weekly pay + kiwisaver + holiday payFull PPE provided by AWFRegular catch ups and health and safety monitoring from AWFOpportunity to work with great teamsOngoing support from your manager and the team at AWFIf this opportunity sounds like you, then apply online NOW with a current CV and start your journey with AWF!**To apply you should be a New Zealand citizen, resident or have a valid NZ work visa. Our employees need to pass a pre-employment Drug and Alcohol Screen along with a Ministry of Justice criminal background check.**",
    "listedSalary": "What You Need:Class 1 licence & current WTR endorsement (minimum)Class 2 and 4 preferredProven experience in civil construction machinery operation with references to support your applicationAbility to work well in a teamA strong work ethic and reliabilityStrong focus on health and safety proceduresPhysically fit and able to handle labouring tasksWhat's In It For You:Guaranteed weekly pay + kiwisaver + holiday payFull PPE provided by AWFRegular catch ups and health and safety monitoring from AWFOpportunity to work with great teamsOngoing support from your manager and the team at AWFIf this opportunity sounds like you, then apply online NOW with a current CV and start your journey with AWF!**To apply you should be a New Zealand citizen, resident or have a valid NZ work visa",
    "hardSkills": "Earthmoving Heavy Machinery Operation Licence Endorsements Machine Maintenance Roadworks Equipment",
    "softSkills": "Communication Physical Fitness Reliability Safety Awareness Teamwork",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Laboratory Technician",
    "listingDate": "Posted 3w ago",
    "company": "Excellere College",
    "location": "Whangārei",
    "employmentType": "Part Time",
    "description": "Excellere College, a Year 1–13 Christian Area School in Whangārei, is seeking a motivated and organised Laboratory Technician to support our Science Department. This position is for one day per week (5hrs) during term time, with occasional flexibility of hours for special projects or practical support.The successful applicant will:Prepare, set up, and pack away materials and equipment for science experiments.Maintain chemical and equipment inventories, ensuring compliance with safety standards.Support teachers and students by creating a safe, efficient, and engaging practical learning environment.Uphold and model the Christian values that underpin the life and culture of Excellere College.This role would suit someone with laboratory experience, strong organisational skills, and a heart for serving within a Christ-centred learning community. A background in school science environments would be an advantage but not essential.Applications close: 28/11/2025To apply: Please send a cover letter and CV to the Principal, Andy Mouat at Excellere College, office@excellerecollege.school.nz and principal@excellerecollege.school.nzJoin our team and help inspire the next generation of scientific thinkers in a supportive Christian environment.",
    "listedSalary": null,
    "hardSkills": "Equipment Setup Safety Compliance Chemical Inventory Management Laboratory Experience",
    "softSkills": "Flexibility Motivation Organisational Skills Supportive",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Automotive Service Advisor",
    "listingDate": "Posted 3w ago",
    "company": "Toyota NZ",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Due to the continued growth & expansion of our Service Department, Northland Toyota is seeking an additional Service Advisor to join our professional and friendly team. We’re looking for an individual who is passionate about delivering exceptional customer service and motivated by results.The Service Advisor is responsible for leading the customer experience within our service department. You’ll be the key link between our customers and workshop team — providing trusted advice, clear communication, and ensuring that every visit exceeds expectations.The key responsibilities of the Service Advisor.Answering customer inquiries and providing advice and recommendations relating to the service and repair of their vehiclesMaking bookings for service and repairs Ensuring customer satisfaction by providing excellent customer service Maintaining an accurate record of customer interactions Identifying and addressing customer concerns.Always maintain a professional and friendly manner with customers Updating customer records and managing customer accounts Liaising with workshop staff to ensure customer requirements are met. Creating and maintaining relationships with our clientsAbout YouPrevious experience within the automotive industry is an advantage.Able to work to a high standard in a busy and high-pressure environment.Excellent communication skillsStrong attention to detail and accuracyExcellent time managementFull New Zealand Driver’s licenseAbility to work Saturdays as per the rosterThe successful candidate will be an excellent communicator with exceptional customer service and interpersonal skills. They will be able to work independently and handle multiple tasks while maintaining a high level of quality and accuracy. If you are interested in this role, please send an up-to-date CV and cover letter via the online application form.Unfortunately, we are not accepting applications from offshore at present. If you reside outside New Zealand or do not already have the right to work here, we regret that we cannot consider your application.We will review all applications regularly and reserve the right to close the advertisement before the end date.",
    "listedSalary": null,
    "hardSkills": "Automotive Knowledge Computer Proficiency Order Processing Service Scheduling Technical Understanding",
    "softSkills": "Attention to Detail Communication Customer Service Problem-Solving Team Collaboration",
    "RoleLevel": "Associate"
  },
  {
    "title": "Experienced non-qualified kaiako",
    "listingDate": "Posted 3w ago",
    "company": "He Kaakano Early Learning Centre",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "About Us:We are an established, purpose-built centre that is recognised as an ECE Enviroschool. Our commitment to the environment and sustainability is central to our philosophy, complemented by a spacious outdoor area for tamariki to explore, learn, and play.Key Responsibilities:Collaborate positively within our team to create a nurturing learning environment.Contribute effectively to professional discussions and learning stories through strong written and verbal communication skills.Deliver quality education and learning experiences alongside tamariki, demonstrating commitment and proactivity.Bring a great sense of humour to our daily interactions and activities.What We Offer:Better than MoE ratios ensuring quality attention and care.We are committed to paying a living wage – currently $28.95 per hour.Paid First Aid certification.Ongoing professional development opportunities.Staff uniform provided.50% discounted fees.A supportive work-life balance.If you are ready to make a meaningful impact in the lives of tamariki while working in a supportive and fun environment, we would love to hear from you!This position is for 32.5 hours working Monday to Friday 8.30am to 3.30pm with staff meetings and early opens requiring additional hours during the week. We also work to a rostered schedule during school holidays.Please forward your CV and covering letter to us before applications close Friday 28th of November 2025.",
    "listedSalary": "$28 .95/hr",
    "hardSkills": "Early Childhood Education Written Communication Professional Development First Aid Certification Verbal Communication",
    "softSkills": "Teamwork Communication Nurturing Attitude Proactivity Sense of Humour",
    "RoleLevel": "Associate"
  },
  {
    "title": "Grader Operator",
    "listingDate": "Posted 3w ago",
    "company": "Ventia",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "We’re looking for an experienced Grader Operator to join our team in beautiful Whangārei, working on a mix of roading construction and maintenance projects. This role is part of a newly awarded maintenance contract, offering long-term stability and the chance to be part of a company with a strong reputation in the region.WHAT'S IN IT FOR YOU?A great team culture with supportive leadershipLong-term, stable work on essential community servicesOpportunity to work with a company that’s well-established in the roading sectorA scenic and vibrant location to live and work ABOUT YOUSkilled grader operator with experience in roadingClass 4 licence preferredA proactive attitude and commitment to safetyWillingness to contribute to both construction and maintenance work Join a team that’s making a real impact in the community through essential infrastructure work. If you're ready for a stable role in a great location, we’d love to hear from you!Apply now and help shape the roads of Whangārei!DiversityVentia is enriched by the diverse experiences, talents and cultures that our people bring to the organisation, while celebrating and respecting the communities we operate in. We are committed to providing a safe and positive environment that provides equal opportunities for individuals of all backgrounds, including Māori and Pasifika people, LGBTTQIA+, Women, Veterans and spouses and people with disabilities. How to applyIf you are looking to expand your career with a business that rewards and values its employees, please apply below by clicking on the apply now button. Position Reference Number: 165412",
    "listedSalary": "How to applyIf you are looking to expand your career with a business that rewards and values its employees, please apply below by clicking on the apply now button",
    "hardSkills": "Class 4 Licence with WTR Endorsement Grader Operation Expertise Road Maintenance Techniques",
    "softSkills": "Attention to Detail Communication Independence",
    "RoleLevel": "Associate"
  },
  {
    "title": "Automotive Sales Consultant",
    "listingDate": "Posted 3w ago",
    "company": "Toyota NZ",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Sales Consultant - Toyota Northland Due to an internal promotion and continued growth, we’re looking for a Vehicle Sales Consultant to join our energetic, customer-focused team.At Northland Toyota, we’re passionate about delivering exceptional customer experiences and building long-term relationships. If you’re driven, people-oriented, and ready to grow your career with a leading brand, we want to hear from you.About the Role:Engage with customers to understand their needs and provide exceptional service.Demonstrate and sell a range of Toyota vehicles.Build and maintain strong customer relationships.Achieve sales targets and contribute to the overall success of the dealership. About YouYou’ll bring:Proven sales experience (automotive experience is an advantage).Excellent communication and interpersonal skills.A genuine passion for customer service.The ability to thrive in a fast-paced, target-driven environment.Integrity, motivation, and a positive attitude.Customer service or people management experience (helpful but not essential).What We Offer:Competitive salary and commission structure.Ongoing training and development opportunities in conjunction with Toyota New Zealand.Supportive and friendly team environment.Opportunity to work with a leading automotive brand.Remuneration by way of a retainer & competitive commission structure.As we are a 6-day business, Saturday work is required.If the above sounds like you, you can apply now online. We look forward to receiving your application if you have the skills and motivation to work with us. Unfortunately, we are not currently accepting applications from offshore. If you reside outside New Zealand or do not already have the right to work here, we regret that we cannot consider your application.We will review all applications regularly and reserve the right to close the advertisement before the end date.",
    "listedSalary": "What We Offer:Competitive salary and commission structure",
    "hardSkills": "CRM Proficiency Customer Service People Management Product Knowledge Sales Experience",
    "softSkills": "Communication Coachability Integrity Listening Motivation",
    "RoleLevel": "Associate"
  },
  {
    "title": "Qualified & registered kaiako",
    "listingDate": "Posted 3w ago",
    "company": "He Kaakano Early Learning Centre",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "An exciting opportunity has arisen for a registered or provisionally registered kaiako to join our professional and friendly team. We are looking for an enthusiastic and self-motivated individual with a genuine passion for working with tamariki. Key Responsibilities:Collaborate positively within our team to create a nurturing learning environment.Contribute effectively to professional discussions and learning stories through strong written and verbal communication skills.Deliver quality education and learning experiences alongside tamariki, demonstrating commitment and proactivity.Bring a great sense of humour to our daily interactions and activities.About Us:We are an established, purpose-built centre that is recognised as an ECE Enviroschool. Our commitment to the environment and sustainability is central to our philosophy, complemented by a spacious outdoor area for tamariki to explore, learn, and play.What We Offer:Better than MoE ratios ensuring quality attention and care.Remuneration in accordance with full pay parity.Paid teacher registration and first aid certification.Ongoing professional development opportunities.Staff uniform provided.50% discounted fees.A supportive work-life balance.If you are ready to make a meaningful impact in the lives of tamariki while working in a supportive and fun environment, we would love to hear from you!This position is for 32.5 hours working Monday to Friday 8.30am to 3.30pm with staff meetings and early opens requiring additional hours during the week. We also work to a rostered schedule of reduced staffing during school holidays.Forward your CV and covering letter to us before applications close on Friday 28th of November 2025.",
    "listedSalary": "Remuneration in accordance with full pay parity",
    "hardSkills": "Early Childhood Education Written Communication First Aid Certification Registered Kaiako Verbal Communication",
    "softSkills": "Communication Teamwork Proactivity Self-Motivation Sense of Humour",
    "RoleLevel": "Associate"
  },
  {
    "title": "Automotive Technician",
    "listingDate": "Posted 3w ago",
    "company": "Toyota NZ",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Full-time | Permanent | Competitive pay + specialist Toyota training + relocation assistanceDue to Toyota's ongoing growth in Northland, we are seeking additional Automotive Technicians (or near-qualified technicians) to join our professional team. If you have experience as a qualified or nearly qualified technician, this is your opportunity to upskill and become a Toyota specialist, working with New Zealand’s biggest-selling vehicle brand.Why join Northland Toyota· Specialist Toyota training & mentoring to develop your career· Modern, purpose-built workshop with the latest diagnostic equipment· Supportive, well-staffed team focused on collaboration and efficiency· Relocation assistance available for successful applicants moving to Northland· Excellent working conditions and stable, long-term employmentWhat you’ll be doing· Vehicle servicing, diagnostics, and repairs to Toyota standards· Electrical and mechanical fault diagnosis using up-to-date tools and software· Supporting our customers by delivering top-quality workmanship and communication· Working collaboratively within a team-oriented environment to achieve service goalsWhat you’ll bring· Automotive Trade Qualification (NZQA Level 4 or equivalent) or close to completion· Strong mechanical aptitude and attention to detail· A commitment to safety, quality, and continuous improvement· Valid NZ driver’s licence· The right to work in New Zealand (we are not accepting offshore applications without valid NZ work rights)Training & DevelopmentAt Northland Toyota, you’ll receive comprehensive Toyota technical training and mentoring to enhance your expertise. Whether you’re a newly qualified technician or an experienced mechanic, we’ll help you grow into a Toyota specialist.How to applyApplications will only be accepted through our online application form.Please include your CV and tell us about your qualifications and experience.We will review all applications regularly and reserve the right to close the advertisement early.Join a respected brand, work with a skilled and supportive team, and advance your career in one of New Zealand’s most trusted automotive networks.",
    "listedSalary": "Full-time | Permanent | Competitive pay + specialist Toyota training + relocation assistanceDue to Toyota's ongoing growth in Northland, we are seeking additional Automotive Technicians (or near-qualified technicians) to join our professional team",
    "hardSkills": "Automotive Repair Diagnostics Toyota Systems WOF Certification Workshop Efficiency",
    "softSkills": "Communication Customer Focus Positive Attitude Problem Solving Team Collaboration",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Parts Advisor",
    "listingDate": "Posted 3w ago",
    "company": "Automotive Employment",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Job reference - 1122798Reputable employer with career growth potential in the wider groupFast-paced, hands-on parts role support workshop and sales teams dailyProven automotive parts experience a mustAccess 34 years of our client relationships and connections and find your next job. New Zealand's leaders in motor industry recruitment since 1991. Automotive Employment NZ has been awarded Sourcr Automotive Agency of the Year for the second year in a row (2024-2025).About the employerThis is a well-established dealership in Whangārei with other operations in NZ. With a strong focus on delivering exceptional customer service, they represent trusted a brands.Their team is committed to fostering strong relationships and supporting customers through high-quality sales, service, and parts solutions. Known for their supportive culture and emphasis on growth and wellbeing, this is a company where your contribution truly matters.The roleBased in Whangārei, this is a role for someone passionate about customer service, inventory management, and the automotive industry You'll be the go-to person for parts support, handling enquiries from both internal teams and external customers, identifying and sourcing parts, managing stock levels, and helping to ensure smooth day-to-day operations.You'll also support sales and workshop teams, help manage supplier relationships, and keep processes running efficiently, all while maintaining a high standard of service. No two days are the same, and you'll have the opportunity to play a vital part in the success of a busy, fast-paced branch.Skills and experience requiredPrevious experience in automotive parts is requiredExcellent communication and teamworkConfidence working with inventory systems and cataloguesSolid organisational and time management abilitiesA full NZ driver's licence and current eligibility to work in New ZealandIn returnA salary reflecting your experience and skillsOngoing training and development opportunitiesA supportive team environment that values safety, wellbeing, and career growthA chance to work with leading brands in a dynamic and rewarding roleHow to applyApplications from those already based in Whangārei or wanting to relocate from elsewhere within NZ are welcome.If reading online, click the APPLY NOW section and submit your application online. For more information contact the team at Automotive Employment NZ Ltd for a confidential discussion. Phone during NZ business hours: The international landline is +64 9 271 3200.You can also visit the job board on our website to view further vacancies https://www.automotiveemployment.co.nz/jobsJobcorp owned companies include Jobcorp NZ Ltd, Jobcorp Immigration and Automotive Employment NZ. Our company has business interests in recruitment, the provision of immigration advice, and the provision of employment relations advice.We partner with organisations committed to inclusive workplaces, where every individual is valued and respected.",
    "listedSalary": "Skills and experience requiredPrevious experience in automotive parts is requiredExcellent communication and teamworkConfidence working with inventory systems and cataloguesSolid organisational and time management abilitiesA full NZ driver's licence and current eligibility to work in New ZealandIn returnA salary reflecting your experience and skillsOngoing training and development opportunitiesA supportive team environment that values safety, wellbeing, and career growthA chance to work with leading brands in a dynamic and rewarding roleHow to applyApplications from those already based in Whangārei or wanting to relocate from elsewhere within NZ are welcome",
    "hardSkills": "Automotive Parts Knowledge Inventory Management Inventory Systems Stock Control Supplier Relationship Management",
    "softSkills": "Communication Customer Service Organization Teamwork Time Management",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Roading Maintenance Supervisor",
    "listingDate": "Posted 3w ago",
    "company": "Ventia",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Join a great team and make an impact!We’re excited to announce a newly awarded contract and are looking for a skilled Roading Maintenance Supervisor to lead our crew in beautiful Northland.What we offer:A supportive, collaborative team environmentHealth Essentials plan with Southern CrossCompetitive pay with a leading employerWork in a stunning Northland location About the role:Supervise a team of 5–6 peopleOversee roading maintenance activities including rehabs and patchingEnsure quality, safety, and efficiency across all projectsAbout you:Proven experience in roading or maintenanceStrong leadership and team-building skillsAbility to multitask and manage prioritiesGood computer skills for reporting and schedulingA proactive, hands-on approachIf you’re passionate about roading maintenance and ready to lead a great team, apply now and be part of something new!DiversityVentia is enriched by the diverse experiences, talents and cultures that our people bring to the organisation, while celebrating and respecting the communities we operate in. We are committed to providing a safe and positive environment that provides equal opportunities for individuals of all backgrounds, including Māori and Pasifika people, LGBTTQIA+, Women, Veterans and spouses and people with disabilities. How to applyIf you are looking to expand your career with a business that rewards and values its employees, please apply below by clicking on the apply now button. Position Reference Number: 165403",
    "listedSalary": "What we offer:A supportive, collaborative team environmentHealth Essentials plan with Southern CrossCompetitive pay with a leading employerWork in a stunning Northland location About the role:Supervise a team of 5–6 peopleOversee roading maintenance activities including rehabs and patchingEnsure quality, safety, and efficiency across all projectsAbout you:Proven experience in roading or maintenanceStrong leadership and team-building skillsAbility to multitask and manage prioritiesGood computer skills for reporting and schedulingA proactive, hands-on approachIf you’re passionate about roading maintenance and ready to lead a great team, apply now and be part of something new!DiversityVentia is enriched by the diverse experiences, talents and cultures that our people bring to the organisation, while celebrating and respecting the communities we operate in",
    "hardSkills": "Class 2 Licence Road Maintenance Site Supervision Technical Plan Interpretation Traffic Management",
    "softSkills": "Leadership and Strategic Vision Problem-Solving and Decision-Making Stakeholder Management and Communication",
    "RoleLevel": "Team Lead"
  },
  {
    "title": "Senior Structural Engineer",
    "listingDate": "Posted 1mo ago",
    "company": "Donovan Group NZ Limited",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "About UsDonovan Group is transforming the global construction industry with a fresh approach and a comprehensive suite of industry-defining construction innovations. Our game-changing construction software solution Airbuildr, provides an integrated, intuitive design and engineering platform for the commercial market. It acts as a catalyst, disrupting the building industry and driving game-changing customer experiences. Our innovative consumer brands Coresteel Buildings, KiwiSpan and MODNframe encompass the New Zealand market, from custom-designed large scale commercial steel buildings, through to barns, sheds, and garages. Providing technical support is Design Station, our dedicated structural engineering and detailing team, while Modern Building Product offer construction industry products required for steel building construction. Underpinning the group is Donovan Group Advanced Manufacturing, maximising value through industry-leading, advanced steel manufacturing technology. We are a lab for construction innnovation, continuously creating what comes next so that building becomes easier, faster, safer, more accessible, and more sustainable for everyone. One of our guiding principles is to drive innovation to significantly reduce the amount of carbon that the global construction industry uses. Outside of New Zealand Donovan Group licenses its proprietary Airbuildr design, engineering, and project management software, and licenses the manufacture and fabrication of its Patented DonoBeam and DonoBrace products for Portalised Frame buildings construction. The Opportunity Based at our Whangārei office, and working with our Head Engineer, we are looking for a talented and experienced Senior Structural Engineer to join our team. In this role, you will be responsible for analysing and designing steel buildings for Coresteel, KiwiSpan and MODNframe projects, providing technical structural engineering advice, and ensuring the successful completion of projects within set timeframes and budgets. You will also have the opportunity to contribute to research and development projects and play a key role in maintaining and developing our structural systems and calculation libraries. Key responsibilities of the role are: Manage the analysis and structural design of various projects, ensuring adherence to project scope, cost, and timeframes. Provide engineering support and advice to the Design Station team and other stakeholders.Produce structural calculations suitable for building consent. Liaise with clients to clearly define design scope, manage design processes, and supervise construction projects as needed. Develop automated processes for analysis and design.About YouTo succeed in this role, you will bring: CPEng qualified. 5+ years of experience as a Structural Engineer. Proven record of providing effective solutions to clients. High degree of personal motivation and self-management. Excellent attention to detail and organisational skills. Be the type of person who doesn't settle for mediocrity. Always do what you say you will do. Be a collaborative team player who has a desire to grow and learn.",
    "listedSalary": null,
    "hardSkills": "Project Management Structural Calculations Steel Buildings CPEng Qualification Structural Design",
    "softSkills": "Collaboration Self-management Attention to Detail Customer Focus Organizational Skills",
    "RoleLevel": "Senior"
  },
  {
    "title": "Support Worker",
    "listingDate": "Posted 1mo ago",
    "company": "IDEA Services",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Full time positions Wakeover shifts - you will be awake throughout the night to provide care$23.84-$29.10 per hour dependi ng on relevant qualifications Mō te tūnga | About the roleIDEA Services is committed to empowering people with intellectual disabilities to live fulfilling, meaningful lives—both in the comfort of their own homes and as active, valued members of their communities. As a Support Worker, you'll be providing overnight support to individuals with complex needs, ensuring their safety and wellbeing while promoting dignity and independence. This includes managing risk, responding to individual care plans, and offering compassionate, person-centred support throughout the night. Your presence will provide reassurance and continuity of care, helping each person feel secure and respected.Check out our website to learn more: Become a Support WorkerNgā pūmanawatanga ōu | What you will bringPrevious experience as a Support Worker is preferred, but more importantly, we are looking for someone with a positive attitude and compassion.Flexibility to work rostered shifts.A calm nature and confidence to work with challenging behaviours.Comfortable and proficient in using computers and tablets daily.Strong written and verbal communication skills.Physical fitness to provide necessary physical support.A Full NZ driver's license Nōu te rourou | What's in it for you?$23.84-$29.10 per hour depending on relevant qualifications, with the ability to earn more as you gain qualifications.IDEA Services will support you towards completion of the Level 2, 3 and 4 Certificates in Health and Wellbeing qualifications.Generous long service leave entitlements plus insurance benefits after 2 years' service.'Refer a friend' Bonus programme.FREE Employee Assistance programme service anytime you need health and wellbeing support. Mō mātou | About usIDEA Services supports adults with intellectual disabilities to live in their own homes and enjoy life as part of their communities. We are New Zealand's largest provider of services to people with intellectual disabilities and their families. Our services are founded on IHC's utter commitment for people with intellectual disabilities to have a good life and to be valued contributors to and members of their own community. IDEA Services Ltd is an accredited Immigration AEWV employer.The IHC Group is committed to Te Tiriti o Waitangi and actively seek a diverse applicant pool. We encourage candidates of all backgrounds to apply. We welcome all kinds of diversity and the different perspectives such diversity brings to our work.Me pēhea te tuku tono | How to ApplyThe first step is to submit an online application by selecting the 'Apply' button. As part of the application process you will be required to provide an up-to-date CV outlining your previous experience. We are unable to discuss your suitability for the role until we have received your application. If you have any questions about the application process or specific queries about the position, please use the contact details below to speak to recruitment.Applicants can direct enquiries about position to:Taylor Spence - Recruitment Advisortaylor.spence@ihc.org.nz",
    "listedSalary": "$23 .84 - $29 .10/hr",
    "hardSkills": "IT/Computer Proficiency Meal Preparation Medication Administration Personal Care Assistance Transportation Support",
    "softSkills": "Teamwork Adaptability Communication Empathy Patience",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Assistant Manager",
    "listingDate": "Posted 1mo ago",
    "company": "MAX",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "In search of a change in direction? Love beautiful product?Love Shopping?Enjoy talking to people?Looking for a fun and supportive working environment?Look no further, a leadership career with the Barkers Max Group will give you all of that and comes packed with great benefits and rewards:Industry competitive salaryPerformance based rewardsExtremely generous staff discount across both brandsGreat Training and DevelopmentFlexibility to work across two of the country’s leading retail brandsOnboarding product allowanceThe Barkers Max Group is 100% New Zealand owned and operated. We are industry leaders in responsible business practices from both an ethics and sustainability standpoint. We are currently on the search for a candidate to take on the role of Assistant Manager at our Whangarei Store.If you are someone who possesses the below traits, then we would love for you to join our team. Has good energy and enthusiasm Finds satisfaction is helping people gain confidence through amazing dress standardsWants to maintain and build on an amazing work cultureKnows how to lead people to perform at their bestThis role is a 40 hour salaried position. As Assistant Manager you have the opportunity to take the lead role 2 days per week. This opportunity will allow the right candidate to demonstrate their talent and work towards elevating to bigger and better things.If this sounds like it could be the role for you, please send your application through.We look forward to catching up with you soon.",
    "listedSalary": "In search of a change in direction? Love beautiful product?Love Shopping?Enjoy talking to people?Looking for a fun and supportive working environment?Look no further, a leadership career with the Barkers Max Group will give you all of that and comes packed with great benefits and rewards:Industry competitive salaryPerformance based rewardsExtremely generous staff discount across both brandsGreat Training and DevelopmentFlexibility to work across two of the country’s leading retail brandsOnboarding product allowanceThe Barkers Max Group is 100% New Zealand owned and operated",
    "hardSkills": "Product Knowledge Inventory Control Retail Management Sales Targets Staff Training",
    "softSkills": "Communication Customer Service Enthusiasm Leadership Motivation",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "TM File Management Support Officer",
    "listingDate": "Posted 1mo ago",
    "company": "New Zealand Police",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Are you looking for an exciting new challenge in 2026?We are looking for File Management Support Officers (FMSOs) to join our team and play their part in keeping New Zealander’s safe.Based in Piki Ki Te Ao, OtahuhuPermanent/Full time Shift WorkRemuneration: $63,526 per annumAttractive Shift Work IncentivesTraining provided however adequate computer skills are required and you will be required to complete an online psychometric test Multiple positions available Intake date commences on Thursday 12 March 2026– you must be available to start on this date.The first 12 weeks will consist of training at Piki Ki Te Ao from Monday 16 March. You must be fully available to attend training for the first 12 weeks.E tῡ ki te kei o te waka, kia pakia koe e ngā ngaru o te wā.Stand at the stern of the canoe and feel the spray of the future biting at your faceMō te tūnga | About the roleFile Management Support Officers (FMSO’s) are part of File Management, Transcription Services (FM&T) and are part of a nationally centralised group which supports a number of key elements within the case management process, our frontline staff and also provides key services to victims.Have you got an inquisitive mind? Do you work hard to get the right outcome? Are you able to get the job done, even if it’s in a fast-paced environment where there can be pressure from time to time?This is a challenging, interesting, and very important role, you would be recording data, establishing details, and efficiently managing information in real time. Quite simply, you would be our digital paperwork superheroes. Some of the key accountabilities in this role are:Accurately recording and transcribing information to a high standardAnalysing information and using your initiative to make decisionsUsing empathy with internal and external stakeholders.Communicating easily and effectively both written and orally.Managing conflicting demands.He aha taau e kawe mai | What you’ll bringWhilst we are looking for skills, knowledge and experience relevant to the role, we also place high importance on your state of mind, the alignment of your values with ours, your ability to contribute to and build high performing teams, and the way that you lead yourself or others.A mindset that embraces change, is adaptable and able to be flexible and agile in their thinking and way of working.Supportive of team members and looks for opportunities to contribute to an inclusive environment.Determining the relevance and potential risks identified of information that is being analysed whilst upholding confidentiality.Have a commitment to excellence – ability to concentrate on detailed tasks for long periods of time, learn from mistakes, a drive to improve and take on feedback.At New Zealand Police we value diversity and inclusion. Recognising different perspectives and experiences help make us better at what we do. Reflecting the communities we serve and appreciating different thinking and ways of life leads to better problem solving and results.Shift work details:Our centre in Otahuhu operates 24/7 on a six on four off roster, including night shifts. The roster pattern is two early shifts (0600hrs – 1500hrs), two late shifts (1200hrs – 2200hrs), two night shifts (2100hrs – 0630hrs), followed by four days off. What we offer:Full trainingFlexible hoursUp to 15% Shift Incentive28 days of leave, 40 including Statutory DaysProfessional development opportunitiesExcellent career progressionOption to join the New Zealand Police Association with access to a number of benefits including health plan, Life Insurance, Member Discounts and financial servicesThis role is Individual Contributor/Emerging Leader level. You can refer to Indicators for Success for further information on the requirementsTo view the position description for this role please copy and paste this link into a new browser:https://www.police.govt.nz/sites/default/files/pd/11-2025/file_management_support_officer_0.pdfMo tātou | About usNew Zealand Police is the lead agency responsible for preventing crime and enhancing community safety. It works in partnership with individuals, communities, businesses, and other public sector agencies towards the vision of making New Zealand the safest country. Police is the government’s largest front-line response agency with around 15,000 staff in large and small communities all over New Zealand and in liaison and policing development roles overseas.Your development is highly valued at NZ Police. Our employees enjoy significant investment in their development not only at an individual level, but also at the team and community practice level. We work hard to match you with work that will both play to your strengths and challenge you in new ways.The work you’ll be engaged in is real, tangible work that directly benefits our frontline and communities. Taken all together, this means we can offer you career path opportunities to progress in your chosen profession and become a more well-rounded, experienced leader, with opportunities across the range of work we support.To view more detailed information about our recruitment process along with further details about requirements please click below link: Applicant Information Pack (External)Tono ināianei | Apply nowIf this position sounds like you, click apply now and submit a tailored CV. You will be required to submit an application form. Before confirmation of hire, pre-employment checks will be undertaken which include reference, drug and alcohol testing and police vetting prior to any written offer being made. For further information on the application process, please copy and paste this URL: https://www.police.govt.nz/careers All applications must be submitted online and will not be accepted directly via email. All applicants must have the right to work in New Zealand. If you are an internal applicant, you must apply internally through the police system. You must provide an alternative contact email address and state your future commitments should you be successful in the next stage of the recruitment process. This advert is set to close on Monday, 24 November 2025, however advertising may stop earlier if we have a high number of applications.If you have any questions about this vacancy, please contact kiri.croasdale@police.govt.nz",
    "listedSalary": "$63.53 k/yr",
    "hardSkills": "Data Entry Decision-Making Information Analysis Real-Time Data Recording Transcription Accuracy",
    "softSkills": "Adaptability Attention to Detail Communication Empathy",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Water Serviceperson",
    "listingDate": "Posted 1mo ago",
    "company": "Downer New Zealand",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Ko te take ka parekareka e koe ki te mahi ki kōnei | Why you will enjoy working here.Downer Group is an employer that acknowledges and embraces the importance of our people's diverse experiences, talents, and cultures. As an inclusive employer, we welcome applications from everyone. We offer:Free access to Marram health care benefits and discounted holiday homes Access to Perks@Downer, which offers discounts and savings on various products, including retail items, travel deals, and entertainment optionsAll safety equipment, tools and uniforms are provided as part of the roleOpportunities for development in a supportive team, and lots of room to growTe kōwhiringa | The OpportunityDowner is an industry leader in water, providing water services to a quarter of New Zealanders. We support our customers across the full asset lifecycle from the conceptual development of a project through design, construction, commissioning and whole-of-life support and optimisation.Downer NZ has an opportunity for an experienced Serviceperson with concrete restoration experience with to join their team who operate and maintain Whangarei’s water reticulation networksA bit about you:Concrete restoration experience Strong focus on Health and SafetyA full driver's licence and class 2 HT licence preferredMinimum 2 years’ experience, preferably involved in water, wastewater and stormwaterProven experience or an interest in Water ReticulationIdeally experience working with Water Mains and Service linesTraffic management skills, TC and or STMS trained, would be an advantageCurrent confined space entry training would be an advantageA great attitude, willing to learn new skills and build a stable, safe career!Me pehea ki te tono | How to apply. If this sounds like the opportunity for you, apply nowWe are committed to a safe working environment for everyone - all successful applicants will be required to undertake a pre-employment drug test, medical and a Ministry of Justice check before starting employment. If you need support with this requirement, please talk to our team.",
    "listedSalary": null,
    "hardSkills": "Confined Space Entry Traffic Management Water Reticulation",
    "softSkills": "Adaptability Health and Safety Focus Willingness to Learn",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Excavator Operator",
    "listingDate": "Posted 1mo ago",
    "company": "ARCO Group Limited",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "About ARCO GroupARCO Group is a leading construction company with a strong reputation for delivering high-quality projects across Northland. Our vertically integrated approach ensures seamless project execution, from design to build, with a focus on innovation, sustainability, and collaboration. We specialize in the following markets:Land & building packages Design & build Commercial construction ARCO Group specialises in the following industries:Commercial construction Education Healthcare Land development The RoleWe are looking for an experienced machine operator to join our dynamic team. This role is ideal for someone who thrives in a fast-paced environment, has strong commercial acumen, and enjoys working closely with our civils team. Key ResponsibilitiesOperate diggers and other machinery for excavation, grading, and earthmoving tasksPerform high-quality finishing workAdhere to health and safety regulations at all timesWork together as a team in a team enviroment Proven experience as an operator in excavators, graders, rollers etc Willingness to muck in and put a hard day's work inWhat You’ll NeedFull, clean Class 1 licenseProven experience as an operator in excavators, graders, rollers etc Willingness to muck in and put a hard day's work inYou're passionate about what you do and genuinely take pride in a job wellWhy Join ARCO Group?Competitive salary package based on experienceCareer progression opportunities within a growing companyA supportive team environment with a strong company cultureExposure to diverse and exciting commercial projectsWork-life balance with a Northland-based role",
    "listedSalary": "We specialize in the following markets:Land & building packages Design & build Commercial construction ARCO Group specialises in the following industries:Commercial construction Education Healthcare Land development The RoleWe are looking for an experienced machine operator to join our dynamic team",
    "hardSkills": "Earthmoving Grading Class 1 license Excavator operation Health and safety compliance",
    "softSkills": "Teamwork Attention to detail Commercial acumen Passion Work ethic",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Pharmacist",
    "listingDate": "Posted 1mo ago",
    "company": "Fred Recruitment",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Excellent opportunity for an experienced pharmacist seeking a role closer to home with set days and hours.Monday to Friday with only one 1/2 Day Saturday Rotation every 3 to 4 weeks.Busy Dispensary - 600 Scripts Per Day. Option to work fixed days Tuesday to Saturday. About the StoreLocated in the heart of Whangārei, this modern pharmacy is open 6 days per week, providing easy access for the local community. The team is committed to delivering high-quality care and a wide range of services, including free prescriptions for eligible clients, walk-in vaccinations, blister packing, home delivery of medicines, and specialist health support.With a strong reputation for friendly, efficient service, the team prides itself on being welcoming, knowledgeable, and community-focused. If you’re looking for a pharmacy that supports its staff, values great service, and is passionate about improving patient care, this is a fantastic place to grow your career.Duties IncludeDeliver a high level of customer service. Prepare prescriptions accurately within the highest of healthcare standards.Oversee day to day operations of the pharmacy.Maintain and grow the specialist clinic relationships.Build rapport with local doctors and other health professionals.Counsel patients and develop strong customer relationships.Skills and ExperienceApplicants should hold a pharmacist degree & NZ registration.Possess well-developed communication skills and have the ability to build rapport and maintain strong professional relationshipsPossess the ability to fulfil all professional responsibilities and administrative tasks required of the position in an accurate and efficient manner.Be willing to comply with all pharmacy group policies & procedures.What next?If this role sounds like a bit of you, please APPLY NOW to Khalid Elazrag and I will be in touch. Ref : 796345",
    "listedSalary": "$105 - $115 k/yr",
    "hardSkills": "Clinical Knowledge Patient Counseling Pharmacy Operations Prescription Accuracy Relationship Management",
    "softSkills": "Attention to Detail Communication Empathy Professionalism Team Collaboration",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Pharmacy Technician",
    "listingDate": "Posted 1mo ago",
    "company": "Fred Recruitment",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Join a friendly, community-focused pharmacy team. Prefer being run off your feet over watching the clock? This dispensary is BUSY averaging 600 scripts per day. Monday to Friday with only one 1/2 Day Saturday rotation once a month. On-Site Parking + Support towards Professional Development.Hands-on dispensary role with a supportive, experienced crew.About the StoreLocated in the heart of Whangārei, this modern pharmacy is open 6 days per week, providing easy access for the local community. The team is committed to delivering high-quality care and a wide range of services, including free prescriptions for eligible clients, walk-in vaccinations, blister packing, home delivery of medicines, and specialist health support.With a strong reputation for friendly, efficient service, the team prides itself on being welcoming, knowledgeable, and community-focused. If you’re looking for a pharmacy that supports its staff, values great service, and is passionate about improving patient care, this is a fantastic place to grow your career.About the Role:You’ll be working alongside a dedicated team of pharmacists and technicians to ensure the smooth day-to-day running of the dispensary.Your responsibilities will include:Preparing and dispensing prescriptions accurately and efficiently.Managing stock control and dispensary inventory.Supporting pharmacists with daily operations.Providing excellent customer service and health advice when needed.Maintaining high standards of accuracy and compliance.About You:NZ qualified Pharmacy Technician (Level 4+)Pharmacy Council or Medsafe accreditation preferred.Confident working in a busy dispensary environment.Excellent communication and organisational skills.A team player with a proactive, can-do attitude.If you’re a motivated Pharmacy Technician who enjoys working in a collaborative, community-focused environment, I’d love to hear from you.Ref: 796361",
    "listedSalary": "$52 - $72 k/yr",
    "hardSkills": "Inventory Control Medsafe Accreditation Pharmacy Compliance Prescription Dispensing Stock Management",
    "softSkills": "Communication Adaptability Leadership Problem Solving Teamwork",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Resource Consent Planner",
    "listingDate": "Posted 1mo ago",
    "company": "Alexander Knight Recruitment",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Industry: Planning VacanciesThe CompanyLeading professional consultancy providing start-to-end solutions for housing, land development, subdivision and infrastructure projects.They are a well-established consultancy with highly qualified staff, state of the art technologies and procedures, and a great team working environment. Their team of 90+ staff is located across four offices in Auckland and Northland and has a proud reputation for delivering high quality services and outcomes. The RoleThey are looking for a dynamic planner to lead the planning services provided from their Whangarei office. If you are skilled in land development and want to progress your planning career up to a senior level in a consultancy that is truly focused on better land development solutions this is the job for you. Their Northland offices are in Whangarei Town Centre. From there you will be the lead planner in project managing planning inputs for some of Northlands most significant projects. The position covers a range of resource consents work, with a particular focus on residential land development and medium density-built development of all scales. Depending on your interests and skills there is also the opportunity to be involved in planning policy and plan change projects and giving evidence at hearings.About YouYou will need to be a great communicator and you will have a high level of analytical and report writing skills. The position requires at least a bachelor’s degree in planning or project management and 3+ years New Zealand planning or land development experience.You will also have:Ability to lead projectsExcellent oral and written communication skillsOutstanding attention to detailA willingness to collaborate with large teamsAbility to prioritise tasks among numerous projectsAbility to work to deadlinesThe BenefitsA career that gives the opportunity to be part of a team of professionals in a supportive work environment delivering great places. The company are committed to investing in people, provide personal development plan support and mentoring to help you grow and take the next step.They offer a friendly, flexible working environment and a salary package that is attractive and targeted at the experience and potential of the applicant.Location: Whangarei, NorthlandHours: Preferred hours are 40 hours per week Monday to Friday (flexibility an option).Benefits: Competitive Salary, subsidised employee health insurance, gym membership and the opportunity to work within a great team.",
    "listedSalary": "$80 - $130 k/yr",
    "hardSkills": "Analytical & Report Writing Project Management Resource Consent Knowledge",
    "softSkills": "Collaboration Communication Time Management",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Community Support Worker Team Lead",
    "listingDate": "Posted 1mo ago",
    "company": "Arataki Ministries Ltd",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Community Support Worker Team LeadArataki Ministries provide community mental health services in the Whangarei and Kaipara areas. We are searching for a Community Support Worker Team Lead based in our Whangarei team. As Team Leader, you will provide day-to-day guidance, mentoring, and operational oversight to our CSW team, ensuring our services are delivered with integrity, cultural responsiveness, and excellence.Key Responsibilities:• Lead and support a team of Community Support Workers to deliver high-quality, person-centred care.• Coordinate team schedules, supervision and performance development.• Foster a positive team culture grounded in collaboration, respect and accountability.• Ensures services align with Arataki Ministries Values (Manaakitanga, Aroha, Whanaungatanga, Kotahitanga & Mana), policies and Te Tiriti o Waitangi.• Encourages and supports families/whānau to participate in the recovery of clients.• Focus on service users’ strengths to support their recovery.• Coordinates and ensures all processes, documentation and wellness plans are accurate, comprehensive and current for each client.• Works effectively with the wider community and challenges stigma and discrimination.• Maintains personal and professional development.Skills & Experience:• Strong communication and relationship building skills.• Demonstrated experience in Community Support or Social Services.• Commitment to cultural competency.• Proven leadership or mentoring experience (formal or informal).• Ability to work collaboratively and manage competing priorities.• Relevant qualification in Mental Health, Social Work or Community Services (preferred but not essential).If you are interested in leading a team of experienced Community Support Workers, being an integral part clients' recovery journeys and fostering a positive and open working environment, please apply or send your cover letter and CV to Kyla - kylaf@aratakimin.co.nzApplicants for this position must have NZ Residency for full working rights.Applications close 5pm 26th November, 2025.",
    "listedSalary": "$31 - $36 /hr",
    "hardSkills": "Documentation Service Coordination Community Support Cultural Competency Team Leadership",
    "softSkills": "Communication Accountability Mentoring Collaboration Relationship Building",
    "RoleLevel": "Team Lead"
  },
  {
    "title": "Project Manager/Quantity Surveyor",
    "listingDate": "Posted 1mo ago",
    "company": "Northland Interiors Limited",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Senior Quantity Surveyor / Project Manager – Northland InteriorsWe Transform Spaces - work in Northland's leading commercial interiors company.At Northland Interiors, we’re the company main contractors want to work with as we redefine what’s possible in interior fit-outs and offer clever and cost effective solutions — blending innovation, precision, and design-led thinking to deliver premium commercial spaces on time and on budget across Northland. As part of a high-growth group of trade and construction companies, we’re looking for a Senior Quantity Surveyor / Project Manager who’s ready to support and lead projects from concept to completion and make a lasting impact on our region’s built environment.The RoleThis is a hands-on position where you’ll manage the full project lifecycle — from tendering and estimating through to delivery and final account. You’ll work closely with clients, designers, subcontractors, and our internal trades teams to deliver outstanding outcomes, on time and on budget. Every day brings variety: managing costs, forecasting, procurement, and ensuring seamless site coordination across multiple projects.What You’ll BringProven experience in quantity surveying and/or project management ideally within commercial interiors, fit-out, but all types of construction and/or subtrades will be consideredStrong commercial acumen and attention to detailConfidence leading multi-disciplinary teams and managing client relationshipsDrive to innovate — using modern systems and smarter ways of workingA collaborative mindset with a passion for delivering quality and efficiencyWhy Northland Interiors?Be part of a progressive, design-focused company backed by one of Northland’s most exciting construction groupsWork on diverse and architecturally driven commercial projectsGenuine career growth opportunities across our wider group of companiesA supportive, energetic team that values initiative and innovationIf you’re ready to bring your expertise to a company that’s building more than spaces — we’re building the future of Northland’s interiors — we’d love to hear from you.📍 Location: Whangārei, Northland📧 Apply Now: Send your CV and cover letter to sarah@northlandinteriors.co.nz",
    "listedSalary": null,
    "hardSkills": "Project Management Procurement Quantity Surveying Cost Forecasting Tendering",
    "softSkills": "Collaboration Team Leadership Attention to Detail Client Relationship Management Innovation",
    "RoleLevel": "Senior"
  },
  {
    "title": "Support Worker",
    "listingDate": "Posted 1mo ago",
    "company": "IDEA Services",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "74.5 hours per fortnightMainly awake night shifts 9pm to 7am$23.84-$29.10 per hour depending on relevant qualifications Mō te tūnga | About the roleIDEA Services is committed to empowering people with intellectual disabilities to live fulfilling, meaningful lives—both in the comfort of their own homes and as active, valued members of their communities. As a Support Worker, you'll be providing overnight support to individuals with complex needs, ensuring their safety and wellbeing while promoting dignity and independence. This includes managing risk, responding to individual care plans, and offering compassionate, person-centred support throughout the night. Your presence will provide reassurance and continuity of care, helping each person feel secure and respected.Check out our website to learn more: Become a Support WorkerNgā pūmanawatanga ōu | What you will bringPrevious experience as a Support Worker is preferred, but more importantly, we are looking for someone with a positive attitude and compassion.Flexibility to work rostered shifts.A calm nature and confidence to work with challenging behaviours.Comfortable and proficient in using computers and tablets daily.Strong written and verbal communication skills.Physical fitness to provide necessary physical support.A Full NZ driver's license Nōu te rourou | What's in it for you?$23.84-$29.10 per hour depending on relevant qualifications, with the ability to earn more as you gain qualifications.IDEA Services will support you towards completion of the Level 2, 3 and 4 Certificates in Health and Wellbeing qualifications.Generous long service leave entitlements plus insurance benefits after 2 years' service.'Refer a friend' Bonus programme.FREE Employee Assistance programme service anytime you need health and wellbeing support. Mō mātou | About usIDEA Services supports adults with intellectual disabilities to live in their own homes and enjoy life as part of their communities. We are New Zealand's largest provider of services to people with intellectual disabilities and their families. Our services are founded on IHC's utter commitment for people with intellectual disabilities to have a good life and to be valued contributors to and members of their own community. IDEA Services Ltd is an accredited Immigration AEWV employer.The IHC Group is committed to Te Tiriti o Waitangi and actively seek a diverse applicant pool. We encourage candidates of all backgrounds to apply. We welcome all kinds of diversity and the different perspectives such diversity brings to our work.Me pēhea te tuku tono | How to ApplyThe first step is to submit an online application by selecting the 'Apply' button. As part of the application process you will be required to provide an up-to-date CV outlining your previous experience. We are unable to discuss your suitability for the role until we have received your application. If you have any questions about the application process or specific queries about the position, please use the contact details below to speak to recruitment.Applicants can direct enquiries about position to:Taylor Spence - Recruitment Advisortaylor.spence@ihc.org.nz",
    "listedSalary": "$23 .84 - $29 .10/hr",
    "hardSkills": "Computer Proficiency Personal Care Physical Support Report Writing Risk Management",
    "softSkills": "Calmness Communication Non-Judgemental Patience Relationship Building",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Residential Community Support Worker",
    "listingDate": "Posted 1mo ago",
    "company": "Arataki Ministries Ltd",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Community Support WorkerArataki Ministries provide community mental health services in Whangarei and Kaipara area. We have a full-time vacancy to join our growing team working as a Community Support Worker, based in our Whangarei team. The job entails supporting people with mental health and/or addiction issues to live well in the community. In other words; walking alongside people to live a meaningful and satisfying life.The successful applicant will have: Have passion and empathy for working with peopleCompleted the Certificate in Mental Health and Addictions (L4) or equivalent or have experience in the mental health and addiction field.Be resilient and available to work AM, PM & overnight shifts.Have common sense and able to work as a member of the team and autonomously.Have experience in or have a desire to work with people with mental health and addiction issues.Have good communication skills; verbal and written.Have good IT skills.Have a Full and clean driver’s licence.Have a clear police record.To apply for this position: A current CV and a cover letter should be emailed to Kyla - kylaf@aratakimin.co.nz or apply through Zeil.Applicants for this position must have NZ residency or a valid NZ work visa. Applications close 5pm 26th November 2025",
    "listedSalary": "$26 - $31 /hr",
    "hardSkills": "Communication Skills Addiction Support Driver's Licence IT Skills Mental Health Knowledge",
    "softSkills": "Teamwork Autonomy Common Sense Empathy Resilience",
    "RoleLevel": "Associate"
  },
  {
    "title": "Civil Engineer",
    "listingDate": "Posted 1mo ago",
    "company": "Alexander Knight Recruitment",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "The CompanyIs a New Zealand owned company, renowned for their innovation with a network of offices across NZ. Very well established, their team of technical experts provide services to local and national clients. This is a fantastic opportunity to take the next step in your career and work on large-scale projects in a supportive and empowering team environment.The RoleMeet with clients and collaborate with the team to provide solutions to enable excellent project delivery.Undertake projects and build your skills in contributing to the consenting process.Work on land development projects with a great team.Contribute to contract administration and supervision.Actively engage in business development with current and new clients to enhance the company’s future project prospects.About You4 years + of experience in engineering consultancy.Good understanding of NZ design codes, standards, and legislation.Experience in construction monitoring and management of 3910 contracts.Experience with 12d, and AutoCAD (Civil 3D) preferred but not essential.Experience in NZ or Australia land development and/or commercial projects.Good understanding of civil design principles in stormwater, wastewater, water supply, earthworks/finished levels and pavements.Developing CAD skills - knowledge of either AutoCAD, 12D and Landonline.A real enthusiasm for civil engineering and land development projects.Relevant tertiary qualification and be committed to professional development.The BenefitsWork with industry leading engineering professionals across a multitude of disciplines. Health and wellness benefits to support both the physical and mental well-being of employees.Receive sponsored CPD hours, sponsorship opportunities, and the chance to attend seminars and training events as part of your career development.Join a team dedicated to fostering an environment where curiosity is encouraged, and where every team member has the chance to reach their full potential.Support with professional memberships.Industry-competitive salary.Opportunity to travel domestically and visit stunning locations.Free fruit, coffees, and morning teas.Staff social functions, company functions and Friday drinks!",
    "listedSalary": "$85 - $120 k/yr",
    "hardSkills": "Civil Design (12D, AutoCAD) Construction Monitoring Contract Administration (NZS 3910) Project Management Understanding of NZ Standards & Legislation",
    "softSkills": "Adaptability Business Development Client Collaboration Curiosity and Initiative Enthusiasm for Engineering",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Retail Manager",
    "listingDate": "Posted 1mo ago",
    "company": "Bay Surf Company Limited",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "With an extensive collection of iconic global brands & home grown goodness, the crew at Modern Collective are passionate about fashion and handpick products & garments that have attitude. We’re big on customer service and helping people find exactly what make them look and feel good.We are looking for an experienced, and motivated manager to join our retail team. Our ideal candidate will demonstrate strong initiative, cultivate a productive team environment, and have the ability to achieve and exceed sales budgets. Excellent communication and customer service skills, creative flare, and a passion for fashion. Staff will need to be flexible and available to work weekends, as well as during busy holiday periods.We are looking for a mature, like-minded person to join our enthusiastic and highly productive team.The right person will have solid retail experience, a passion for sales and providing superior customer serviceBe a strong communicator, who is both self-motivated and a team playerIs reliable, hardworking and shows initiative and accountabilityYou will be responsible for implementing daily instore operations;Delivering a high level of Customer Service Achieving and exceeding Sales Targets and KPIs Loss prevention and store security Inventory Management and Ordering Staff Training Visual MerchandisingModern Collective has a strong culture, that recognises contributions and rewards performance. For the right person we offer competitive remuneration, sales incentives, product discounts and have plenty of opportunities for career development.All applications need to include a cover letter explaining why they are the right person for the role and what skills and experience sets them aside from othersIf you think you've got what it takes to join this fun and successful team, we can't wait to hear from you!",
    "listedSalary": "The right person will have solid retail experience, a passion for sales and providing superior customer serviceBe a strong communicator, who is both self-motivated and a team playerIs reliable, hardworking and shows initiative and accountabilityYou will be responsible for implementing daily instore operations;Delivering a high level of Customer Service Achieving and exceeding Sales Targets and KPIs Loss prevention and store security Inventory Management and Ordering Staff Training Visual MerchandisingModern Collective has a strong culture, that recognises contributions and rewards performance",
    "hardSkills": "Staff Training Visual Merchandising Customer Service Inventory Management Sales Targets",
    "softSkills": "Accountability Reliability Communication Teamwork Initiative",
    "RoleLevel": "Team Lead"
  },
  {
    "title": "Intensive Wraparound Facilitator - Te Kahu Tōī",
    "listingDate": "Posted 1mo ago",
    "company": "Barnardos",
    "location": "Whangārei",
    "employmentType": "Contract, Temp",
    "description": "Are you autonomous practitioner?Can you progress plans toward a better outcome?Do you enjoy the challenge of complex situations?Barnardos and the Ministry of Education (MOE) deliver the Intensive Wraparound Service (IWS) which works with students who have complex behavioural needs (which may include intellectual impairment). You will be working with the student and family/whānau to engage them in the IWS process and support them and the IWS team to develop and monitor plans.This is a 12-month fixed term, full time (40 hours per week) position based in Whangārei, and will require travel. This role can be challenging but is also extremely rewarding and is a vital part of our work to make Aotearoa a better, safer, happier place for Tamariki. Your Role:To orient the students and family/ whānau to the wraparound process and provide co-ordination of key team members.Support the development of a plan with agreed outcomes for the family/whānau, and to monitor and record the progress of these outcomes.Develop and maintain strong and collaborative relationships with the family/ whānau, Ministry of Education Learning Support and other groups to ensure a coordinated wraparound service.Produce timely and accurate documentation to support the Intensive Wraparound Service’sWhat You'll Bring: A tertiary qualification in social work or other relevant qualification.Proven experience working with children, families/whānau and Māori and Pacific communities.To value diversity and encourage it in others, especially when working with children with high and complex needs and their families.The ability to work autonomously and manage competing priorities.Excellent communication, organisation and meeting facilitation skills.The ability to build strong professional relationships and champion the perspective of the student and their family through the IWS process.Resilience and a clear understanding of your own self-care needs and when to practice them.A clean, full NZ driver’s licence (travel across the region will be required).CultureThis work can sometimes be challenging. You will need resilience and a passion for working with youth, be flexible, have a positive attitude, and exhibit the ability to build strong professional relationships with young people, whanau/families, staff, and service providers. A comprehensive induction programme is undertaken with ongoing education, training, and support offered to all staff.Embody Our ValuesKotahitanga (Unity): Cultivate a sense of belonging through meaningful relationships with tamariki, rangatahi, colleagues, and the wider communityMahi Tōtika (Excellence): Demonstrate unwavering integrity and purpose in all aspects of your work, striving for the highest standards of careKaikōkiritanga (Innovation): Drive positive change with creativity, constantly seeking new and effective ways to support tamariki and rangatahiĀta Whakarongo (Active Listening): Let tamariki and rangatahi voices shape your approach, ensuring their perspectives are central to decision-makingMāiatanga (Empowerment): Nurture growth and unlock potential in tamariki, rangatahi, and colleagues, fostering a culture of continuous learning and developmentWhy Choose Barnardos?Be at the forefront of trauma-responsive youth care in New Zealand, contributing to groundbreaking programsJoin a respected NGO with over 55 years of impact in child welfare and advocacyAccess ongoing professional development opportunities, including specialized training in trauma-informed practices and the latest youth care methodologiesEnjoy family-friendly policies, including flexible work arrangements where possibleBenefit from discounted childcare at Barnardos Early Learning centersCompetitive salary commensurate with experience and qualificationsSupportive team environment with regular supervision and peer supportOpportunity to make a lasting difference in the lives of vulnerable young peopleAbout Barnardos: For over 55 years Barnardos has been shaping brighter futures together with children and families in Aotearoa. Our mahi across social services, early learning and advocacy for children’s rights and wellbeing means we're there for the whole childhood journey, and beyond.If you would like a copy of the position description, or have any questions, please email recruitment@barnardos.org.nz.This role closes on 28 November, however we will review applications and commence interviews as they are received so it may close early if a suitable candidate is found.",
    "listedSalary": "This role can be challenging but is also extremely rewarding and is a vital part of our work to make Aotearoa a better, safer, happier place for Tamariki",
    "hardSkills": "Case Coordination Documentation Facilitation Reporting Social Work",
    "softSkills": "Communication Cultural Awareness Empathy Relationship-Building Resilience",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Drainlayers and Earthworks Operators - Experienced",
    "listingDate": "Posted 1mo ago",
    "company": "Mako Civil Contracting",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Who are we?Mako Civil Contracting is a drainage and earthworks company based in Whangarei delivering successful projects across the Civil, Residential, Commercial and Industrial sectors .What's the opportunity? In order to support our growing work load we are looking for Certified Drainlayers, Experienced Drainlayers, and experienced heavy machinery operators to join our team. Our ideal candidates will have the following:- Certified Drainlayer ticket / or be experienced in drainlaying and the operation of heavy machinery - diggers ranging in sizes, bobcats, padfoot etc.- Industry experience in Civil drainlaying or earthworks- A Class 1 full license- A class 2 license with WTR licence is preferred but not essential- Physically fit- Able to work unsupervised- Able to set up job sites- work within a team- Read plans and identify steps to running job smoothly and execute them- Positive attitude, with the ability to be a team player-Commitment to safety-Willingness and ability to travel to different sites in Whangarei area as required-Undertake pre employment drug testing and medicalIt is an exciting time to be part of the team, with continued growth, improvements and awesome success stories happening all over the show! Our DifferenceWe have diversity across multiple sectors.We are a NZ-owned family business.We have a great company culture and we care.We are progressive.We offer annual bonusesWe offer a competitive pay rate and this is negotiable and dependent on the successful candidate’s experience.This role is ideal for someone that can work in a team, use their initiative, and can get the job done. The right candidate will have own work vehicle, phone, and appear presentable.If this sounds like you – please feel free to email your Cover Letter and CV to Mark Jelicich mark@makocivil.com or call on 0210565332",
    "listedSalary": "We offer annual bonusesWe offer a competitive pay rate and this is negotiable and dependent on the successful candidate’s experience",
    "hardSkills": "Certified Drainlayer Class 1 License Heavy Machinery Operation Plan Reading Site Setup",
    "softSkills": "Teamwork Ability to Work Unsupervised Physical Fitness Positive Attitude Safety Commitment",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Senior Sous Chef required for The Quay",
    "listingDate": "Posted 1mo ago",
    "company": "The Cove Cafe Restaurant and Bar",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Job SummaryThe creators of four iconic eateries all in Northland are looking for a new Senior Sous Chef for its flagship restaurant The Quay based in Whangarei right on the Marina and one of Cuisine Magazine's top 200The employing company The JD Boys Ltd is looking for someone who is fantastically talented charismatic, energetic and experienced who has experience with high volume restaurants.The owners will work alongside you and together with the Head Chef will work on new menus and daily specials. You need to be a good communicator, a good trouble shooter and above all be creative. We need all our kitchens to be world class and the food that is produced needs to be the same. Make no mistake I want somebody phenomenal to work in my company and that is why I will be offering an extremely good package for the right candidate. We are a busy company so during the Summer months it will be all hands on deck. Stability and creativity are the name of the game and it is important that you work alongside the current owners to steady the ship. This is a serious position so please do not apply if you are not of the right caliber and possess the necessary experience. Accommodation is available to assist with your move and expedite your start date. Pay range is $38$-$42 per hour.Hours = minimum 40 per week and maximum 60 per week.What we expect:Ensure the excellent reputation of the kitchen at all timesCreativity, creativity creativity !!!Great people skillsThe ability to mentor, encourage and challengeHealth and Safety awarenessAbove all support the owners with their passion and their visionWhat you will need:At least 5 years experience as a chef with at least 3 of them as a Sous Chef. be able to work flexible hoursA cool head for those busy periodshelp lead a large teamcreative and inspirational menusInspire the Head Chef to do their jobs wellSo if you would like to live in the winterless North and take advantage of the East Coasts stunning beaches and laid back lifestyle then apply for a position of Senior Sous Chef for the Jetson Group where you really can have it all, a fulfilling job, excellent career prospects combined with the opportunity to achieve the lifestyle we only dream about!",
    "listedSalary": "$38 - $42 /hr",
    "hardSkills": "Food Preparation Menu Development Health and Safety High Volume Cooking Team Leadership",
    "softSkills": "Communication Teamwork Mentoring Creativity Stress Management",
    "RoleLevel": "Senior"
  },
  {
    "title": "Accounting Intermediate Opportunity",
    "listingDate": "Posted 1mo ago",
    "company": "Sumpter Baughen",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Join Our Team as an Intermediate Accountant – Whangarei OfficeAt Sumpter Baughen, we’re more than just accountants, we’re partners in our clients’ success. With offices in Whangarei, Kerikeri, and Ruawai, we combine innovation, relationship-building, and strategic support to help businesses grow.We’re currently seeking an intermediate accountant to join our Whangarei team. This is a fantastic opportunity to work in a progressive, best-practice-focused firm that values your ideas and supports your professional development.What you’ll Be Doing- Preparing financial statements, tax returns and other IRD returns- Working closely with clients to support all aspects of their business- Managing your own workflow and deadlines- Working as part of our fun, experienced and dynamic team of over 30 employees to deliver accounting excellenceWhat we offer- A diverse client base: From sole traders to multi-million-dollar entities, not-for-profits, trusts and more- Competitive Remuneration: A package that reflects your skills and experience, plus study support including course fees and time off for study and exams- Professional Growth: Ongoing training and development opportunities to help you advance your career- Work-Life Balance: We understand that life happens outside of work and offer flexible working arrangements including remote work options, flexible hours, and glide time — so you never miss those important family or school events- Inclusive Culture: A progressive and supportive environment with opportunities to contribute to innovation and continuous improvement, where your ideas are valued and you can make a real impact- Modern Workspace: A contemporary office with the latest equipment including standing desks- Awesome Team: A vibrant, supportive and collaborative team culture with regular social events and activitiesWhat We’re Looking For- A relevant, NZQA-recognized accounting degree or at least 18 months of experience working in a Chartered Accountants office- A strong work ethic, enthusiasm, and willingness to learn- A people person who enjoys working with clients and teammates- A natural attention to detail and a drive to deliver outstanding service- Strong communication and time management skills- An interest in ITReady to Join Us?If you're looking for a new challenge with a well-established firm, a better work-life balance, or simply want to be part of a close-knit team, we’d love to hear from you!Applicants must be NZ residents or hold a valid NZ work visa.To apply, please send your CV and cover letter. We can't wait to meet you!",
    "listedSalary": "What you’ll Be Doing- Preparing financial statements, tax returns and other IRD returns- Working closely with clients to support all aspects of their business- Managing your own workflow and deadlines- Working as part of our fun, experienced and dynamic team of over 30 employees to deliver accounting excellenceWhat we offer- A diverse client base: From sole traders to multi-million-dollar entities, not-for-profits, trusts and more- Competitive Remuneration: A package that reflects your skills and experience, plus study support including course fees and time off for study and exams- Professional Growth: Ongoing training and development opportunities to help you advance your career- Work-Life Balance: We understand that life happens outside of work and offer flexible working arrangements including remote work options, flexible hours, and glide time — so you never miss those important family or school events- Inclusive Culture: A progressive and supportive environment with opportunities to contribute to innovation and continuous improvement, where your ideas are valued and you can make a real impact- Modern Workspace: A contemporary office with the latest equipment including standing desks- Awesome Team: A vibrant, supportive and collaborative team culture with regular social events and activitiesWhat We’re Looking For- A relevant, NZQA-recognized accounting degree or at least 18 months of experience working in a Chartered Accountants office- A strong work ethic, enthusiasm, and willingness to learn- A people person who enjoys working with clients and teammates- A natural attention to detail and a drive to deliver outstanding service- Strong communication and time management skills- An interest in ITReady to Join Us?If you're looking for a new challenge with a well-established firm, a better work-life balance, or simply want to be part of a close-knit team, we’d love to hear from you!Applicants must be NZ residents or hold a valid NZ work visa",
    "hardSkills": "Financial Statements Accounting Degree IRD Returns Tax Returns Time Management",
    "softSkills": "Communication Attention to Detail Client Service Enthusiasm Work Ethic",
    "RoleLevel": "Associate"
  },
  {
    "title": "Territory Manager (Beef Market, Northland)",
    "listingDate": "Posted 1mo ago",
    "company": "Halter",
    "location": null,
    "employmentType": "Full Time",
    "description": "About the roleFarmers with Halter are writing the playbook for a world-first farming system, they are paving a new way of managing their land and animals, and in doing so, are unlocking more productive and sustainable uses of the world's agricultural land along with driving optimal profitability outcomes.We've recently launched into the Beef Market! This is an opportunity to build a new market from the bottom up. The Beef industry has not had a disruptive and influential product in years and this is your chance to make a huge impact.As a Territory Manager at Halter, you will play a critical role in driving business growth and ensuring customer success within your designated territory. You will be responsible for executing sales strategies, building strong customer relationships, and meeting ambitious growth targets, all while acting as Halter’s on-the-ground representative. This role requires a proactive and hands-on approach, with a focus on both expansion and long-term customer satisfaction.In this role, you will prioritise daily efforts that optimise growth performance and drive value for your customers. Working closely with cross-functional teams, including Product, Support, and other regional sales teams, you’ll share field insights to ensure Halter’s technology continues to meet the needs of farmers. Your contributions will directly support Halter’s mission to support 50% of the world's habitable landmass to be more productive and sustainable.This role would ideally be located anywhere in the Northland region. Frequent travel is required as part of the position.Who are we looking for - these skills are essential for this role and reflect how we operate every day. We expect applicants to demonstrate evidence of these requirements in their resume, cover letter and interviews.Attitude: You naturally play for the front of the jersey. Make those around you better. Thrive under pressure and own your results. You bring authentic energy and passion to every interaction.Sales & Customer Success Expertise: You will be a high-performing value-based salesperson, with a strong history of creating opportunities, closing deals, and building lasting customer relationships. You understand post-sales value building and have experience upselling to grow partnerships.Beef Industry Experience: You know the ropes of beef operations, understanding the unique challenges of the industry. If you don’t, you will be deeply passionate about it, and willing to dive deep into the operations of a farm to learn rapidly.Territory Management: Able to use critical thinking to manage a large territory with a balanced focus on sales and customer success, making the appropriate trade-offs.Problem Solving & Collaboration: Resourceful and quick-thinking, you work well with cross-functional teams to address challenges and drive solutions.Willingness to Travel: Frequent travel within your territory to engage with customers and prospects.What your day could look likeProspecting & Expansion: Sourcing new leads and opportunities through proactive outreach, referrals, industry events, and other channels, as well as responding to inbound queries. You’ll manage the full sales pipeline from lead generation through to close.Hitting Sales Targets: Manage your pipeline and meet high-growth sales targets by screening, qualifying, demonstrating the product, and successfully negotiating contracts with customers.Customer Account Management: After the sale, maintain close relationships with customers to ensure their ongoing satisfaction, provide support, and address any challenges they face with Halter’s products. You’ll also ensure a smooth handoff from sales to customer onboarding and deployment of Halter, helping customers get the most value from Halter’s solutions.Territory Ownership: A high level of ownership in your territory working with regional agricultural groups to foster deep relationships across the beef industry.Customer Onboarding: Assist in owning the end-to-end customer experience during onboarding and deployment of Halter’s product, ensuring a smooth transition from sales to implementation.Field Learnings & Feedback: Serve as the primary point of contact for gathering customer feedback in your territory. Work closely with Support, Product, and R&D teams to share insights from the field that can drive product improvements and innovations.Collaborating with Support Teams: Partner with the Support Team to resolve any issues your customers encounter quickly. You’ll escalate problems as needed and ensure that customers in your territory feel fully supported.Why our team loves working at HalterEvery now and again a company comes along that disrupts and transforms an entire industry, leaving society in a better place. Few people get the opportunity to work at companies like these. Halter is an incredible technology transforming an essential industry. We have a genuine and shared connection to our mission to make a difference in the world.Our product changes the lives of our customers, directly improving their livelihoods and their lifestyle. Your work matters.Dedicate yourself to solving real-world problems alongside an epic team in a high-growth culture. The excitement, risk and reward of a high-growth technology scale-up on the global stage. Our ideas are truly valued, we are able to move fast, and our impact is real.Delicious snacks and drinks are available for your daily flow.Healthy body, healthy mind. We’re partnered with Southern Cross Health Insurance to support your well-being.We offer 6 months of fully paid parental leave for primary caregivers, 4 weeks of fully paid secondary caregiver leave and many other parental benefits that support you and your family.Our personal growth is important. Halter offers an annual $1000 self-development budget to be used for anything that fuels personal growth.Our time to recharge is valued, we’re offered wellness leave and unlimited paid annual leave.Importantly, we offer an inclusive and attractive remuneration package made up of salary, benefits and an employee stock ownership plan.About Halter At Halter, we’re on a mission to enable farmers and graziers to run the most productive and sustainable operations. Our customers are using Halter to break free from the time-intensive constraints of conventional practices. Imagine watching 500 cattle stand up and walk calmly towards their next break? No quad bikes, no dogs, no fences. Just a group of cattle walking at their own pace. People say it looks like magic. Our customers are revolutionizing grazing with Halter. It's changing lives and transforming an industry. People join Halter to do meaningful work. By joining us you’ll be solving challenging problems within a talented team and a culture built for high performance. Our team out-think, out-work and out-care. We’re committed to delivering real change in the world - this isn’t easy, and in truth, we love that it’s hard. We’re backed to deliver on a mission that matters by Tier 1 investors including Bessemer Venture Partners, DCVC, Blackbird, Promus Ventures, Rocket Lab’s Peter Beck and Icehouse ventures. To find out more, visit our careers website, LinkedIn & Instagram. Join our team Halter is committed to promoting a diverse and inclusive workplace — a place where we can each be ourselves and do the best work of our lives. Research shows that while men apply to jobs when they meet an average of 60% of the requirements, women and under-represented groups of candidates tend to only apply when they meet every requirement. If you think you have what it takes but don’t necessarily tick every requirement on this job description, please still get in touch and apply to Halter. We’d love to chat to see if you’ll be an epic fit! If this opportunity sounds like you, please apply below by sending through your cover letter explaining why you’re excited about this role and working at Halter, along with your CV, and we’ll be in touch! Please also feel free to check out the careers page for more information on working at Halter and don't forget to follow us on LinkedIn & Instagram.About HalterAt Halter, we’re on a mission to enable farmers and graziers to run the most productive and sustainable operations. Our customers are using Halter to break free from the time-intensive constraints of conventional practices. Imagine watching 500 cattle stand up and walk calmly towards their next break? No quad bikes, no dogs, no fences. Just a group of cattle walking at their own pace. People say it looks like magic. Our customers are revolutionizing grazing with Halter. It's changing lives and transforming an industry. People join Halter to do meaningful work. By joining us you’ll be solving challenging problems within a talented team and a culture built for high performance. Our team out-think, out-work and out-care. We’re committed to delivering real change in the world - this isn’t easy, and in truth, we love that it’s hard. We’re backed to deliver on a mission that matters by Tier 1 investors including Bessemer Venture Partners, DCVC, Blackbird, Promus Ventures, Rocket Lab’s Peter Beck and Icehouse ventures.To find out more, visit our careers website, LinkedIn & Instagram.Join our teamHalter is committed to promoting a diverse and inclusive workplace — a place where we can each be ourselves and do the best work of our lives. Research shows that while men apply to jobs when they meet an average of 60% of the requirements, women and under-represented groups of candidates tend to only apply when they meet every requirement. If you think you have what it takes but don’t necessarily tick every requirement on this job description, please still get in touch and apply to Halter. We’d love to chat to see if you’ll be an epic fit!If this opportunity sounds like you, please apply below by sending through your cover letter explaining why you’re excited about this role and working at Halter, along with your CV, and we’ll be in touch!Please also feel free to check out the careers page for more information on working at Halter and don't forget to follow us on LinkedIn & Instagram.",
    "listedSalary": "The excitement, risk and reward of a high-growth technology scale-up on the global stage",
    "hardSkills": "Beef Industry Knowledge CRM Systems Customer Success Sales Strategy Territory Management",
    "softSkills": "Adaptability Communication Negotiation Problem-Solving Relationship Building",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Receptionist",
    "listingDate": "Posted 1mo ago",
    "company": "Whangarei Physio and Hand Therapy",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "Receptionist at Whangarei Physio and Hand Therapy.Whangarei Physio and Hand Therapy aims to improve our client’s physical function, health and quality of life by providing top quality Physiotherapy, Hand Therapy and gym-based rehabilitation in Whangarei.We are a well-established business of 14 staff and aim to provide a welcoming environment which is healthy, positive, and which nurtures personal growth of our staff and clients. Our team values are as follows:AcceptanceCommunicationLeadershipProfessionalismPromotionTeamworkThe role:This is a full-time position. The role involves working as a receptionist at both our Kamo Clinic and Kensington Clinic locations and shifts can include hours with the Kamo clinic opening early from 7am some days and closing late at 7pm some days. The position is ongoing with a start date of the 5th of January 2026.The key tasks include:Providing a friendly, efficient, and welcoming environment for clients. Appointment booking, requiring accurate and timely data entry for clinic registration as well as billing for services and taking payments.Good communication with office manager, reception team and clinical staff along with support for day to day running of the clinic.The main responsibilities of this role are:Providing information to potential clients about our service.Taking appointment bookings and entering into Gensolve computer program.Accessing information from ACC and other providers.Greeting and registering clients, taking payments, billing and on booking.Ensuring clinics are kept tidy and run efficiently.About you:You will be a team player and have positive attitude and good communication skills. You will be reliable and trustworthy and work well in a team environment. Some computer skills are essential with experience in customer service and/or reception work being ideal. What we offer:A reliable, and supportive environment that makes a hugely positive difference in the quality of life of our clients. We will provide training in the role along with using Gensolve.www.whangareiphysio.co.nz",
    "listedSalary": "Appointment booking, requiring accurate and timely data entry for clinic registration as well as billing for services and taking payments",
    "hardSkills": "Data Entry Computer Skills Appointment Booking Billing Payment Processing",
    "softSkills": "Communication Teamwork Reliability Positive Attitude Trustworthiness",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "STMS",
    "listingDate": "Posted 2mo ago",
    "company": "Downer New Zealand",
    "location": "Whangārei",
    "employmentType": "Full Time",
    "description": "About UsAt Downer we plan, create and sustain. Downer is the leading provider of integrated services in Australia and New Zealand. Through trusted relationships and world leading insight we work closely with our customers to design, build and sustain assets, infrastructure, and facilities. About the TeamDowner’s Transport & Infrastructure business manages and maintains road networks across Australia and New Zealand, with civil and commercial construction in New Zealand. We are an integrated trans-Tasman team with a leading portfolio of products and services. By sharing our capabilities and insights across our regions we achieve the best technical solutions for our customers’ challenges, and for our communities.Job DescriptionKo te take ka parekareka e koe ki te mahi ki kōnei | Why you will enjoy working hereAt Downer, We Pride Ourselves On Our Commitment To Safety, Innovation, And Excellence In Everything We Do. Joining Our Team Means Becoming Part Of a Company That Values Its People And Supports Their Growth And Development. We OfferRewarding pay Opportunities for Career Progression across NZ and AustraliaComprehensive Training and DevelopmentHealth care and Wellbeing benefitsWhanau Scholarships$500 bonus for current employees who refer a friend to DownerTe kōwhiringa | The OpportunityDowner remains at the forefront of our industry by employing the best people and having the courage to challenge the status quo. Here’s your chance to join the Kaikohe team where we take pride in taking on projects, big and small and delivering them to world-class standards - every time!As an STMS, you will ensure the accurate following of temporary traffic management plans and oversee set up and pack down of road closures and diversions.You will be confident leading toolbox and closure briefings with crew, whilst providing clear job details and expectations to TMO’s.Willing and able to train and upskill our and junior STMS’Ensure the safety of the Downer crew, subbies, and the general publicThis is a permanent, Full Time position, based in Kaikohe - Far North. We offer a minimum of 40 work hours per week with penal rates available.Nga pūkenga matua | Important SkillsYou will be a physically fit and motivated person and will bring with you.A valid STMS warrant (be it A/B or Level 1/2) is desirable, but open to individuals with TMO qualificationsBe physically fit and able to carry out manual tasksFlexibility and adaptability is required due to the outdoor nature of the roleShow commitment to safe work practisesMe pēhea ki te tono | How to applyIf you are ready to take on a new challenge and contribute to the smooth operation of traffic systems across New Zealand, we invite you to apply!Please click apply now below and upload your CV and a brief cover letter outlining your relevant experience and why you are interested in joining Downer NZ.We are committed to a safe working environment for everyone - all successful applicants will be required to undertake a pre-employment drug test, medical and a Ministry of Justice check prior to starting employment. If you need support with this requirement, please talk to our team.Downer Group is an employer that acknowledges and embraces the importance of our people's diverse experiences, talents, and cultures. As an inclusive employer, we welcome applications from everyone.",
    "listedSalary": "We OfferRewarding pay Opportunities for Career Progression across NZ and AustraliaComprehensive Training and DevelopmentHealth care and Wellbeing benefitsWhanau Scholarships$500 bonus for current employees who refer a friend to DownerTe kōwhiringa | The OpportunityDowner remains at the forefront of our industry by employing the best people and having the courage to challenge the status quo",
    "hardSkills": "Driver’s Licensing Road Maintenance Safety Compliance STMS Certification Traffic Management",
    "softSkills": "Adaptability Attention to Detail Communication Problem-Solving Teamwork",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Healthcare Assistant",
    "listingDate": "Posted 1mo ago",
    "company": "Radius Care",
    "location": "Whangārei",
    "employmentType": "Casual",
    "description": "Looking for flexible work that makes a real difference? Join R-Connect as a casual Healthcare Assistant and pick up shifts that suit your schedule.Location: Various aged care facilities in the Whangarei regionHours of work: Casual on-call (confirmed prior to each assignment)About the role:As a Healthcare Assistant for R-Connect, you will be deployed to complete temporary assignments across various aged care facilities in this region.As this is a casual role, you will be prompted when a temp vacancy is available, and you can accept based on your availability.You need to be a New Zealand Citizen/Resident, or have open work conditions.You must have a current NZ Driver's License.Duties include:Reporting to the charge nurse and completing delegated tasks in a timely mannerResidents' personal care tasks, i.e. hygiene, grooming, toileting, shaving, brushing of teeth and hairMobilising residentsSkills and Experience:New Zealand Certificate in Health and Wellbeing Level 3 or 4 (or equivalent)Aged care experience requiredPeople skills with empathy for the elderly and their familiesGood written and verbal communication skillsFlexibility to work on a rostered shift basisApply now!Healthcare Assistant - Casual (Whangarei) - Radius CareR-Connect specialises in placing Healthcare Professional in aged care organisations across New Zealand for temporary assignments.R-Connect supports equality and diversity in our workforce. We are committed to providing equal employment opportunities, development of your career pathway, and a safe and healthy work environment. We welcome all applicants, regardless of gender, ethnicity, marital status, age, disability, sexual orientation, and religious beliefs; we value the experience that you will bring to our organisation.E kaha tautoko ana a R-Connect i te ōritetanga, me te kanorau ā ō tātou nei kaimahi. E pirihonga ana mātou ki te whakaroto i ngā whiwhinga mahi whakaōrite, me te whakawhanake i tō umanga ngaio. Āno hoki, kia haumaru, kia hauora hoki tō tātou whaitua mahi. Tēnei te mihi maioha ki a kōutou, ngā kaitono kātoa. Āhakoa nō hea koe , āhakoa te pakeke , tō ira tangata rānei. E whai tīkanga ana tō tātou nei rōpu whakahaere, i ngā wheako whaiaro maha kei a kōutou kātoa.",
    "listedSalary": null,
    "hardSkills": "Aged Care Experience Delegation/Task Completion Health & Safety Protocols Mobility Support Personal Care Assistance",
    "softSkills": "Communication Empathy Flexibility Reliability Teamwork",
    "RoleLevel": "Entry Level"
  },
  {
    "title": "Registered Nurse",
    "listingDate": "Posted 1mo ago",
    "company": "Metlifecare",
    "location": "Whangārei",
    "employmentType": "Full Time, Fixed Term Contract",
    "description": "11-month fixed term RN role Incredible allowances on offerLovely Northland location in Whangarei - Work close to home and avoid the trafficAbout the roleWe are seeking a passionate Registered Nurses to join our team at our Whangarei Park Village in Whangarei, Northland. On offer roles is 40-hour a week FIXED TERM role till 18th October 2026- Candidates must be available to work mixed shifts and on weekends Some of the great things you will be doing:Clinical assessment, planning and implementation of nursing care.Effective communication and clinical problem-solving skillsWork collaboratively with other team membersDevelop and review care plans in consultation with our residents and their families.Provide compassionate and high-level care.About youYou pride yourself on delivering an outstanding service to our residents and have empathy for the older person. You also have:Current Practicing Certificate and first aid certificateStrong nursing experience, aged care - even better!InterRai qualified is desirable.Up to date knowledge of wound care managementDemonstrate excellent leadership and communication skills.You are also a team player with a caring, respectful manner which is important in our aged care environment.About usEstablished in 1984, Metlifecare is a leading owner and operator of retirement villages, providing rewarding lifestyles and care to more than 7,200 New Zealanders. We pride ourselves on providing retirement communities in which people are empowered to be the very best version of themselves. How to applyPlease apply by clicking on the below APPLY NOW button or by visiting our careers page www.careers.metlifecare.co.nz/homePlease note that Identification and work eligibility is required with your application. Metlifecare is committed to minimising adverse outcomes from the transmission of influenza or infectious diseases, and as such we request all potential employees disclose their immunisation status at the time of employment.",
    "listedSalary": "11-month fixed term RN role Incredible allowances on offerLovely Northland location in Whangarei - Work close to home and avoid the trafficAbout the roleWe are seeking a passionate Registered Nurses to join our team at our Whangarei Park Village in Whangarei, Northland",
    "hardSkills": "Care Planning Clinical Assessment First Aid Certification InterRai Qualification Wound Care Management",
    "softSkills": "Communication Compassion Leadership Problem-Solving Teamwork",
    "RoleLevel": "Mid Level"
  },
  {
    "title": "Regional Manager Northern",
    "listingDate": "Posted 1w ago",
    "company": "Westpac New Zealand",
    "location": "Northland",
    "employmentType": "Full Time",
    "description": "Regional Manager NorthernLeading our Northern RegionPermanent, Full-time position Based at Whangarei or Northshore Mō te Tūranga - About the role:We’re looking for a purpose-led leader to join our Community Banking team as a Regional Manager. This is a highly visible and influential role where you’ll champion Westpac’s commitment to supporting local communities, delivering exceptional customer experiences, and empowering your people to thrive.Reporting to the Head of Community Banking North, you’ll lead a team of Bank Managers and frontline staff, spending most of your time actively coaching, connecting, and collaborating. You’ll be the face of Westpac in your region — building trust, driving performance, and creating meaningful impact for the people and places we serve.Your community-focused leadership will include:Building a high-performance culture rooted in care, inclusion, and servicePartnering with local organisations, iwi, and community groups to strengthen regional relationshipsLeading your team to deliver Best Customer Outcomes across all channelsDriving regional business plans aligned to national strategy and local needsChampioning innovation and digital solutions that improve lives and streamline serviceSupporting capability development, retention, and succession planningEnsuring compliance and proactively managing riskMaximising regional sponsorships and community initiatives to deepen our local impact Na tōu rourou - What will you bring?We’re seeking community-minded leaders who bring heart, vision, and a drive to make a difference. You’ll be someone who thrives in a people-first environment and knows how to inspire teams to deliver with purpose.We’d like to see applications from individuals who demonstrate:Proven experience in banking or financial services, with a strong customer and community lensSuccess in leading large, diverse teams with a focus on coaching, development, and wellbeingA track record of delivering results in customer-centric environments within competitive marketsExceptional relationship-building skills with the ability to engage meaningfully across communities and partnersA mindset driven by innovation, inclusion, and continuous improvementStrong commercial acumen and understanding of financial and risk frameworksResilience, adaptability, and a passion for purpose-led leadershipA commitment to te ao Māori and cultural awareness, fostering a workplace where everyone feels seen, heard, and valued Westpac Hei Wāhi Mahi - Working at WestpacAt Westpac, our mission is to have New Zealand’s best professionals, to be recognised as a place where talent is developed to its fullest potential and where aspiring and current employees see Westpac as one of THE places to work. Along with this, we offer a range of benefits including:4 weeks standard holiday + 5 additional days of wellbeing leavePurchased leave options up to 4 weeks per yearBanking benefits and insurance discountsCareer growth – we promote internal capability; we have programmes that recognise star performersMarket leading superannuation and KiwiSaver optionsEnvironmental and community care programmesGenerous parental leave – and top up government paid parental leaveSchool holiday subsidy - help you balance work and family during school holidays Ko mātou tēnei | Our OrganisationAt Westpac, we’re working together to build a fairer and stronger New Zealand for our people, customers, and communities. For over 160 years we’ve been driven by our purpose to Create Better Futures Together.What makes us unique are the incredible people we’re lucky enough to have walk through our doors every day. The giant ‘W’ on our building doesn’t just stand for Westpac – it says, double you. We’re a place that values, rewards and recognises individuality. Where you can be your whole self, your true self, and your best self. We’re recognised as a place where talent is developed, where passions are fuelled and where ambitions of all shapes and sizes thrive. And it all starts with you!Tono mai ināianei! | Apply Now!Apply today with your CV and Cover Letter. The people of Aotearoa, New Zealand hail from many cultures and backgrounds. At Westpac New Zealand, we draw on this enormous talent pool to cultivate a team rich in ability and empowered to reach its full potential. Our aim is to be brave challengers, celebrating our differences and relentlessly advocating for our customers. It starts with us – we believe that when we care deeply and do our best for our people, they’ll do their best for our customers. We encourage people from all walks of life to apply, including those who are neurodiverse, have chronic health conditions or disabilities – your attitude and passion are as important to us as your experience, qualifications and capabilities. Mahi tahi tātou, kaha ake tātou | Together GreaterApplications close:8 December 2025",
    "listedSalary": "We’re a place that values, rewards and recognises individuality",
    "hardSkills": "Financial Services MS Office Risk Management",
    "softSkills": "Coordination Time Management Communication",
    "RoleLevel": "Senior"
  },
  {
    "title": "Spraypainter",
    "listingDate": "Posted 1w ago",
    "company": "Tony Gordon Panelbeaters",
    "location": "Vinetown",
    "employmentType": "Full Time, Fixed Term Contract",
    "description": "We are looking for a Spray Painter to fill in while our painter goes off to have a knee replacement.Initially we are looking at 2/3 months BUT this could lead to a full time permanent position.We are a medium sized shop that works on being a friendly happy place to come to work.Ideally the applicant would have experience at painting all types of vehicles.Experience in household cabinets would be great but not necessary.This position will be for the new year.Talk to us and tell us what you can do and what your plans are.Come to Whangarei for the summer but maybe stay for life, most people do",
    "listedSalary": "$40 /hr",
    "hardSkills": "Color Matching Sanding and Masking Spray Painting Surface Preparation Vehicle Painting",
    "softSkills": "Attention to Detail Communication Team Collaboration Time Management",
    "RoleLevel": "Associate"
  }
]